
&НаКлиенте
Процедура Создать(Команда)
	
	Форма = ПолучитьФорму("Справочник.Контрагенты.Форма.ФормаЭлемента",, ЭтаФорма);
	ДанныеФормы = Форма.Объект;
	ДанныеФормы.Наименование  = Объект.Наименование;
	ДанныеФормы.НомерТелефона = Объект.Телефон;
	ДанныеФормы.КонтактВайбер = Объект.Ссылка;
	Строка = ДанныеФормы.Телефоны.Добавить();
	Строка.НомерТелефона =  Объект.Телефон;
	Строка.Месенджер =   ВидыМесендеровViber();
	
	КопироватьДанныеФормы(ДанныеФормы, Форма.Объект);
	
	Форма.ОткрытьМодально();
	
	Прочитать();
	//Объект.Контрагент = Форма.Объект.Ссылка;
	Объект.Наименование = Объект.Контрагент; 
	
	//Закрыть();
	
		
КонецПроцедуры

&НаСервереБезКонтекста
Функция ВидыМесендеровViber()
	Возврат Перечисления.ВидыМесендеров.Viber;
КонецФункции


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОбновлениеПоляПерепискиВайбер();
	ПодключитьОбработчикОжидания("ОбновлениеПоляПерепискиВайбер", 10);
	ПодключитьОбработчикОжидания("ПереехатьВниз", 1, Истина);
		
	ПодключитьОбработчикОжидания("ОтправитьСообщениеПрочитано", 1, Ложь);

	Элементы.Группа3.Видимость = НЕ ЗначениеЗаполнено(Объект.Контрагент);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновлениеПоляПерепискиВайбер()Экспорт
	
	//Если ВводДоступен() Тогда
		Результат = ViberОбновлениеСервер.ПолучитьПолеПерепискиКонтакт(Объект.Ссылка, КаталогФайлов);
		Если Результат = Неопределено Тогда
			Возврат;
		КонецЕсли;
		
		Переписка = Результат.Переписка;
		
		ПодключитьОбработчикОжидания("ПереехатьВниз", 1, Истина);
	//КонецЕсли;	

	
	
КонецПроцедуры	

&НаКлиенте
Процедура ОтправитьСообщениеПрочитано()Экспорт
	
	Объект.НовоеСообщение = ПроверитьНовоеСообщение();
	
	Если Объект.НовоеСообщение Тогда
		ВыполнитьВФонеНаСервереСообщениеПрочитано();
		Объект.НовоеСообщение = Ложь;
		ЗаписатьСообщениеПрочитано();
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Функция ПроверитьНовоеСообщение()
	
	Запись = РегистрыСведений.НовоеСообщение.СоздатьМенеджерЗаписи();
	Запись.Контакт = Объект.Ссылка;
	Запись.Прочитать();
	Если Запись.Выбран() Тогда
		Возврат Запись.Новое;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

&НаСервере
Процедура ВыполнитьВФонеНаСервереСообщениеПрочитано()
	
	ViberОбновлениеСервер.ОтправитьСообщениеПрочитано(Объект.Ссылка);
	
	
КонецПроцедуры	

&НаСервере
Процедура ЗаписатьСообщениеПрочитано()
	
	Запись = РегистрыСведений.НовоеСообщение.СоздатьМенеджерЗаписи();
	Запись.Контакт = Объект.Ссылка;
	Запись.Прочитать();
	Если Запись.Выбран() Тогда
		Запись.Новое = Ложь;
		Запись.Записать();
	КонецЕсли;

	
КонецПроцедуры

&НаКлиенте
Процедура ПереехатьВниз()Экспорт
	
	Элементы.Переписка.Документ.body.scrollTop = Элементы.Переписка.Документ.body.scrollHeight + 9999;
	
	
КонецПроцедуры	

&НаКлиенте
Процедура ОтправитьСообщение(Команда)
	
	Если НЕ ЗначениеЗаполнено(НовоеСообщение) И Не ЗначениеЗаполнено(ВыбратьФайл) Тогда
		 #Если МобильноеПриложениеКлиент Тогда
			 Текст = "Вкажіть файл або введіть текст";  
			 СредстваМультимедиа.ВоспроизвестиТекст(Текст,,,,,Истина);
		 #Иначе
			 Текст = "Вкажіть файл або введіть текст";
			 Сообщить(Текст);
		 #КонецЕсли
	Иначе	 
		
		СписокПолучателей = ПолучитьСписокКлиентов();
		ViberОбновлениеКлиент.ОтправитьСообщенияСКлиента(СписокПолучателей, НовоеСообщение, ВыбратьФайл);			
	КонецЕсли;
	
	НовоеСообщение = "";
	ВыбратьФайл    = "";

	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьФайлНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	
	СтандартнаяОбработка = Ложь;
	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	
	Если Диалог.Выбрать() Тогда
    	ВыбратьФайл = Диалог.ПолноеИмяФайла;
	КонецЕсли;

	
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСписокКлиентов()
	
	МассивКонтрагентов = Новый Массив;
	
	МассивКонтрагентов.Добавить(Объект.Ссылка);		
	
	Возврат МассивКонтрагентов;
	
КонецФункции

&НаКлиенте
Процедура НовоеСообщениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Оповещение = Новый ОписаниеОповещения("ОткрытьПараметрыЗавершениеПроцент", ЭтотОбъект);
    ОткрытьФорму("Справочник.ШаблоныСообщений.Форма.ФормаВыбора", , , , , , Оповещение, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	
	
КонецПроцедуры

&НаКлиенте
Процедура НовоеСообщениеИзменениеТекстаРедактирования(Элемент, Текст, СтандартнаяОбработка)
	
	ОтключитьОбработчикОжидания("ОбновлениеПоляПерепискиВайбер");
	ОтключитьОбработчикОжидания("ОтправитьСообщениеПрочитано");	

КонецПроцедуры

&НаКлиенте
Процедура НовоеСообщениеОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	ПодключитьОбработчикОжидания("ОбновлениеПоляПерепискиВайбер", 10);
	ПодключитьОбработчикОжидания("ОтправитьСообщениеПрочитано", 10);
КонецПроцедуры

&НаКлиенте
Процедура ПерейтиУВайбер(Команда)
	
	ОбработатьПереходКВайберу(Объект.Телефон);
	ЭтаФорма.Закрыть();

КонецПроцедуры

&НаКлиенте
Процедура ОбработатьПереходКВайберу(Номер)
	
	ЗапуститьПриложение("viber://chat?number=" + Номер);	
	
КонецПроцедуры	

&НаКлиенте
Процедура КонтрагентИзменениеТекстаРедактирования(Элемент, Текст, СтандартнаяОбработка)
	
	ОтключитьОбработчикОжидания("ОбновлениеПоляПерепискиВайбер");
	ОтключитьОбработчикОжидания("ОтправитьСообщениеПрочитано");	

	
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	
	ПодключитьОбработчикОжидания("ОбновлениеПоляПерепискиВайбер", 10);
	ПодключитьОбработчикОжидания("ОтправитьСообщениеПрочитано", 10);
	
КонецПроцедуры

&НаКлиенте
Процедура ТелефонИзменениеТекстаРедактирования(Элемент, Текст, СтандартнаяОбработка)
	
	ОтключитьОбработчикОжидания("ОбновлениеПоляПерепискиВайбер");
	ОтключитьОбработчикОжидания("ОтправитьСообщениеПрочитано");	

	
КонецПроцедуры

&НаКлиенте
Процедура ДатаПодпискиИзменениеТекстаРедактирования(Элемент, Текст, СтандартнаяОбработка)
	
	ОтключитьОбработчикОжидания("ОбновлениеПоляПерепискиВайбер");
	ОтключитьОбработчикОжидания("ОтправитьСообщениеПрочитано");	

КонецПроцедуры

&НаКлиенте
Процедура ДатаПодпискиОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	
	ПодключитьОбработчикОжидания("ОбновлениеПоляПерепискиВайбер", 10);
	ПодключитьОбработчикОжидания("ОтправитьСообщениеПрочитано", 10);

КонецПроцедуры

&НаКлиенте
Процедура ТелефонОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	
	ПодключитьОбработчикОжидания("ОбновлениеПоляПерепискиВайбер", 10);
	ПодключитьОбработчикОжидания("ОтправитьСообщениеПрочитано", 10);

	
КонецПроцедуры
