#Область УДАЛЕНИЕ_ДАННЫХ

Процедура УдалитьВсеДанные(УдалитьВсе = Ложь) Экспорт
	
	ОчиститьРегистры();
	ОчиститьДокументы();
	ОчиститьСправочники();	
КонецПроцедуры

Процедура ОчиститьСправочники() Экспорт 
	
	Для каждого Справочник Из Метаданные.Справочники Цикл
		
		ИмяСправочника = Справочник.Имя;
		Если ИмяСправочника = "Нагадування" 
			ИЛИ ИмяСправочника = "Номенклатура" 
			ИЛИ ИмяСправочника = "Контрагенты"  
			ИЛИ ИмяСправочника = "СкладыКонтрагентов" 
			Тогда 
			Продолжить;
		КонецЕсли;
		
		
		Если Метаданные.Справочники[ИмяСправочника].Иерархический Тогда 
			Данные = Справочники[ИмяСправочника].ВыбратьИерархически();
		Иначе 
			Данные = Справочники[ИмяСправочника].Выбрать();
		КонецЕсли;	
		
		Пока Данные.Следующий() Цикл 
			Попытка
				Данные.ПолучитьОбъект().Удалить();
			Исключение
			КонецПопытки;
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ОчиститьДокументы() Экспорт
	Для каждого Док Из Метаданные.Документы Цикл
		
		ИмяДока = Док.Имя;
		
		Данные = Документы[ИмяДока].Выбрать();
		
		Пока Данные.Следующий() Цикл 
			Если ИмяДока = "Заказ" ИЛИ ИмяДока = "РеализацияТоваровУслуг" ИЛИ ИмяДока = "МаршрутныйЛист" ИЛИ ИмяДока = "КассовыйОрдер"  ИЛИ ИмяДока = "ВозвратОтПокупателя" Тогда 
				//Если Данные.Дата > ТекущаяДата() - 1209600 Тогда 
				Если Данные.Дата > ДобавитьМесяц(ТекущаяДата(), -6) Тогда 
					Продолжить;
				КонецЕсли;
			КонецЕсли;
				
			об = Данные.ПолучитьОбъект();
			Попытка
				об.мЭтоОбмен = Истина;
			Исключение
			КонецПопытки;

			
			//Попытка
				об.Записать(РежимЗаписиДокумента.ОтменаПроведения);
			//Исключение
			//КонецПопытки;
			
			//Попытка
			
			об.Удалить();
			//Исключение
				//Предупреждение(ОписаниеОшибки());
				//Возврат;
			//КонецПопытки;
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ОчиститьРегистры() Экспорт
	Для каждого Рег Из Метаданные.РегистрыСведений Цикл	
		ИмяРег = Рег.Имя;
		Если ИмяРег = "РегистрацияОбмена" 
			Или ИмяРег = "РаботаСКлиентом" 
			Или СтрНайти(Рег,"сообщения")
			Или ИмяРег = "ЗапланированыеУведомления"
			Или ИмяРег = "Лог" Тогда 
			//Передати маэм закази
			Продолжить;
		КонецЕсли;
		
		Если ИмяРег = "Кілометраж" Тогда 
			
			з = Новый Запрос;
			з.Текст = "ВЫБРАТЬ
			          |	КілометражРегистр.Период
			          |ИЗ
			          |	РегистрСведений.Кілометраж КАК КілометражРегистр
					  |ГДЕ
			          |	КілометражРегистр.Период < &Дата";
			з.УстановитьПараметр("Дата",ТекущаяДата() - 345600);
			НЗ = РегистрыСведений[ИмяРег].СоздатьНаборЗаписей();
			Выборка = з.Выполнить().Выбрать();
			Пока Выборка.Следующий() Цикл
				НЗ.Отбор.Период.Установить(Выборка.Период);
				НЗ.Записать();
			КонецЦикла;

				
			
			Продолжить;
		КонецЕсли;
		
		Если ИмяРег = "РегистрацияКоординат" Тогда 
			з = Новый Запрос;
			з.Текст = "ВЫБРАТЬ
			          |	РегистрацияКоординат.Дата
			          |ИЗ
			          |	РегистрСведений.РегистрацияКоординат КАК РегистрацияКоординат
			          |ГДЕ
			          |	РегистрацияКоординат.Дата < &Дата";
			з.УстановитьПараметр("Дата",ТекущаяДата() - 345600);
			НЗ = РегистрыСведений[ИмяРег].СоздатьНаборЗаписей();
			Выборка = з.Выполнить().Выбрать();
			Пока Выборка.Следующий() Цикл
				НЗ.Отбор.Дата.Установить(Выборка.Дата);
				НЗ.Записать();
			КонецЦикла;
				
			
			Продолжить;
		КонецЕсли;

		
		НЗ = РегистрыСведений[ИмяРег].СоздатьНаборЗаписей();
		НЗ.Записать();	                             
	КонецЦикла;
КонецПроцедуры

Процедура ОчиститьКонтрагентов(Контрагенты, ТаблицаИД)
	
	Для Каждого Элемент Из Контрагенты Цикл 
		
		Контрагент = Справочники.Контрагенты.ПолучитьСсылку(Элемент.Ссылка);
		НовСтр = ТаблицаИД.Добавить();
		НовСтр.ИД = Элемент.ИД;

		Если ПустаяСтрока(Контрагент.ВерсияДанных) Тогда 
			Продолжить;
		КонецЕсли;
		
		Контрагент.ПолучитьОбъект().Удалить();
		
	КонецЦикла;
	
		
КонецПроцедуры

#КонецОбласти


Процедура ПрочитатьПакетДанных(ДанныеОбменаСтруктура,ТаблицаИД)Экспорт
	
	ПринятьПакетКонстант(ДанныеОбменаСтруктура.Константы,ТаблицаИД);
	ПринятьПакетСправочников(ДанныеОбменаСтруктура.Справочники,ТаблицаИД);
	ПринятьПакетРегистровСведений(ДанныеОбменаСтруктура.РегистрСведений);
	ПринятьПакетДокументов(ДанныеОбменаСтруктура.Документы,ТаблицаИД);
КонецПроцедуры


#Область ЗАПОЛНЕНИЕ_СПРАВОЧНИКОВ

Процедура ПринятьПакетКонстант(СтруктураКонстант,ТаблицаИД)
	Перем Значение;
	Если СтруктураКонстант = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	Если СтруктураКонстант.Свойство("ТипЦенПродаж", Значение) Тогда 
		Константы.ТипЦенПродаж.Установить(Справочники.ТипыЦенНоменклатуры.ПолучитьСсылку(Значение));
		СтруктураКонстант.Удалить("ТипЦенПродаж");
	КонецЕсли;
	
	Если СтруктураКонстант.Свойство("Пользователь1с", Значение) Тогда 
		Константы.Пользователь1с.Установить(Справочники.УчасникиЧата.ПолучитьСсылку(Значение));
		СтруктураКонстант.Удалить("Пользователь1с");
	КонецЕсли;

	Для  Каждого Константа Из  СтруктураКонстант Цикл 
		Константы[Константа.Ключ].Установить(Константа.Значение);
	КонецЦикла;
КонецПроцедуры


Процедура ПринятьПакетСправочников(СтруктураСправочники,ТаблицаИД)
	Если СтруктураСправочники = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	Если СтруктураСправочники.Свойство("Удалить_Контрагенты") Тогда 
		ОчиститьКонтрагентов(СтруктураСправочники.Удалить_Контрагенты, ТаблицаИД);
		СтруктураСправочники.Удалить("Удалить_Контрагенты")
	КонецЕсли;
	
		
	Для  Каждого Справочник Из  СтруктураСправочники Цикл 
		
		Если Справочник.Ключ = "Номенклатура" ИЛИ Справочник.Ключ = "КлассификаторЕдиницИзмерения" Тогда 
			ИмяСправочника = Справочник.Ключ;
			ЗначенияСправочника = Справочник.Значение;
			СоздатьЭлементыСправочника(ИмяСправочника, ЗначенияСправочника,ТаблицаИД);
		КонецЕсли;
		
	КонецЦикла;
	
	Для  Каждого Справочник Из  СтруктураСправочники Цикл 
		Если Справочник.Ключ <> "Номенклатура" И Справочник.Ключ <> "КлассификаторЕдиницИзмерения" Тогда
			ИмяСправочника = Справочник.Ключ;
			ЗначенияСправочника = Справочник.Значение;
			СоздатьЭлементыСправочника(ИмяСправочника, ЗначенияСправочника,ТаблицаИД);
		КонецЕсли;
	КонецЦикла;
	
	
	
КонецПроцедуры

Процедура ПринятьПакетРегистровСведений(СтруктураРегистровСведений)
	
	Если СтруктураРегистровСведений = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	Для Каждого Регистр Из  СтруктураРегистровСведений Цикл 
		
		ИмяРегистра = Регистр.Ключ;
		ЗначенияРегистра = Регистр.Значение;
		СоздатьЭлементыРегистраСведений(ИмяРегистра, ЗначенияРегистра);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ПринятьПакетДокументов(СтруктураДокументов,ТаблицаИД)
	Если СтруктураДокументов = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	
	Для Каждого Док Из  СтруктураДокументов Цикл 	
		ИмяДокумента = Док.Ключ;
		ЗначенияДокумента = Док.Значение;
		СоздатьЭлементыДокумента(ИмяДокумента, ЗначенияДокумента,ТаблицаИД);	
	КонецЦикла;
	
КонецПроцедуры

Процедура СоздатьЭлементыСправочника(ИмяСправочника, ЗначенияСправочника,ТаблицаИД) Экспорт 
	
	Иерархический = Метаданные.Справочники[ИмяСправочника].Иерархический;
	
	Для Каждого СтрокаДанныеЭлемента Из ЗначенияСправочника Цикл 
		Если Не ЗначениеЗаполнено(СтрокаДанныеЭлемента.УИДСсылка) Тогда 
			Продолжить;
		КонецЕсли;
		
		НовыйОбъект = Справочники[ИмяСправочника].ПолучитьСсылку(СтрокаДанныеЭлемента.УИДСсылка).ПолучитьОбъект();
		
		Если НовыйОбъект = Неопределено Тогда 
			Если Иерархический И СтрокаДанныеЭлемента.ЭтоГруппа Тогда 
				НовыйОбъект = Справочники[ИмяСправочника].СоздатьГруппу(); 
			Иначе 
				НовыйОбъект = Справочники[ИмяСправочника].СоздатьЭлемент();
			КонецЕсли;	
			НовыйОбъект.УстановитьСсылкуНового(Справочники[ИмяСправочника].ПолучитьСсылку(СтрокаДанныеЭлемента.УИДСсылка));
		КонецЕсли;	
		Попытка
			НовыйОбъект.мЭтоОбмен = Истина;
		Исключение
		КонецПопытки;
		Если Иерархический И СтрокаДанныеЭлемента.ЭтоГруппа Тогда 
			ЗаполнитьЗначенияСвойств(НовыйОбъект, СтрокаДанныеЭлемента,"Наименование", "Ссылка");
			Для Каждого Реквизит Из НовыйОбъект.Метаданные().СтандартныеРеквизиты Цикл
				Если Реквизит.Имя = "Родитель" Тогда 
					НовыйОбъект.Родитель = Справочники[НовыйОбъект.Родитель.Метаданные().Имя].ПолучитьСсылку(СтрокаДанныеЭлемента.УИДРодитель);
				КонецЕсли;
			КонецЦикла;
			
		Иначе 
			Попытка                                         
				ЗаполнитьЗначенияСвойств(НовыйОбъект, СтрокаДанныеЭлемента,,"Ссылка");
			Исключение
				ЗаполнитьЗначенияСвойств(НовыйОбъект, СтрокаДанныеЭлемента);
			КонецПопытки;
			Для Каждого Реквизит Из НовыйОбъект.Метаданные().СтандартныеРеквизиты Цикл
				Если Реквизит.Имя = "Владелец" Тогда 
					НовыйОбъект.Владелец = Справочники[НовыйОбъект.Владелец.Метаданные().Имя].ПолучитьСсылку(СтрокаДанныеЭлемента.УИДВладелец);
				КонецЕсли;
				Если Реквизит.Имя = "Родитель" Тогда 
					НовыйОбъект.Родитель = Справочники[НовыйОбъект.Родитель.Метаданные().Имя].ПолучитьСсылку(СтрокаДанныеЭлемента.УИДРодитель);
				КонецЕсли;
				Если Реквизит.Имя = "Наименование" И ТипЗнч(НовыйОбъект) = Тип("СправочникОбъект.Номенклатура") Тогда 
					Если Лев(НовыйОбъект.Наименование,1) = "я" Тогда 
						НовыйОбъект.Наименование = "z"+НовыйОбъект.Наименование;
					КонецЕсли;
				КонецЕсли;
 
				
			КонецЦикла;
			Если НовыйОбъект.Метаданные().Реквизиты.Найти("ЕдиницаПоКлассификатору") <> Неопределено Тогда
				НовыйОбъект.ЕдиницаПоКлассификатору = Справочники[НовыйОбъект.ЕдиницаПоКлассификатору.Метаданные().Имя].ПолучитьСсылку(СтрокаДанныеЭлемента.УИДЕдиницаПоКлассификатору);
			КонецЕсли;
			Если НовыйОбъект.Метаданные().Реквизиты.Найти("Хранилище") <> Неопределено Тогда
				НовКартинка = Новый Картинка(XMLЗначение(Тип("ДвоичныеДанные"),СтрокаДанныеЭлемента.Хранилище));
				Сжатие = Новый СжатиеДанных(9);
				НовыйОбъект.Хранилище = Новый ХранилищеЗначения(НовКартинка,Сжатие);
			КонецЕсли;
			
			Если НовыйОбъект.Метаданные().Реквизиты.Найти("Номенклатура") <> Неопределено Тогда
				НовыйОбъект.Номенклатура = Справочники[НовыйОбъект.Номенклатура.Метаданные().Имя].ПолучитьСсылку(СтрокаДанныеЭлемента.УИДНоменклатура);
			КонецЕсли;
			
			Если НовыйОбъект.Метаданные().Реквизиты.Найти("ТипЦен") <> Неопределено Тогда
				НовыйОбъект.ТипЦен = Справочники[НовыйОбъект.ТипЦен.Метаданные().Имя].ПолучитьСсылку(СтрокаДанныеЭлемента.УИДТипЦен);
			КонецЕсли;

			Если НовыйОбъект.Метаданные().Реквизиты.Найти("Контрагент") <> Неопределено Тогда
				НовыйОбъект.Контрагент = Справочники[НовыйОбъект.Контрагент.Метаданные().Имя].ПолучитьСсылку(СтрокаДанныеЭлемента.УИДКонтрагент);
			КонецЕсли;
			
			Если НовыйОбъект.Метаданные().Реквизиты.Найти("Характеристика") <> Неопределено Тогда
				НовыйОбъект.Характеристика = Справочники[НовыйОбъект.Характеристика.Метаданные().Имя].ПолучитьСсылку(СтрокаДанныеЭлемента.УИДХарактеристика);
			КонецЕсли;
			
			Если НовыйОбъект.Метаданные().Реквизиты.Найти("Город") <> Неопределено Тогда
				НовыйОбъект.Город = Справочники[НовыйОбъект.Город.Метаданные().Имя].ПолучитьСсылку(СтрокаДанныеЭлемента.УИДГород);
			КонецЕсли;

			Если НовыйОбъект.Метаданные().Реквизиты.Найти("Область") <> Неопределено Тогда
				НовыйОбъект.Область = Справочники[НовыйОбъект.Область.Метаданные().Имя].ПолучитьСсылку(СтрокаДанныеЭлемента.УИДОбласть);
			КонецЕсли;
			
			Если НовыйОбъект.Метаданные().Реквизиты.Найти("СтатусКонтрагента") <> Неопределено Тогда
				НовыйОбъект.СтатусКонтрагента = Справочники.СтатусыКонтрагентов.ПолучитьСсылку(СтрокаДанныеЭлемента.УИДСтатусКонтрагента);
			КонецЕсли;
			
			Если НовыйОбъект.Метаданные().Реквизиты.Найти("ОперативныйСтатусКонтрагента") <> Неопределено Тогда
				НовыйОбъект.ОперативныйСтатусКонтрагента = Справочники.СтатусыКонтрагентов.ПолучитьСсылку(СтрокаДанныеЭлемента.УИДОперативныйСтатусКонтрагента);
			КонецЕсли;			
			
			Если НовыйОбъект.Метаданные().Реквизиты.Найти("ТорговыйАгент") <> Неопределено Тогда
				НовыйОбъект.ТорговыйАгент = Справочники.ТорговыеАгенты.ПолучитьСсылку(СтрокаДанныеЭлемента.УИДТорговыйАгент);
			КонецЕсли;
			
			
			Если НовыйОбъект.Метаданные().Реквизиты.Найти("Маршрут") <> Неопределено Тогда
				НовыйОбъект.Маршрут = Справочники.Маршруты.ПолучитьСсылку(СтрокаДанныеЭлемента.УИДМаршрут);
			КонецЕсли;

			
			Если НовыйОбъект.Метаданные().Реквизиты.Найти("КатегорияТТ") <> Неопределено Тогда
				НовыйОбъект.КатегорияТТ = Справочники.КатегорииТТ.ПолучитьСсылку(СтрокаДанныеЭлемента.УИДКатегорияТТ);
			КонецЕсли;

			
			Если НовыйОбъект.Метаданные().Реквизиты.Найти("СпособДоставки") <> Неопределено Тогда
				НовыйОбъект.СпособДоставки = Справочники.СпособыДоставки.ПолучитьСсылку(СтрокаДанныеЭлемента.УИДСпособДоставки);
			КонецЕсли;

			Если НовыйОбъект.Метаданные().Реквизиты.Найти("КаналПошуку") <> Неопределено Тогда
				НовыйОбъект.КаналПошуку = Справочники.КаналиПошуку.ПолучитьСсылку(СтрокаДанныеЭлемента.УИДКаналПошуку);
			КонецЕсли;

			Если НовыйОбъект.Метаданные().Реквизиты.Найти("КодАсортимета") <> Неопределено 
				И ТипЗнч(СтрокаДанныеЭлемента.КодАсортимета) = Тип("Число") Тогда
				НовыйОбъект.КодАсортимета = Перечисления.КодыАсортимета.Получить(СтрокаДанныеЭлемента.КодАсортимета);
			КонецЕсли;
			
			
			Если ИмяСправочника = "Контрагенты" Тогда
				НовыйОбъект.Телефоны.Очистить();
				Для Каждого Элемент Из СтрокаДанныеЭлемента.ТелефоныТЗ Цикл 
					Строка = НовыйОбъект.Телефоны.ДОбавить();
					Строка.НомерТелефона = Элемент.Номер;
					Если ТипЗнч(Элемент.ВидМесенджера) = Тип("Число") Тогда
						Строка.Месенджер = Перечисления.ВидыМесендеров.Получить(Элемент.ВидМесенджера);
					КонецЕсли;
				КонецЦикла;
				
				НовыйОбъект.Маршруты.Очистить();
				Для Каждого Элемент Из СтрокаДанныеЭлемента.Маршруты Цикл 
					Строка = НовыйОбъект.Маршруты.ДОбавить();
					Строка.Маршрут = Справочники.Маршруты.ПолучитьСсылку(Элемент.УИД_Маршрут);
				КонецЦикла;

				НовыйОбъект.БанковскиеСчета.Очистить();
				Для Каждого Элемент Из СтрокаДанныеЭлемента.БанковскиеСчетаДляОплаты Цикл 
					Строка = НовыйОбъект.БанковскиеСчета.ДОбавить();
					Строка.БанковскийСчет = Справочники.БанковскиеСчета.ПолучитьСсылку(Элемент.УИДБанковскийСчет);
				КонецЦикла; 				
				
				НовыйОбъект.Асортимент.Очистить();
				Для Каждого Элемент Из СтрокаДанныеЭлемента.Асортимент Цикл 
					Строка = НовыйОбъект.Асортимент.ДОбавить();
					Строка.Артикул = Элемент.Артикул;
					Строка.НеРучнаяЗапись = Не Элемент.РучнаяЗапись;
				КонецЦикла;    
				
				НовыйОбъект.АсортиментПрезентацій.Очистить();
				Для Каждого Элемент Из СтрокаДанныеЭлемента.АсортиментПрезентацій Цикл 
					Строка = НовыйОбъект.АсортиментПрезентацій.ДОбавить();
					Строка.Артикул = Элемент.Артикул;
					Строка.НеРучнаяЗапись = Не Элемент.РучнаяЗапись;
				КонецЦикла;
				
				Попытка
					НовыйОбъект.СоцМережі.Очистить();
					Для Каждого Элемент Из СтрокаДанныеЭлемента.СоцМережі Цикл 
						Строка = НовыйОбъект.СоцМережі.ДОбавить();
						Строка.Коментар = Элемент.Коментар;
						Строка.Посилання = Элемент.Посилання;
						Строка.Мережа = Элемент.Мережа;
					КонецЦикла;
				Исключение
				КонецПопытки;
				
			КонецЕсли;



			// Если НовыйОбъект.Метаданные().Реквизиты.Найти("ДатаСозданияЭлемента") <> Неопределено Тогда
			//	НовыйОбъект.Область = Справочники[НовыйОбъект.Область.Метаданные().Имя].ПолучитьСсылку(СтрокаДанныеЭлемента.УИДОбласть);
			//КонецЕсли;

		КонецЕсли;
		
		Попытка  
			НовыйОбъект.Записать();
			
			Если ЗначенияСправочника.Колонки.Найти("ИД") <> Неопределено И ЗначениеЗаполнено(СтрокаДанныеЭлемента.ИД) Тогда 
				НовСтр = ТаблицаИД.Добавить();
				НовСтр.ИД = СтрокаДанныеЭлемента.ИД;
			КонецЕсли;
		Исключение
			
		КонецПопытки;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура СоздатьЭлементыРегистраСведений(ИмяРегистра, ЗначенияРегистра)
	//Иерархический = Метаданные.Справочники[ИмяСправочника].Иерархический И Не ЗначенияСправочника.Колонки.Найти("ЭтоГруппа") = Неопределено;
	
	Для Каждого СтрокаДанныеЭлемента Из ЗначенияРегистра Цикл 
		Если ИмяРегистра = "Штрихкоды" Тогда 
			нз = РегистрыСведений.Штрихкоды.СоздатьНаборЗаписей();
			//нз.Отбор.Штрихкод.Использование = Истина;
			нз.Отбор.Владелец.Использование = Истина;
			нз.Отбор.ЕдиницаИзмерения.Использование = Истина;
			нз.Отбор.ХарактеристикаНоменклатуры.Использование = Истина;
			
			//нз.Отбор.Штрихкод.Значение = СтрокаДанныеЭлемента.Штрихкод;
			нз.Отбор.Владелец.Значение = Справочники.Номенклатура.ПолучитьСсылку(СтрокаДанныеЭлемента.УИДВладелец);
			нз.Отбор.ЕдиницаИзмерения.Значение = Справочники.ЕдиницыИзмерения.ПолучитьСсылку(СтрокаДанныеЭлемента.УИДЕдиницаИзмерения);
			нз.Отбор.ХарактеристикаНоменклатуры.Значение = Справочники.ХарактеристикиНоменклатуры.ПолучитьСсылку(СтрокаДанныеЭлемента.УИДХарактеристикаНоменклатуры);
			
			з = нз.Добавить();
			з.Штрихкод = СокрЛП(СтрокаДанныеЭлемента.Штрихкод);
			з.Владелец = Справочники.Номенклатура.ПолучитьСсылку(СтрокаДанныеЭлемента.УИДВладелец);
			з.ЕдиницаИзмерения = Справочники.ЕдиницыИзмерения.ПолучитьСсылку(СтрокаДанныеЭлемента.УИДЕдиницаИзмерения);
			з.ХарактеристикаНоменклатуры = Справочники.ХарактеристикиНоменклатуры.ПолучитьСсылку(СтрокаДанныеЭлемента.УИДХарактеристикаНоменклатуры);
			
			нз.Записать();	
		ИначеЕсли ИмяРегистра = "ОтгруженныеЗаказы" Тогда
			нз = РегистрыСведений.ОтгруженныеЗаказы.СоздатьНаборЗаписей();
			нз.Отбор.Ссылка.Использование = Истина;

			нз.Отбор.Ссылка.Значение = Документы.Заказ.ПолучитьСсылку(СтрокаДанныеЭлемента.УИДСсылка);
			
			з = нз.Добавить();
			з.Ссылка = Документы.Заказ.ПолучитьСсылку(СтрокаДанныеЭлемента.УИДСсылка);
			нз.Записать();				
		ИначеЕсли  ИмяРегистра = "ЦеныНоменклатуры" Тогда
			нз = РегистрыСведений.ЦеныНоменклатуры.СоздатьНаборЗаписей();
			нз.Отбор.ТипЦен.Использование = Истина;
			нз.Отбор.Номенклатура.Использование = Истина;
			нз.Отбор.ХарактеристикаНоменклатуры.Использование = Истина;
			
			
			нз.Отбор.ТипЦен.Значение = Справочники.ТипыЦенНоменклатуры.ПолучитьСсылку(СтрокаДанныеЭлемента.УИДТипЦен);
			нз.Отбор.Номенклатура.Значение = Справочники.Номенклатура.ПолучитьСсылку(СтрокаДанныеЭлемента.УИДНоменклатура);
			нз.Отбор.ХарактеристикаНоменклатуры.Значение = Справочники.ХарактеристикиНоменклатуры.ПолучитьСсылку(СтрокаДанныеЭлемента.УИДХарактеристикаНоменклатуры);
			
			з = нз.Добавить();
			
			з.ТипЦен = Справочники.ТипыЦенНоменклатуры.ПолучитьСсылку(СтрокаДанныеЭлемента.УИДТипЦен);
			з.Номенклатура = Справочники.Номенклатура.ПолучитьСсылку(СтрокаДанныеЭлемента.УИДНоменклатура);
			з.ХарактеристикаНоменклатуры = Справочники.ХарактеристикиНоменклатуры.ПолучитьСсылку(СтрокаДанныеЭлемента.УИДХарактеристикаНоменклатуры);
			з.Цена = СтрокаДанныеЭлемента.Цена;
			з.ЕдиницаИзмерения = Справочники.ЕдиницыИзмерения.ПолучитьСсылку(СтрокаДанныеЭлемента.УИДЕдиницаИзмерения);
			нз.Записать();	
			
		ИначеЕсли  ИмяРегистра = "НормыЗапасов" Тогда
			ТекНом = Справочники.Номенклатура.ПолучитьСсылку(СтрокаДанныеЭлемента.УИДНоменклатура);
			ТекХар = Справочники.ХарактеристикиНоменклатуры.ПолучитьСсылку(СтрокаДанныеЭлемента.УИДХарактеристикаНоменклатуры);
			ТекЕдИзм = Справочники.ЕдиницыИзмерения.ПолучитьСсылку(СтрокаДанныеЭлемента.УИДЕдиницаИзмерения);
			
			Запрос = Новый Запрос;
			Запрос.Текст="ВЫБРАТЬ
			             |	НормыЗапасов.Количество,
			             |	НормыЗапасов.Дата
			             |ИЗ
			             |	РегистрСведений.НормыЗапасов КАК НормыЗапасов
			             |ГДЕ
			             |	НормыЗапасов.Номенклатура = &Номенклатура
			             |	И НормыЗапасов.ХарактеристикаНоменклатуры = &ХарактеристикаНоменклатуры
			             |	И НормыЗапасов.ЕдиницаИзмерения = &ЕдиницаИзмерения";
			Запрос.УстановитьПараметр("Номенклатура",ТекНом);
			Запрос.УстановитьПараметр("ХарактеристикаНоменклатуры",ТекХар);
			Запрос.УстановитьПараметр("ЕдиницаИзмерения",ТекЕдИзм);
			Выборка = Запрос.Выполнить().Выбрать();
			Если Выборка.Следующий() И Выборка.Дата > СтрокаДанныеЭлемента.Дата Тогда 
				
			Иначе 
				нз = РегистрыСведений.НормыЗапасов.СоздатьНаборЗаписей();
				нз.Отбор.ЕдиницаИзмерения.Использование = Истина;
				нз.Отбор.Номенклатура.Использование = Истина;
				нз.Отбор.ХарактеристикаНоменклатуры.Использование = Истина;
				
				
				нз.Отбор.ЕдиницаИзмерения.Значение = ТекЕдИзм;
				нз.Отбор.Номенклатура.Значение = ТекНом;
				нз.Отбор.ХарактеристикаНоменклатуры.Значение = ТекХар;
				
				з = нз.Добавить();
				
				з.Номенклатура = ТекНом;
				з.ХарактеристикаНоменклатуры = ТекХар;
				з.Количество = СтрокаДанныеЭлемента.Количество;
				з.Дата = СтрокаДанныеЭлемента.Дата;
				з.ЕдиницаИзмерения = ТекЕдИзм;
				нз.Записать();	
			КонецЕсли;
			
		//intrata_wald_08092021 ↓
		ИначеЕсли  ИмяРегистра = "КатегорииОбъектов" Тогда
			Объект = Справочники.Номенклатура.ПолучитьСсылку(СтрокаДанныеЭлемента.УИДОбъект);
			Категория = Справочники.КатегорииОбъектов.ПолучитьСсылку(СтрокаДанныеЭлемента.УИДКатегория);
			МЗ = РегистрыСведений.КатегорииОбъектов.СоздатьМенеджерЗаписи();
			МЗ.Объект = Объект;
			МЗ.Категория = Категория;
			МЗ.Записать(Истина);
			//intrata_wald_08092021 ↑
			
		ИначеЕсли  ИмяРегистра = "ИсторияРаботыСКлиентом" Тогда 		
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	РаботаСКлиентом.Период КАК Период
			|ИЗ
			|	РегистрСведений.РаботаСКлиентом КАК РаботаСКлиентом
			|ГДЕ
			|	РаботаСКлиентом.УИД_Записи = &УИД_Записи";
			
			Запрос.УстановитьПараметр("УИД_Записи", СтрокаДанныеЭлемента.УИД_Записи);
			
			РезультатЗапроса = Запрос.Выполнить();
			
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
			
			Если ВыборкаДетальныеЗаписи.Количество() = 0 Тогда 
				
				Контрагент = Справочники.Контрагенты.ПолучитьСсылку(СтрокаДанныеЭлемента.УИДКлиент);
				Если ЗначениеЗаполнено(Контрагент.ВерсияДанных) Тогда
					
					МЗ = РегистрыСведений.РаботаСКлиентом.СоздатьМенеджерЗаписи();
					МЗ.Период = СтрокаДанныеЭлемента.Период;
					МЗ.Клиент = Контрагент;
					МЗ.Запись = СтрокаДанныеЭлемента.Запись;
					МЗ.УИД_Записи = СтрокаДанныеЭлемента.УИД_Записи;
					МЗ.АвтоматичнийЗаписБезВзаємодіїЗКлієнтом = СтрокаДанныеЭлемента.АвтоматичнийЗаписБезВзаємодіїЗКлієнтом;
				    МЗ.Записать(Истина);
					Общий.ОбновитьПоследнююРаботуСКлиентом(Контрагент);
				КонецЕсли;
			КонецЕсли;   	
			
		КонецЕсли;
		
	КонецЦикла;
КонецПроцедуры

Процедура СоздатьЭлементыДокумента(ИмяДокумента, ЗначенияДокумента, ТаблицаИД)
	МассивДокументов = Новый Массив;      

	Если ИмяДокумента = "Перемещение" Тогда 
		НовыйОбъект = Документы.Приход.СоздатьДокумент();
		НовыйОбъект.Дата = НачалоДня(ТекущаяДата());
		ТекущаяСсылка = "";
		Для Каждого СтрокаДанныеЭлемента Из ЗначенияДокумента Цикл
			
			ИмяДок = "Приход";
			//Если СтрокаДанныеЭлемента.ЭтоВозврат Тогда 
			//	ИмяДок = "Возврат";
			//КонецЕсли;
			
			//НовыйОбъект = Документы[ИмяДок].ПолучитьСсылку(СтрокаДанныеЭлемента.УИДСсылка).ПолучитьОбъект();
			//Если НовыйОбъект = Неопределено Тогда 
			//	НовыйОбъект = Документы[ИмяДок].СоздатьДокумент();	
			//	НовыйОбъект.УстановитьСсылкуНового(Документы[ИмяДок].ПолучитьСсылку(СтрокаДанныеЭлемента.УИДСсылка));
			//Иначе
				НовыйОбъект.Записать(РежимЗаписиДокумента.Запись);
			//КонецЕсли;
			
			//Если ТекущаяСсылка <> СтрокаДанныеЭлемента.Ссылка Тогда 
			//	НовыйОбъект.Товары.Очистить();
			//	ТекущаяСсылка = СтрокаДанныеЭлемента.Ссылка;
			//	Попытка
			//		Если ЗначениеЗаполнено(СтрокаДанныеЭлемента.ИД) Тогда 
						НовСтр = ТаблицаИД.Добавить();
						НовСтр.ИД = СтрокаДанныеЭлемента.ИД;
			//		КонецЕсли;
			//	Исключение
			//	КонецПопытки;
			//КонецЕсли;
			
			СтрокаТоваров = НовыйОбъект.Товары.Добавить();
			ЗаполнитьЗначенияСвойств(НовыйОбъект,СтрокаДанныеЭлемента);
			ЗаполнитьЗначенияСвойств(СтрокаТоваров,СтрокаДанныеЭлемента);
			//Если ЗначениеЗаполнено(СтрокаДанныеЭлемента.Префикс) Тогда 
			//	НовыйОбъект.Номер = СтрокаДанныеЭлемента.Префикс + Сред(НовыйОбъект.Номер,2);
			//КонецЕсли;
			                   
			СтрокаТоваров.Номенклатура = Справочники.Номенклатура.ПолучитьСсылку(СтрокаДанныеЭлемента.УИДНоменклатура);
			СтрокаТоваров.ХарактеристикаНоменклатуры = Справочники.ХарактеристикиНоменклатуры.ПолучитьСсылку(СтрокаДанныеЭлемента.УИДХарактеристикаНоменклатуры);
			СтрокаТоваров.ЕдиницаИзмерения = Справочники.ЕдиницыИзмерения.ПолучитьСсылку(СтрокаДанныеЭлемента.УИДЕдиницаИзмерения);
			Попытка
				СтрокаТоваров.Штрихкод = Общий.ПолучитьШтрихкодТовара(СтрокаТоваров.Номенклатура,СтрокаТоваров.ХарактеристикаНоменклатуры,СтрокаТоваров.ЕдиницаИзмерения);
			Исключение
				ы=1;
			КонецПопытки;
			НовыйОбъект.Записать();
			Если МассивДокументов.Найти(НовыйОбъект.Ссылка) = Неопределено Тогда 
				МассивДокументов.Добавить(НовыйОбъект.Ссылка);
			КонецЕсли;
		КонецЦикла;
	ИначеЕсли ИмяДокумента = "Реализация" Тогда
		ТекущаяСсылка = "";
		Для Каждого СтрокаДанныеЭлемента Из ЗначенияДокумента Цикл
			
			ИмяДок = "РеализацияТоваровУслуг";
			
			НовыйОбъект = Документы[ИмяДок].ПолучитьСсылку(СтрокаДанныеЭлемента.УИДСсылка).ПолучитьОбъект();
			
			Если НовыйОбъект = Неопределено Тогда 
				НовыйОбъект = Документы[ИмяДок].СоздатьДокумент();	
				НовыйОбъект.УстановитьСсылкуНового(Документы[ИмяДок].ПолучитьСсылку(СтрокаДанныеЭлемента.УИДСсылка));
			Иначе
				НовыйОбъект.мЭтоОбмен = Истина;
				НовыйОбъект.Записать(РежимЗаписиДокумента.ОтменаПроведения);
			КонецЕсли;
			
			ЗаполнитьЗначенияСвойств(НовыйОбъект,СтрокаДанныеЭлемента);
			
			Если ТекущаяСсылка <> НовыйОбъект.Ссылка Тогда 
				НовыйОбъект.Товары.Очистить();
				НовыйОбъект.Контрагент 		= Справочники.Контрагенты.ПолучитьСсылку(СтрокаДанныеЭлемента.УИДКонтрагент);
				НовыйОбъект.МаршрутныйЛист 	= Документы.МаршрутныйЛист.ПолучитьСсылку(СтрокаДанныеЭлемента.УИДМаршрутныйЛист);
				НовыйОбъект.Сделка 			= Документы.Заказ.ПолучитьСсылку(СтрокаДанныеЭлемента.УИДСделка);
				НовыйОбъект.ТипЦен 			= Справочники.ТипыЦенНоменклатуры.ПолучитьСсылку(СтрокаДанныеЭлемента.УИДТипЦен);
				НовыйОбъект.Наложка			= СтрокаДанныеЭлемента.Наложка; //+wald_intrata_19112021
				Попытка
					Если ЗначениеЗаполнено(СтрокаДанныеЭлемента.ИД) Тогда 
						НовСтр = ТаблицаИД.Добавить();
						НовСтр.ИД = СтрокаДанныеЭлемента.ИД;
					КонецЕсли;
				Исключение
				КонецПопытки;
			КонецЕсли;
			
			СтрокаТоваров = НовыйОбъект.Товары.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаТоваров,СтрокаДанныеЭлемента);
			СтрокаТоваров.Номенклатура = Справочники.Номенклатура.ПолучитьСсылку(СтрокаДанныеЭлемента.УИДНоменклатура);
			СтрокаТоваров.ХарактеристикаНоменклатуры = Справочники.ХарактеристикиНоменклатуры.ПолучитьСсылку(СтрокаДанныеЭлемента.УИДХарактеристикаНоменклатуры);
			СтрокаТоваров.ЕдиницаИзмерения = Справочники.ЕдиницыИзмерения.ПолучитьСсылку(СтрокаДанныеЭлемента.УИДЕдиницаИзмерения);
			Попытка
				СтрокаТоваров.Штрихкод = Общий.ПолучитьШтрихкодТовара(СтрокаТоваров.Номенклатура,СтрокаТоваров.ХарактеристикаНоменклатуры,СтрокаТоваров.ЕдиницаИзмерения);
			Исключение
			КонецПопытки;
			СтрокаТоваров.Сума = СтрокаТоваров.Количество * СтрокаТоваров.Цена;
			НовыйОбъект.мЭтоОбмен = Истина;
			НовыйОбъект.Записать();
			ТекущаяСсылка = НовыйОбъект.Ссылка;
			Если МассивДокументов.Найти(НовыйОбъект.Ссылка) = Неопределено Тогда 
				МассивДокументов.Добавить(НовыйОбъект.Ссылка);
			КонецЕсли;
		КонецЦикла;	
	ИначеЕсли ИмяДокумента = "КассовыеОрдеры" Тогда
		ТекущаяСсылка = "";
		Для Каждого СтрокаДанныеЭлемента Из ЗначенияДокумента Цикл
			
			ИмяДок = "КассовыйОрдер";
			
			НовыйОбъект = Документы[ИмяДок].ПолучитьСсылку(СтрокаДанныеЭлемента.УИДСсылка).ПолучитьОбъект();
			//НовыйОбъект.мЭтоОбмен = Истина;
			Если НовыйОбъект = Неопределено Тогда 
				НовыйОбъект = Документы[ИмяДок].СоздатьДокумент();	
				НовыйОбъект.УстановитьСсылкуНового(Документы[ИмяДок].ПолучитьСсылку(СтрокаДанныеЭлемента.УИДСсылка));
			Иначе
				//Попытка
				//	Если НЕ Число(НовыйОбъект.Номер) Тогда 
				//		НовыйОбъект.Номер = "";
				//	КонецЕсли;
				//Исключение
				//КонецПопытки;
				НовыйОбъект.Записать(РежимЗаписиДокумента.ОтменаПроведения);
			КонецЕсли;
			
			Если ТекущаяСсылка <> СтрокаДанныеЭлемента.Ссылка Тогда 
				//НовыйОбъект.Товары.Очистить();
				ТекущаяСсылка = СтрокаДанныеЭлемента.Ссылка;
				Попытка
					Если ЗначениеЗаполнено(СтрокаДанныеЭлемента.ИД) Тогда 
						НовСтр = ТаблицаИД.Добавить();
						НовСтр.ИД = СтрокаДанныеЭлемента.ИД;
					КонецЕсли;
				Исключение
				КонецПопытки;
			КонецЕсли;
			
			
			ЗаполнитьЗначенияСвойств(НовыйОбъект,СтрокаДанныеЭлемента);
			Если  СтрокаДанныеЭлемента.ВидДвижения = 1 Тогда 
				НовыйОбъект.ВидДвиженияДенежныхСредств = Перечисления.ВидДвиженияДенежныхСредств.Приход;
				НовыйОбъект.Номер = "П"+СтрокаДанныеЭлемента.Номер;
			Иначе 
				НовыйОбъект.ВидДвиженияДенежныхСредств = Перечисления.ВидДвиженияДенежныхСредств.Расход;
				НовыйОбъект.Номер = "Р"+СтрокаДанныеЭлемента.Номер;
			КонецЕсли;
			НовыйОбъект.СуммаДокумента = СтрокаДанныеЭлемента.СуммаДокумента; 
			//Попытка
			//	Если НЕ Число(НовыйОбъект.Номер) Тогда 
			//		НовыйОбъект.Номер = "";
			//	КонецЕсли;
			//Исключение
			//КонецПопытки;
			НовыйОбъект.Записать();
			Если МассивДокументов.Найти(НовыйОбъект.Ссылка) = Неопределено Тогда 
				МассивДокументов.Добавить(НовыйОбъект.Ссылка);
			КонецЕсли;
		КонецЦикла;			
	ИначеЕсли ИмяДокумента = "ВозвратОтПокупателя" Тогда     /// Доробити
		ТекущаяСсылка = "";
		Для Каждого СтрокаДанныеЭлемента Из ЗначенияДокумента Цикл
			
			ИмяДок = "ВозвратОтПокупателя";
			
			НовыйОбъект = Документы[ИмяДок].ПолучитьСсылку(СтрокаДанныеЭлемента.УИДСсылка).ПолучитьОбъект();
			
			Если НовыйОбъект = Неопределено Тогда 
				НовыйОбъект = Документы[ИмяДок].СоздатьДокумент();	
				НовыйОбъект.УстановитьСсылкуНового(Документы[ИмяДок].ПолучитьСсылку(СтрокаДанныеЭлемента.УИДСсылка));
			Иначе
				НовыйОбъект.мЭтоОбмен = Истина;
				НовыйОбъект.Записать(РежимЗаписиДокумента.ОтменаПроведения);
			КонецЕсли;
			
			Если ТекущаяСсылка <> СтрокаДанныеЭлемента.Ссылка Тогда 
				НовыйОбъект.Товары.Очистить();
				ТекущаяСсылка = СтрокаДанныеЭлемента.Ссылка;
				Попытка
					Если ЗначениеЗаполнено(СтрокаДанныеЭлемента.ИД) Тогда 
						НовСтр = ТаблицаИД.Добавить();
						НовСтр.ИД = СтрокаДанныеЭлемента.ИД;
					КонецЕсли;
				Исключение
				КонецПопытки;
			КонецЕсли;
			
			СтрокаТоваров = НовыйОбъект.Товары.Добавить();
			ЗаполнитьЗначенияСвойств(НовыйОбъект,СтрокаДанныеЭлемента);
			ЗаполнитьЗначенияСвойств(СтрокаТоваров,СтрокаДанныеЭлемента);
			СтрокаТоваров.Номенклатура = Справочники.Номенклатура.ПолучитьСсылку(СтрокаДанныеЭлемента.УИДНоменклатура);
			СтрокаТоваров.ХарактеристикаНоменклатуры = Справочники.ХарактеристикиНоменклатуры.ПолучитьСсылку(СтрокаДанныеЭлемента.УИДХарактеристикаНоменклатуры);
			СтрокаТоваров.ЕдиницаИзмерения = Справочники.ЕдиницыИзмерения.ПолучитьСсылку(СтрокаДанныеЭлемента.УИДЕдиницаИзмерения);
			Попытка
				СтрокаТоваров.Штрихкод = Общий.ПолучитьШтрихкодТовара(СтрокаТоваров.Номенклатура,СтрокаТоваров.ХарактеристикаНоменклатуры,СтрокаТоваров.ЕдиницаИзмерения);
			Исключение
			КонецПопытки;
			СтрокаТоваров.Сумма = СтрокаТоваров.Количество * СтрокаТоваров.Цена;
			СтрокаТоваров.СуммаПартнера = СтрокаТоваров.Количество * СтрокаТоваров.ЦенаПартнера;
			НовыйОбъект.мЭтоОбмен = Истина;
			НовыйОбъект.Записать();
			Если МассивДокументов.Найти(НовыйОбъект.Ссылка) = Неопределено Тогда 
				МассивДокументов.Добавить(НовыйОбъект.Ссылка);
			КонецЕсли;
		КонецЦикла;	
	ИначеЕсли ИмяДокумента = "Заказы" Тогда
		ТекущаяСсылка = "";
		
		Для Каждого СтрокаДанныеЭлемента Из ЗначенияДокумента Цикл
			
			ИмяДок = "Заказ";
			
			НовыйОбъект = Документы[ИмяДок].ПолучитьСсылку(СтрокаДанныеЭлемента.Ссылка).ПолучитьОбъект();
			
			Если НовыйОбъект = Неопределено Тогда 
				НовыйОбъект = Документы[ИмяДок].СоздатьДокумент();	
				НовыйОбъект.УстановитьСсылкуНового(Документы[ИмяДок].ПолучитьСсылку(СтрокаДанныеЭлемента.Ссылка));
			КонецЕсли;
			
			НовыйОбъект.Коментар = СтрокаДанныеЭлемента.Комментарий;
			НовыйОбъект.Наложка	= СтрокаДанныеЭлемента.Наложка; //+wald_intrata_19112021
			НовыйОбъект.Контрагент = Справочники.Контрагенты.ПолучитьСсылку(СтрокаДанныеЭлемента.Контрагент);
			НовыйОбъект.ТипЦен = Справочники.ТипыЦенНоменклатуры.ПолучитьСсылку(СтрокаДанныеЭлемента.ТипЦен);
			НовыйОбъект.Сума = СтрокаДанныеЭлемента.СуммаДокумента;
			НовыйОбъект.Дата = СтрокаДанныеЭлемента.Дата;
			НовыйОбъект.Доставка = ?(СтрокаДанныеЭлемента.Доставка = "000000001", Перечисления.НаявністьДоставки.Самовывоз,
			                       ?(СтрокаДанныеЭлемента.Доставка = "000000002", Перечисления.НаявністьДоставки.Доставка,
								   ?(СтрокаДанныеЭлемента.Доставка = "000000003", Перечисления.НаявністьДоставки.Почта, 
								                                                  Перечисления.НаявністьДоставки.ПустаяСсылка())));
																				  
			НовыйОбъект.ПометкаУдаления = СтрокаДанныеЭлемента.ПометкаУдаления;
			НовыйОбъект.мЭтоОбмен = Истина;
			НовыйОбъект.Архив = Истина;
			НовыйОбъект.Товары.Очистить();
			Для Каждого Элемент Из СтрокаДанныеЭлемента.Товары Цикл 
				
				НоваяСтрока = НовыйОбъект.Товары.Добавить();
				НоваяСтрока.Номенклатура               	= Справочники.Номенклатура.ПолучитьСсылку(Элемент.Номенклатура);
				НоваяСтрока.ХарактеристикаНоменклатуры  = Справочники.ХарактеристикиНоменклатуры.ПолучитьСсылку(Элемент.ХарактеристикаНоменклатуры);
				НоваяСтрока.ЕдиницаИзмерения            = Справочники.ЕдиницыИзмерения.ПолучитьСсылку(Элемент.ЕдиницаИзмерения);
				НоваяСтрока.Количество                  = Элемент.Количество;
				//НоваяСтрока.Штрихкод                    = Элемент.
				НоваяСтрока.Цена                       	= Элемент.Цена;
				НоваяСтрока.Сума                        = Элемент.Сумма;
				НоваяСтрока.ЦенаПродажиВес              = Элемент.ЦенаПродажиВес;
				
			КонецЦикла;
			
			НовыйОбъект.Записать(РежимЗаписиДокумента.ОтменаПроведения);
			НовСтр = ТаблицаИД.Добавить();
			НовСтр.ИД = СтрокаДанныеЭлемента.ИД;
			МассивДокументов.Добавить(НовыйОбъект.Ссылка)

		КонецЦикла;	
	ИначеЕсли ИмяДокумента = "МаршрутныйЛист" Тогда
		НеХватает = Неопределено;
		ТекущаяСсылка = "";
		Для Каждого СтрокаДанныеЭлемента Из ЗначенияДокумента Цикл
			СтрокаДанныеЭлемента.Свойство("НеХватает", НеХватает);
			ИмяДок 		= "МаршрутныйЛист";
			НовыйОбъект = Документы[ИмяДок].ПолучитьСсылку(СтрокаДанныеЭлемента.Ссылка).ПолучитьОбъект();
			Если НовыйОбъект = Неопределено Тогда 
				НовыйОбъект = Документы[ИмяДок].СоздатьДокумент();	
				НовыйОбъект.УстановитьСсылкуНового(Документы[ИмяДок].ПолучитьСсылку(СтрокаДанныеЭлемента.Ссылка));
			КонецЕсли;
			НовыйОбъект.СтатусДокумента = ?(СтрокаДанныеЭлемента.СтатусДокумента = "Составляется", Перечисления.СтатусыМаршрутногоЛиста.Составляется,
			                       ?(СтрокаДанныеЭлемента.СтатусДокумента = "Отправлен", Перечисления.СтатусыМаршрутногоЛиста.Отправлен,
								   ?(СтрокаДанныеЭлемента.СтатусДокумента = "Завершен", Перечисления.СтатусыМаршрутногоЛиста.Завершен, 
								                                                  Перечисления.СтатусыМаршрутногоЛиста.ПустаяСсылка())));
			НовыйОбъект.Комментарий 	= СтрокаДанныеЭлемента.Комментарий;
			НовыйОбъект.Дата 			= СтрокаДанныеЭлемента.Дата;
			НовыйОбъект.ПометкаУдаления = СтрокаДанныеЭлемента.ПометкаУдаления;
			НовыйОбъект.мЭтоОбмен 		= Истина;
			НовыйОбъект.Архив 			= Истина;
			НовыйОбъект.Заказы.Очистить();
			Для Каждого Элемент Из СтрокаДанныеЭлемента.Заказы Цикл 
				НоваяСтрока = НовыйОбъект.Заказы.Добавить();
				НоваяСтрока.ЗаказПокупателя            	= Документы.Заказ.ПолучитьСсылку(Элемент.ЗаказПокупателя);
				НоваяСтрока.Контрагент               	= Справочники.Контрагенты.ПолучитьСсылку(Элемент.Контрагент);
				НоваяСтрока.Город          				= НоваяСтрока.Контрагент.Город;
			КонецЦикла;
			НовыйОбъект.Записать(РежимЗаписиДокумента.Запись);
			ЗапросПоРеализациямМаршрутника = Новый Запрос;
			ЗапросПоРеализациямМаршрутника.Текст = "ВЫБРАТЬ
			                                       |	РеализацияТоваровУслуг.Ссылка КАК Ссылка,
			                                       |	РеализацияТоваровУслуг.Контрагент КАК Контрагент,
			                                       |	РеализацияТоваровУслуг.Сума КАК Сума,
			                                       |	РеализацияТоваровУслуг.Сделка КАК Сделка
			                                       |ИЗ
			                                       |	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
			                                       |ГДЕ
			                                       |	НЕ РеализацияТоваровУслуг.Архив
			                                       |	И РеализацияТоваровУслуг.МаршрутныйЛист <> ЗНАЧЕНИЕ(Документ.МаршрутныйЛист.ПустаяСсылка)
			                                       |	И РеализацияТоваровУслуг.МаршрутныйЛист.Ссылка = &Ссылка";
			ЗапросПоРеализациямМаршрутника.УстановитьПараметр("Ссылка", НовыйОбъект.Ссылка);
			СвязанныеРеализации = ЗапросПоРеализациямМаршрутника.Выполнить().Выбрать();
			НовыйОбъект.Реализации.Очистить();
			Пока СвязанныеРеализации.Следующий() Цикл 
				НоваяСтрока = НовыйОбъект.Реализации.Добавить();
				НоваяСтрока.ЗаказПокупателя	= СвязанныеРеализации.Сделка;
				НоваяСтрока.Контрагент      = СвязанныеРеализации.Контрагент;
				НоваяСтрока.Реализация      = СвязанныеРеализации.Ссылка;
				НоваяСтрока.Сумма          	= СвязанныеРеализации.Сума;
			КонецЦикла;	
			НовыйОбъект.ТоварыЗаказов.Очистить();
			Для Каждого Элемент Из СтрокаДанныеЭлемента.Товары Цикл 
				НоваяСтрока = НовыйОбъект.ТоварыЗаказов.Добавить();
				НоваяСтрока.ЗаказПокупателя            	= Документы.Заказ.ПолучитьСсылку(Элемент.ЗаказПокупателя);
				НоваяСтрока.Контрагент               	= Справочники.Контрагенты.ПолучитьСсылку(Элемент.Контрагент);
				НоваяСтрока.Номенклатура               	= Справочники.Номенклатура.ПолучитьСсылку(Элемент.Номенклатура);
				НоваяСтрока.ХарактеристикаНоменклатуры  = Справочники.ХарактеристикиНоменклатуры.ПолучитьСсылку(Элемент.ХарактеристикаНоменклатуры);
				НоваяСтрока.ЕдиницаИзмерения            = Справочники.ЕдиницыИзмерения.ПолучитьСсылку(Элемент.ЕдиницаИзмерения);
				НоваяСтрока.Количество                  = Элемент.Количество;
				НоваяСтрока.Цена                       	= Элемент.Цена;
				НоваяСтрока.Сумма                       = Элемент.Сумма;
				НоваяСтрока.КоличествоЗагружено        	= Элемент.КоличествоЗагружено;

			КонецЦикла;
			Для Каждого Элемент Из СтрокаДанныеЭлемента.Загрузка Цикл 
				ЗаказПокупателя            				= Документы.Заказ.ПолучитьСсылку(Элемент.ЗаказПокупателя);
				Контрагент               				= Справочники.Контрагенты.ПолучитьСсылку(Элемент.Контрагент);
				Номенклатура               				= Справочники.Номенклатура.ПолучитьСсылку(Элемент.Номенклатура);
				ХарактеристикаНоменклатуры  			= Справочники.ХарактеристикиНоменклатуры.ПолучитьСсылку(Элемент.ХарактеристикаНоменклатуры);				
				ОтборСтрок 	= Новый Структура;
				ОтборСтрок.Вставить("ЗаказПокупателя", 				ЗаказПокупателя);
				ОтборСтрок.Вставить("Контрагент", 					Контрагент);
				ОтборСтрок.Вставить("Номенклатура", 				Номенклатура);
				ОтборСтрок.Вставить("ХарактеристикаНоменклатуры", 	ХарактеристикаНоменклатуры);
				МассивСтрокЗагрузки = НовыйОбъект.ЗагрузкаМашины.НайтиСтроки(ОтборСтрок);
				Если МассивСтрокЗагрузки.Количество() = 0 Тогда 
					НоваяСтрока = НовыйОбъект.ЗагрузкаМашины.Добавить();
				Иначе 
					НоваяСтрока = МассивСтрокЗагрузки[0];
				КонецЕсли;	
				НоваяСтрока.ЗаказПокупателя            	= ЗаказПокупателя;
				НоваяСтрока.Контрагент               	= Контрагент;
				НоваяСтрока.Номенклатура               	= Номенклатура;
				НоваяСтрока.ХарактеристикаНоменклатуры  = ХарактеристикаНоменклатуры;
				НоваяСтрока.ЕдиницаИзмерения            = Справочники.ЕдиницыИзмерения.ПолучитьСсылку(Элемент.ЕдиницаИзмерения);
				НоваяСтрока.Количество                  = Элемент.Количество;
				НоваяСтрока.Цена                       	= Элемент.Цена;
				НоваяСтрока.Сумма                       = Элемент.Сумма;
				НоваяСтрока.Штрихкод                    = Элемент.Штрихкод;
				Попытка
					НоваяСтрока.Вес                  		= ХарактеристикаНоменклатуры.Вага;
				Исключение
				КонецПопытки;
				НоваяСтрока.ЦенаПродажиВес              = Элемент.ЦенаПродажиВес;
			КонецЦикла;			
			НовыйОбъект.Заказы.Свернуть("ЗаказПокупателя, Город, Контрагент");
			
			НовыйОбъект.НеХватает.Очистить();
			Если НЕ НеХватает = Неопределено Тогда 
				
				Для Каждого Элемент Из НеХватает Цикл 
					СтрокаНеХватает = НовыйОбъект.НеХватает.Добавить();
					СтрокаНеХватает.ЗаказПокупателя = Документы.Заказ.ПолучитьСсылку(Элемент.Заказ);
					СтрокаНеХватает.Номенклатура 	= Справочники.Номенклатура.ПолучитьСсылку(Элемент.Номенклатура);
					СтрокаНеХватает.Количество 		= Элемент.НеХватает;
				КонецЦикла;
				
				
			КонецЕсли;
			
			
			НовыйОбъект.Записать(РежимЗаписиДокумента.Проведение);
			НовСтр = ТаблицаИД.Добавить();
			НовСтр.ИД = СтрокаДанныеЭлемента.ИД;
			МассивДокументов.Добавить(НовыйОбъект.Ссылка)
		КонецЦикла;	
	КонецЕсли;
	
	Для Каждого ДокСсылка Из МассивДокументов Цикл
		ДокОб = ДокСсылка.ПолучитьОбъект();
		Если ДокСсылка.ПометкаУдаления Тогда 
			Продолжить;
		КонецЕсли;

		Попытка
			ДокОб.мЭтоОбмен = Истина;
		Исключение
		КонецПопытки;
		
		Попытка
		ДокОб.Записать(РежимЗаписиДокумента.Проведение,РежимПроведенияДокумента.Неоперативный);
		Исключение
		КонецПопытки;

	КонецЦикла;
	
	Для Каждого ДокСсылка Из МассивДокументов Цикл
		Если ДокСсылка.Проведен Или ДокСсылка.ПометкаУдаления Тогда 
			Продолжить;
		КонецЕсли;
		
			
		ДокОб = ДокСсылка.ПолучитьОбъект();
		Попытка
			ДокОб.мЭтоОбмен = Истина;
		Исключение
		КонецПопытки;
		
		Попытка
		ДокОб.Записать(РежимЗаписиДокумента.Проведение,РежимПроведенияДокумента.Неоперативный);
		Исключение
		КонецПопытки;

	КонецЦикла;

	
КонецПроцедуры


#КонецОбласти

#Область Месенджер_в_1с

Процедура ПринятьПакетДляМесенджера(Данные, дата)  Экспорт 
	//	Ответ.Вставить("Групы", тзЧаты); 
	//Ответ.Вставить("Учасники", тзУчасники);
	//Ответ.Вставить("ВходящиеСообщения", тзВходящиеСообщения);
	//Ответ.Вставить("ИсходящиеСообщения", тзИсходящиеСообщения);	
	Если Данные.Свойство("Групы") Тогда 
		СоздатьЭлементыСправочника("ГруппыЧата", Данные.Групы,);
	КонецЕсли;
	
	Если Данные.Свойство("Учасники") Тогда 
		СоздатьЭлементыСправочника("УчасникиЧата", Данные.Учасники,);
	КонецЕсли;
	
	Если Данные.Свойство("ВходящиеСообщения") Тогда 
		ЗаписатьВходящиеСообщения(Данные.ВходящиеСообщения);
	КонецЕсли;
	
	Если Данные.Свойство("ИсходящиеСообщения") Тогда 
		ЗаписатьИсходящиеСообщения(Данные.ИсходящиеСообщения);
	КонецЕсли;
	
	Если Данные.Свойство("НепрочитаныеСообщения") Тогда 
		ЗаписатьНепрочитанныеСообщения(Данные.НепрочитаныеСообщения);
	КонецЕсли;
	
	Если Данные.Свойство("УдаленныеСообщения") Тогда 
		ЗаписатьУдаленныеСообщения(Данные.УдаленныеСообщения);
	КонецЕсли;
	
	Если Данные.Свойство("Реакции") Тогда 
		ЗаписатьРеакцииНаСообщений(Данные.Реакции);
	КонецЕсли;

	Если Данные.Свойство("Уведомления") Тогда 
		ЗаписатьЗапланированыеУведомления(Данные.Уведомления)
	КонецЕсли;
	
	Если Данные.Свойство("ИсторияКлиента") Тогда 
		ЗаписатьИсториюКлиента(Данные.ИсторияКлиента)
	КонецЕсли;
	
	//мдата = ТекущаяДата();
	Если Данные.Свойство("Резервы") Тогда 
		ЗаписатьРезервы(Данные.Резервы);	
	КонецЕсли;
	//мдата = ТекущаяДата() - мдата;

	Если Данные.Свойство("АктуальныеЗаказы") Тогда 
		ЗаписатьИнфуОАктуальнихЗаказах(Данные.АктуальныеЗаказы)
	КонецЕсли;
	
	
	Константы.ДатаОбновлениеСообщений.Установить(ТекущаяДата() - 600);
	
КонецПроцедуры

Процедура ЗаписатьВходящиеСообщения(Данные)
	Набор = РегистрыСведений.ВходящиеСообщения.СоздатьНаборЗаписей();	
	
	Для Каждого Элемент Из Данные Цикл 
		
		Набор.Очистить();
		Набор.Отбор.Уид_Сообщения.Установить(Элемент.Уид_Сообщения);
		
		Запись = Набор.Добавить();
		Запись.Дата = Элемент.Период;
		Запись.Відправник = Справочники.УчасникиЧата.ПолучитьСсылку(Элемент.УИДВідправник);
		Запись.ГруппаЧата = ?( Элемент.ПолучательГруппа,Справочники.ГруппыЧата.ПолучитьСсылку(Элемент.УИДОдержувач),  Справочники.ГруппыЧата.ПустаяСсылка());
		Запись.Уид_Сообщения = Элемент.Уид_Сообщения;
		Запись.Повідомлення = Элемент.Повідомлення;
		
		Набор.Записать();
		
	КонецЦикла;
КонецПроцедуры

Процедура ЗаписатьИсходящиеСообщения(Данные)
	Набор = РегистрыСведений.ИсходящиеСообщения.СоздатьНаборЗаписей();	
	
	Для Каждого Элемент Из Данные Цикл 
		
		Набор.Очистить();
		Набор.Отбор.Уид_Сообщения.Установить(Элемент.Уид_Сообщения);
		
		Запись = Набор.Добавить();
		Запись.Дата = Элемент.Период;
		
		Если Элемент.ПолучательГруппа Тогда 
			Запись.Получатель = Справочники.ГруппыЧата.ПолучитьСсылку(Элемент.УИДОдержувач);
		Иначе
			Запись.Получатель = Справочники.УчасникиЧата.ПолучитьСсылку(Элемент.УИДОдержувач);	
		КонецЕсли;
		
		Запись.Уид_Сообщения = Элемент.Уид_Сообщения;
		Запись.Повідомлення = Элемент.Повідомлення;
		
		Набор.Записать();
		
	КонецЦикла;
КонецПроцедуры

Функция  ПолучитьИсходящиеСообщения(Дата) Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ИсходящиеСообщения.Дата КАК Дата,
	|	ИсходящиеСообщения.Получатель КАК Получатель,
	|	ИсходящиеСообщения.Уид_Сообщения КАК Уид_Сообщения,
	|	ИсходящиеСообщения.Повідомлення КАК Повідомлення,
	|	ВЫБОР
	|		КОГДА ИсходящиеСообщения.Получатель ССЫЛКА Справочник.ГруппыЧата
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ПолучательГруппа
	|ИЗ
	|	РегистрСведений.ИсходящиеСообщения КАК ИсходящиеСообщения
	|ГДЕ
	|	ИсходящиеСообщения.Дата > &Дата
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НепрочитаныеСообщения.Отправитель КАК Отправитель,
	|	МАКСИМУМ(НепрочитаныеСообщения.Период) КАК Период,
	|	НепрочитаныеСообщения.Отправитель ССЫЛКА Справочник.ГруппыЧата КАК ГруппаЧата
	|ИЗ
	|	РегистрСведений.НепрочитаныеСообщения КАК НепрочитаныеСообщения
	|ГДЕ
	|	НепрочитаныеСообщения.кол = 0
	|
	|СГРУППИРОВАТЬ ПО
	|	НепрочитаныеСообщения.Отправитель
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	УдаленныеСообщения.УИД_Сообщения КАК УИД_Сообщения
	|ИЗ
	|	РегистрСведений.УдаленныеСообщения КАК УдаленныеСообщения
	|ГДЕ
	|	УдаленныеСообщения.Дата > &Дата
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РекацииНаСобщения.УИД_Сообщения КАК УИД_Сообщения,
	|	РекацииНаСобщения.УчастникЧата КАК УчастникЧата,
	|	РекацииНаСобщения.Реакция КАК Реакция
	|ИЗ
	|	РегистрСведений.РекацииНаСобщения КАК РекацииНаСобщения
	|ГДЕ
	|	РекацииНаСобщения.Дата > &Дата
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РегистрацияОбмена.ИД КАК ИД
	|ИЗ
	|	РегистрСведений.РегистрацияОбмена КАК РегистрацияОбмена
	|ГДЕ
	|	РегистрацияОбмена.Уведомление
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Справочник.Ссылка КАК Ссылка,
	|	Справочник.Наименование КАК Наименование,
	|	Справочник.Нагадування КАК ОписаниеНапоминания,
	|	Справочник.Періодичність.Порядок КАК Периодичность,
	|	Справочник.Активне КАК Активно,
	|	Справочник.ДеньНедели КАК ДеньНедели,
	|	Справочник.ДатаНапоминания КАК ДатаНапоминания,
	|	Справочник.Контрагент КАК Контрагент,
	|	Справочник.НагадатиПроТовар КАК НапоминаниеОТоваре,
	|	Справочник.ДатаСоздания КАК ДатаСоздания,
	|	Справочник.ИзЗаказа КАК ИзЗаказа, 	
	|	Справочник.Товары.(
	|		Номенклатура КАК Номенклатура,
	|		Виконано КАК Выполнено,
	|		Кількість КАК Количество
	|	) КАК Товары,
	|	РегистрацияОбмена.ИД КАК ИД
	|ИЗ
	|	РегистрСведений.РегистрацияОбмена КАК РегистрацияОбмена
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Нагадування КАК Справочник
	|		ПО РегистрацияОбмена.Объект = Справочник.Ссылка";
	
	Запрос.УстановитьПараметр("Дата", Дата);
	Результат  = Запрос.ВыполнитьПакет();
	тзСообщения = Результат[0].Выгрузить();
	тзПрочитано = Результат[1].Выгрузить();
	тзУдалено = Результат[2].Выгрузить();
	тзРеакции = Результат[3].Выгрузить();
	тзУведомления = Результат[4].Выгрузить();
	тзСправчникУведомления = Результат[5].Выгрузить();
	
	
	тзСообщения.Колонки.Добавить("УИД_Получатель");
	тзПрочитано.Колонки.Добавить("УИД_Отправитель");
	тзРеакции.Колонки.Добавить("УИД_УчастникЧата");

	Для Каждого Элемент Из тзСообщения Цикл 
		
		Элемент.Уид_Получатель = Элемент.Получатель.УникальныйИдентификатор();
		
	КонецЦикла;
	
	Для Каждого Элемент Из тзПрочитано Цикл 
		
		Элемент.УИД_Отправитель = Элемент.Отправитель.УникальныйИдентификатор();
		
	КонецЦикла;
	
	Для Каждого Элемент Из тзРеакции Цикл 
		
		Элемент.УИД_УчастникЧата = Элемент.УчастникЧата.УникальныйИдентификатор();
		
	КонецЦикла;

	Уведомления = Новый Массив;
	Для Каждого Напоминания Из тзСправчникУведомления Цикл 

		Элемент = Новый Структура;
		Элемент.Вставить("ИД", Напоминания.ИД);
		Элемент.Вставить("УИДСсылка", Напоминания.Ссылка.УникальныйИдентификатор());
		Элемент.Вставить("Наименование", Напоминания.Наименование);
		Элемент.Вставить("ОписаниеНапоминания", Напоминания.ОписаниеНапоминания);
		Элемент.Вставить("Активно", Напоминания.Активно);
		Элемент.Вставить("НапоминаниеОТоваре", Напоминания.НапоминаниеОТоваре);
		Элемент.Вставить("ДатаСоздания", Напоминания.ДатаСоздания);
		Элемент.Вставить("ИзЗаказа", Напоминания.ИзЗаказа);		
		Если Напоминания.НапоминаниеОТоваре Тогда 
			
			Элемент.Вставить("Контрагент", Напоминания.Контрагент.УникальныйИдентификатор());
			Элемент.Вставить("Товары", Новый Массив);
			//Артикул = Напоминания.Товары.Выбрать();
			Для Каждого  Артикул Из Напоминания.Товары Цикл 
				СтруктураАртикул = Новый Структура();
				СтруктураАртикул.Вставить("Номенклатура", Артикул.Номенклатура.УникальныйИдентификатор());
				СтруктураАртикул.Вставить("Выполнено", Артикул.Выполнено);
				СтруктураАртикул.Вставить("Количество", Артикул.Количество);

				Элемент.Товары.Добавить(СтруктураАртикул);
			КонецЦикла;
			
		Иначе
			
			Элемент.Вставить("ДеньНедели", Напоминания.ДеньНедели);
			Элемент.Вставить("ДатаНапоминания", Напоминания.ДатаНапоминания);
			Элемент.Вставить("Периодичность", Напоминания.Периодичность);
			
		КонецЕсли;
		Уведомления.Добавить(Элемент);
		
	КонецЦикла;
	

	
	
	тзСообщения.Колонки.Удалить("Получатель");
	тзПрочитано.Колонки.Удалить("Отправитель");
	тзРеакции.Колонки.Удалить("УчастникЧата");

	Параметры = Новый Структура;
	Параметры.Вставить("Сообщения", тзСообщения);
	Параметры.Вставить("Прочытаные", тзПрочитано);
	Параметры.Вставить("Удаленные", тзУдалено);
	Параметры.Вставить("Реакции", тзРеакции);
	

	
	Параметры.Вставить("Дата", дата);
	Параметры.Вставить("РаботаСКлиентом", СформироватьПакетДанныхИсторияРаботыСКлиентом(дата));   
	Параметры.Вставить("Уведомления", тзУведомления);
	Параметры.Вставить("СправочникУведомления", Уведомления); 
	Возврат Параметры;	
	
КонецФункции

Процедура ЗаписатьНепрочитанныеСообщения(Данные)
	
	Для Каждого Элемент Из Данные Цикл 
		
		Отправитель = ?(Элемент.ОтГруппы, 
		Справочники.ГруппыЧата.ПолучитьСсылку(Элемент.УИДВідправник),  
		Справочники.УчасникиЧата.ПолучитьСсылку(Элемент.УИДВідправник));
		
		НаборЗаписей = РегистрыСведений.НепрочитаныеСообщения.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Отправитель.установить(Отправитель);
		Менеджер			 = НаборЗаписей.Добавить();
		Менеджер.Период 	 = ТекущаяДата();
		Менеджер.Отправитель = Отправитель;
		Менеджер.кол 		 =  Элемент.Кол;
		НаборЗаписей.Записать();
		
	КонецЦикла;
	
	
КонецПроцедуры

Процедура ЗаписатьУдаленныеСообщения(Данные);
	
	Для Каждого Элемент Из Данные Цикл
		Менеджер = РегистрыСведений.УдаленныеСообщения.СоздатьМенеджерЗаписи();
		Менеджер.УИД_Сообщения = Элемент.УИД_Сообщения;
		Менеджер.Дата = Элемент.Дата-20;
		Менеджер.Записать();
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаписатьРеакцииНаСообщений(Данные)
	 Для Каждого Элемент Из Данные Цикл
		Менеджер = РегистрыСведений.РекацииНаСобщения.СоздатьМенеджерЗаписи();
		Менеджер.УИД_Сообщения = Элемент.УИД_Сообщения;
		Менеджер.УчастникЧата = Справочники.УчасникиЧата.ПолучитьСсылку(Элемент.УИДУчастникЧата);
		Менеджер.Реакция = Элемент.Реакция;
		Менеджер.Дата = Элемент.Дата-20;
		Менеджер.Записать(Истина);
	КонецЦикла;

КонецПроцедуры

Процедура ЗаписатьЗапланированыеУведомления(Данные);
	
	Для Каждого Элемент Из Данные.Новые Цикл
		
		 Набор = РегистрыСведений.ЗапланированыеУведомления.СоздатьНаборЗаписей();
		 Набор.Отбор.УИД_Уведомления.Установить(Элемент.УИД_Уведомления);
		 Набор.Прочитать();
		 
		 Если Не Набор.Количество() Тогда  
			 
			СсылкаНагадування = Справочники.Нагадування.ПолучитьСсылку(Элемент.Объект); 
			Если НЕ ЗначениеЗаполнено(СсылкаНагадування.ВерсияДанных) Тогда 
				Продолжить;
			КонецЕсли;
			
			Запись = Набор.Добавить();
			Запись.УИД_Уведомления = Элемент.УИД_Уведомления;
			Запись.ДатаУведомления = ТекущаяДата();
			Запись.ДанныеУведомления = Элемент.ДанныеУведомления;
			Запись.ОбъектУведомления = СсылкаНагадування;
		 КонецЕсли;
		 
		 Набор.Записать();
		 
		 Менеджер = РегистрыСведений.РегистрацияОбмена.СоздатьМенеджерЗаписи();
		 Менеджер.ИД = Элемент.УИД_Уведомления;
		 Менеджер.Уведомление = Истина;
		 Менеджер.Записать();
		 
	 КонецЦикла;
	 
	 ДЛя Каждого Элемент Из Данные.Синхронизированые Цикл
		 Набор  = РегистрыСведений.РегистрацияОбмена.СоздатьНаборЗаписей();
		 Набор.Отбор.ИД.Установить(Элемент);
		 Набор.Записать();
	 КонецЦикла;
	 
	
	
КонецПроцедуры

Процедура ЗаписатьИсториюКлиента(Данные)
	 Запрос = Новый Запрос;
	 Запрос.Текст = "ВЫБРАТЬ
	                |	ТЗ.УИДКлиент КАК УИДКлиент,
	                |	ТЗ.Период КАК Период,
	                |	ТЗ.Запись КАК Запись,
	                |	ТЗ.УИД_Записи КАК УИД_Записи,
					|	ТЗ.АвтоматичнийЗаписБезВзаємодіїЗКлієнтом КАК АвтоматичнийЗаписБезВзаємодіїЗКлієнтом
	                |ПОМЕСТИТЬ ВТ
	                |ИЗ
	                |	&ТЗ КАК ТЗ
	                |;
	                |
	                |////////////////////////////////////////////////////////////////////////////////
	                |ВЫБРАТЬ
	                |	ВТ.УИДКлиент КАК УИДКлиент,
	                |	ВТ.Период КАК Период,
	                |	ВТ.Запись КАК Запись,
	                |	ВТ.УИД_Записи КАК УИД_Записи,
					|	ВТ.АвтоматичнийЗаписБезВзаємодіїЗКлієнтом КАК АвтоматичнийЗаписБезВзаємодіїЗКлієнтом					
	                |ИЗ
	                |	ВТ КАК ВТ
	                |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботаСКлиентом КАК РаботаСКлиентом
	                |		ПО ВТ.УИД_Записи = РаботаСКлиентом.УИД_Записи
	                |ГДЕ
	                |	РаботаСКлиентом.Период ЕСТЬ NULL";
	 Запрос.УстановитьПараметр("ТЗ", Данные); 
	 Выборка = Запрос.Выполнить().Выбрать();
	 
	 РаботаСКлиентом = РегистрыСведений.РаботаСКлиентом;
	 Пока Выборка.Следующий() Цикл 
		 ЗаписьРегистра = РаботаСКлиентом.СоздатьМенеджерЗаписи();
		 ЗаписьРегистра.Клиент = Справочники.Контрагенты.ПолучитьСсылку(Выборка.УИДКлиент);
		 ЗаписьРегистра.УИД_Записи = Выборка.УИД_Записи;
		 ЗаписьРегистра.Период = Выборка.Период;
		 ЗаписьРегистра.Запись = Выборка.Запись;
		 ЗаписьРегистра.АвтоматичнийЗаписБезВзаємодіїЗКлієнтом =  Выборка.АвтоматичнийЗаписБезВзаємодіїЗКлієнтом;
		 ЗаписьРегистра.Записать();
		 Общий.ОбновитьПоследнююРаботуСКлиентом(ЗаписьРегистра.Клиент);
	 КонецЦикла; 
КонецПроцедуры

Процедура ЗаписатьИнфуОАктуальнихЗаказах(Данные)

	НаборЗаписей = РегистрыСведений.КонтрагентыСАктуальнымиЗаказами.СоздатьНаборЗаписей();

	//НужноЗаписывать = Ложь;
	Для Каждого Элемент из Данные Цикл
		
		Если Не Общий.ОбъектБДСуществует(Справочники.Контрагенты.ПолучитьСсылку(Элемент.УИДКонтрагент)) Тогда
			Продолжить;
		КонецЕсли;			
		           
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	КонтрагентыСАктуальнымиЗаказами.ЕстьПростроченыеАктуальныеЗаказы КАК ЕстьПростроченыеАктуальныеЗаказы
		|ИЗ
		|	РегистрСведений.КонтрагентыСАктуальнымиЗаказами КАК КонтрагентыСАктуальнымиЗаказами
		|ГДЕ
		|	КонтрагентыСАктуальнымиЗаказами.Контрагент = &Контрагент";
		
		Запрос.УстановитьПараметр("Контрагент", Справочники.Контрагенты.ПолучитьСсылку(Элемент.УИДКонтрагент));
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Если ВыборкаДетальныеЗаписи.Следующий() Тогда
			Если Не Элемент.ЕстьПростроченыеАктуальныеЗаказы = ВыборкаДетальныеЗаписи.ЕстьПростроченыеАктуальныеЗаказы Тогда
				Если Элемент.ЕстьПростроченыеАктуальныеЗаказы И Не Элемент.ЗаказВключенВМаршрутныйЛист Тогда
					Данные = Новый Структура;
					Данные.Вставить("Контрагент", Справочники.Контрагенты.ПолучитьСсылку(Элемент.УИДКонтрагент)); 
					Общий.СоздатьНапоминаниеСДействием(Перечисления.ТипыДействийПриНапоминании.ЗакрытиеСтарыхЗаказов, Данные);			 	 	
				КонецЕсли;
			КонецЕсли;	
		Иначе
			Если Элемент.ЕстьПростроченыеАктуальныеЗаказы И Не Элемент.ЗаказВключенВМаршрутныйЛист Тогда
				Данные = Новый Структура;
				Данные.Вставить("Контрагент", Справочники.Контрагенты.ПолучитьСсылку(Элемент.УИДКонтрагент)); 
				Общий.СоздатьНапоминаниеСДействием(Перечисления.ТипыДействийПриНапоминании.ЗакрытиеСтарыхЗаказов, Данные);			 	 	
			КонецЕсли;
		КонецЕсли;

		Запись = НаборЗаписей.Добавить();
		Запись.Контрагент = Справочники.Контрагенты.ПолучитьСсылку(Элемент.УИДКонтрагент);  
		Запись.ЕстьПростроченыеАктуальныеЗаказы = Элемент.ЕстьПростроченыеАктуальныеЗаказы;					
		Запись.ЗаказВключенВМаршрутныйЛист = Элемент.ЗаказВключенВМаршрутныйЛист;
	КонецЦикла;

	НаборЗаписей.Записать();
	
	
КонецПроцедуры	
#КонецОбласти

Процедура ЗаписатьРезервы(Данные)
	
	Набор = РегистрыСведений.Резервы.СоздатьНаборЗаписей();
	
	Для Каждого Элемент Из Данные Цикл 
		
			Строка = Набор.Добавить();
			Строка.УИД_Троговый = Элемент.УИДТорговий;
			Строка.Номенклатура = Справочники.Номенклатура.ПолучитьСсылку(Элемент.УИДНоменклатура);
			Строка.Количество = Элемент.Количество;
			Строка.ТорговийИмя = Элемент.ТорговийАгентПредставление;
			
	КонецЦикла;
	Набор.Записать();

КонецПроцедуры


/////////////////////////////////

Функция ОтправитьИзменения(Данные = Неопределено) Экспорт
	
	ИгнорироватьПерейти 	= Истина;
	з 						= Новый Запрос;
	СтруктураВозврата 		= Новый Структура;

	//~Контрагенты:

	Если Не Данные = Неопределено Тогда 
		ИгнорироватьПерейти = Ложь;
		Значение = Неопределено;
		Если  Данные.Свойство("Контрагенты", Значение) 
			И Значение = Истина Тогда
			
			Если Данные.Свойство("ОтборКонтрагент", Значение) Тогда 
				Отбор = Новый Структура;
				Отбор.Вставить("КонтрагентСсылка", Значение);
			КонецЕсли;
			
			Перейти ~Контрагенты;
		КонецЕсли;
		
		
		Перейти ~Возврат;

	КонецЕсли;
	
	
	
	
	//ПКО
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РегистрацияОбмена.Объект КАК Объект,
		|	РегистрацияОбмена.ИД КАК ИД,
		|	КассовыйОрдер.Дата КАК Дата,
		|	КассовыйОрдер.Проведен КАК Проведен,
		|	КассовыйОрдер.СумаUAH КАК СумаUAH,
		|	КассовыйОрдер.СумаUAH_Безнал КАК СумаUAH_Безнал,
		|	КассовыйОрдер.СумаEUR КАК СумаEUR,
		|	КассовыйОрдер.СумаUSD КАК СумаUSD,
		|	КассовыйОрдер.Основание КАК Основание,
		|	КассовыйОрдер.ПометкаУдаления КАК ПометкаУдаления,
		|	КассовыйОрдер.Контрагент КАК Контрагент,
		|	КассовыйОрдер.МаршрутныйЛист КАК МаршрутныйЛист,
		|	КассовыйОрдер.ЗаказПокупателя КАК ЗаказПокупателя,
		|	КассовыйОрдер.КурсUSD КАК КурсUSD,
		|	КассовыйОрдер.КурсEUR КАК КурсEUR,
		|	КассовыйОрдер.Номер КАК Номер,
		|	ВЫБОР
		|		КОГДА КассовыйОрдер.ВидДвиженияДенежныхСредств = ЗНАЧЕНИЕ(Перечисление.ВидДвиженияДенежныхСредств.Расход)
		|			ТОГДА ""Расход""
		|		ИНАЧЕ ""Приход""
		|	КОНЕЦ КАК ВидДвижения,
		|	КассовыйОрдер.УИДUSD КАК УИДUSD,
		|	КассовыйОрдер.УИДГРН КАК УИДГРН,
		|	КассовыйОрдер.КоректировкаДолга КАК КоректировкаДолга,
		|	КассовыйОрдер.БанковскийСчет КАК БанковскийСчет,
		|	КассовыйОрдер.СтатьяДвиженияДенежныхСредств КАК СтатьяДвиженияДенежныхСредств,
		|	ВЫБОР
		|		КОГДА КассовыйОрдер.СдачаДокумента = ЗНАЧЕНИЕ(Документ.КассовыйОрдер.ПустаяСсылка)
		|			ТОГДА ЛОЖЬ
		|		ИНАЧЕ ИСТИНА
		|	КОНЕЦ КАК Сдача,
		|	КассовыйОрдер.УИДКоректировки КАК УИДКоректировки
		|ИЗ
		|	РегистрСведений.РегистрацияОбмена КАК РегистрацияОбмена
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.КассовыйОрдер КАК КассовыйОрдер
		|		ПО РегистрацияОбмена.Объект = КассовыйОрдер.Ссылка
		|ГДЕ
		|	КассовыйОрдер.Проведен
		|	И (КассовыйОрдер.Основание = ЗНАЧЕНИЕ(Документ.РеализацияТоваровУслуг.ПустаяСсылка)
		|			ИЛИ КассовыйОрдер.Основание.Архив
		|			ИЛИ КассовыйОрдер.Основание В
		|				(ВЫБРАТЬ
		|					РеализацияТоваровУслуг.Ссылка КАК Ссылка
		|				ИЗ
		|					РегистрСведений.РегистрацияОбмена КАК РегистрацияОбмена
		|						ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
		|						ПО
		|							РегистрацияОбмена.Объект = РеализацияТоваровУслуг.Ссылка))";                  // ВивантажуватиВ1С
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	МассивПКО = Новый Массив;
	Пока Выборка.Следующий() Цикл 
		ПКО = Новый Структура("ИД, Дата, Номер, Проведен, СумаUAH, СумаUAH_Безнал, СумаEUR, СумаUSD, ПометкаУдаления, КурсEUR, КурсUSD, УИДUSD, УИДГРН, ВидДвижения, КоректировкаДолга, Сдача, УИДКоректировки");
		ЗаполнитьЗначенияСвойств(ПКО, Выборка);
		ПКО.Вставить("ПКО_УИД", 							Выборка.Объект.УникальныйИдентификатор()); 
		ПКО.Вставить("Реализация_УИД", 						Выборка.Основание.УникальныйИдентификатор());
		ПКО.Вставить("Контрагент_УИД", 						Выборка.Контрагент.УникальныйИдентификатор());
		ПКО.Вставить("МаршрутныйЛист_УИД", 					Выборка.МаршрутныйЛист.УникальныйИдентификатор());
		ПКО.Вставить("ЗаказПокупателя_УИД",					Выборка.ЗаказПокупателя.УникальныйИдентификатор());
		ПКО.Вставить("БанковскийСчет_УИД",  				Выборка.БанковскийСчет.УникальныйИдентификатор());
		ПКО.Вставить("СтатьяДвиженияДенежныхСредств_УИД",   Выборка.СтатьяДвиженияДенежныхСредств.УникальныйИдентификатор());
		
		МассивПКО.Добавить(ПКО);
	КонецЦикла;
	
	СтруктураВозврата.Вставить("ПКО", МассивПКО);
		
		//////////////// Продажи
	//з = Новый Запрос;
	з.Текст = "ВЫБРАТЬ
	          |	ЗаказТовары.Ссылка КАК СсылкаСсылка,
	          |	ЗаказТовары.Ссылка.Номер КАК Номер,
	          |	ЗаказТовары.Ссылка.Дата КАК Дата,
	          |	ЗаказТовары.Ссылка.Проведен КАК Проведен,
	          |	ЗаказТовары.Номенклатура КАК НоменклатураСсылка,
	          |	ЗаказТовары.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатурыСсылка,
	          |	ЗаказТовары.ЕдиницаИзмерения КАК ЕдиницаИзмеренияСсылка,
	          |	ЗаказТовары.Количество КАК Количество,
	          |	РегистрацияОбмена.ИД КАК ИД,
	          |	ЗаказТовары.Ссылка.Коментар КАК Комментарий,
	          |	ЗаказТовары.Цена КАК Цена,
	          |	ЗаказТовары.Ссылка.Контрагент КАК КонтрагентСсылка,
	          |	ЗаказТовары.Ссылка.ТипЦен КАК ТипЦенСсылка,
	          |	ЗаказТовары.Ссылка.ПершаФорма КАК ПершаФорма,
	          |	ЗаказТовары.Ссылка.СкладКонтрагента КАК СкладКонтрагентаСсылка,
	          |	ЗаказТовары.Ссылка.Широта КАК Широта,
	          |	ЗаказТовары.Ссылка.Долгота КАК Долгота,
	          |	ЗаказТовары.ЦенаПродажиВес КАК ЦенаПродажиВес,
	          |	ЗаказТовары.Ссылка.ПометкаУдаления КАК ПометкаУдаления,
	          |	ЗаказТовары.Ссылка.Наложка КАК Наложка,
	          |	ЗаказТовары.Ссылка.ПризначитиПродажТорговомуКонтрагента КАК ПризначитиПродажТорговомуКонтрагента
	          |ИЗ
	          |	РегистрСведений.РегистрацияОбмена КАК РегистрацияОбмена
	          |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Заказ.Товары КАК ЗаказТовары
	          |		ПО РегистрацияОбмена.Объект = ЗаказТовары.Ссылка";
	ТаблицаПродаж = з.Выполнить().Выгрузить();
	
	ТаблицаПродаж.Колонки.Добавить("Ссылка");
	ТаблицаПродаж.Колонки.Добавить("Номенклатура");
	ТаблицаПродаж.Колонки.Добавить("ХарактеристикаНоменклатуры");
	ТаблицаПродаж.Колонки.Добавить("ЕдиницаИзмерения");
	ТаблицаПродаж.Колонки.Добавить("Контрагент");
	ТаблицаПродаж.Колонки.Добавить("ТипЦен");
	ТаблицаПродаж.Колонки.Добавить("СкладКонтрагента");
	ТаблицаПродаж.Колонки.Добавить("Оплата");
	ТаблицаПродаж.Колонки.Добавить("Доставка");
	Для Каждого Строка Из ТаблицаПродаж Цикл
		
		Строка.Ссылка = Строка.СсылкаСсылка.УникальныйИдентификатор();
		Строка.Номенклатура = Строка.НоменклатураСсылка.УникальныйИдентификатор();
		Строка.ХарактеристикаНоменклатуры = Строка.ХарактеристикаНоменклатурыСсылка.УникальныйИдентификатор();
		Строка.ЕдиницаИзмерения = Строка.ЕдиницаИзмеренияСсылка.УникальныйИдентификатор();
		Строка.Контрагент = Строка.КонтрагентСсылка.УникальныйИдентификатор();

		Строка.Оплата = Строка(Строка.СсылкаСсылка.Оплата); 
		Строка.Доставка = Строка(Строка.СсылкаСсылка.Доставка); 

		Строка.ТипЦен = Строка.ТипЦенСсылка.УникальныйИдентификатор();
		Строка.СкладКонтрагента = Строка.СкладКонтрагентаСсылка.УникальныйИдентификатор();

		
	КонецЦикла;
	ТаблицаПродаж.Колонки.Удалить("СсылкаСсылка");
	ТаблицаПродаж.Колонки.Удалить("НоменклатураСсылка");
	ТаблицаПродаж.Колонки.Удалить("ХарактеристикаНоменклатурыСсылка");
	ТаблицаПродаж.Колонки.Удалить("ЕдиницаИзмеренияСсылка");
	ТаблицаПродаж.Колонки.Удалить("СкладКонтрагентаСсылка");
	СтруктураВозврата.Вставить("Заказы",ТаблицаПродаж);

	
	//////////////// Реализации
	з = Новый Запрос;
	з.Текст = "ВЫБРАТЬ
	          |	Реализация.Ссылка КАК СсылкаСсылка,
	          |	Реализация.Ссылка.Номер КАК Номер,
	          |	Реализация.Ссылка.Дата КАК Дата,
	          |	Реализация.Ссылка.Проведен КАК Проведен,
	          |	Реализация.Номенклатура КАК НоменклатураСсылка,
	          |	Реализация.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатурыСсылка,
	          |	Реализация.ЕдиницаИзмерения КАК ЕдиницаИзмеренияСсылка,
	          |	Реализация.Количество КАК Количество,
	          |	РегистрацияОбмена.ИД КАК ИД,
	          |	Реализация.Ссылка.Коментар КАК Комментарий,
	          |	Реализация.Цена КАК Цена,
	          |	Реализация.Ссылка.Контрагент КАК КонтрагентСсылка,
	          |	Реализация.Ссылка.ТипЦен КАК ТипЦенСсылка,
	          |	Реализация.Ссылка.ПершаФорма КАК ПершаФорма,
	          |	Реализация.Ссылка.СкладКонтрагента КАК СкладКонтрагентаСсылка,
	          |	Реализация.Ссылка.Широта КАК Широта,
	          |	Реализация.Ссылка.Долгота КАК Долгота,
	          |	Реализация.ЦенаПродажиВес КАК ЦенаПродажиВес,
	          |	Реализация.Ссылка.ПометкаУдаления КАК ПометкаУдаления,
	          |	Реализация.Ссылка.КурсUSD КАК КурсUSD,
	          |	Реализация.Ссылка.КурсEUR КАК КурсEUR,
	          |	Реализация.Ссылка.Сделка КАК СделкаСсылка,
	          |	Реализация.Ссылка.МаршрутныйЛист КАК МаршрутныйЛистСсылка,
	          |	Реализация.Ссылка.Неплановая КАК Неплановая,
	          |	Реализация.Ссылка.Наложка КАК Наложка,
	          |	Реализация.Знижка КАК Знижка,
	          |	Реализация.Ссылка.ПризначитиПродажТорговомуКонтрагента КАК ПризначитиПродажТорговомуКонтрагента,
	          |	Реализация.Ссылка.СумаОплатиНаложкою КАК СумаОплатиНаложкою
	          |ИЗ
	          |	РегистрСведений.РегистрацияОбмена КАК РегистрацияОбмена
	          |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг.Товары КАК Реализация
	          |		ПО РегистрацияОбмена.Объект = Реализация.Ссылка";
	ТаблицаПродаж = з.Выполнить().Выгрузить();
	
	ТаблицаПродаж.Колонки.Добавить("Ссылка");
	ТаблицаПродаж.Колонки.Добавить("Номенклатура");
	ТаблицаПродаж.Колонки.Добавить("ХарактеристикаНоменклатуры");
	ТаблицаПродаж.Колонки.Добавить("ЕдиницаИзмерения");
	ТаблицаПродаж.Колонки.Добавить("Контрагент");
	ТаблицаПродаж.Колонки.Добавить("ТипЦен");
	ТаблицаПродаж.Колонки.Добавить("СкладКонтрагента");
	ТаблицаПродаж.Колонки.Добавить("Оплата");
	ТаблицаПродаж.Колонки.Добавить("Доставка");
	ТаблицаПродаж.Колонки.Добавить("Сделка");
	ТаблицаПродаж.Колонки.Добавить("МаршрутныйЛист");
	Для Каждого Строка Из ТаблицаПродаж Цикл 
		Строка.Ссылка 						= Строка.СсылкаСсылка.УникальныйИдентификатор();
		Строка.Номенклатура 				= Строка.НоменклатураСсылка.УникальныйИдентификатор();
		Строка.ХарактеристикаНоменклатуры 	= Строка.ХарактеристикаНоменклатурыСсылка.УникальныйИдентификатор();
		Строка.ЕдиницаИзмерения 			= Строка.ЕдиницаИзмеренияСсылка.УникальныйИдентификатор();
		Строка.Контрагент 					= Строка.КонтрагентСсылка.УникальныйИдентификатор();
		Строка.Оплата 						= Строка(Строка.СсылкаСсылка.Оплата); 
		Строка.Доставка 					= Строка(Строка.СсылкаСсылка.Доставка); 
		Строка.ТипЦен 						= Строка.ТипЦенСсылка.УникальныйИдентификатор();
		Строка.СкладКонтрагента 			= Строка.СкладКонтрагентаСсылка.УникальныйИдентификатор();
		Строка.Сделка 						= Строка.СделкаСсылка.УникальныйИдентификатор();
		Строка.МаршрутныйЛист 				= Строка.МаршрутныйЛистСсылка.УникальныйИдентификатор();
	КонецЦикла;
	ТаблицаПродаж.Колонки.Удалить("СсылкаСсылка");
	ТаблицаПродаж.Колонки.Удалить("НоменклатураСсылка");
	ТаблицаПродаж.Колонки.Удалить("ХарактеристикаНоменклатурыСсылка");
	ТаблицаПродаж.Колонки.Удалить("ЕдиницаИзмеренияСсылка");
	ТаблицаПродаж.Колонки.Удалить("СкладКонтрагентаСсылка");
	ТаблицаПродаж.Колонки.Удалить("СделкаСсылка");
	ТаблицаПродаж.Колонки.Удалить("МаршрутныйЛистСсылка");
	СтруктураВозврата.Вставить("Реализации",ТаблицаПродаж);
	
	
	
	//////////////// Презентації
	з = Новый Запрос;
	з.Текст = "ВЫБРАТЬ
	          |	Презентація.Ссылка КАК СсылкаСсылка,
	          |	Презентація.Ссылка.Номер КАК Номер,
	          |	Презентація.Ссылка.Дата КАК Дата,
	          |	Презентація.Ссылка.Проведен КАК Проведен,
	          |	Презентація.Номенклатура КАК НоменклатураСсылка,
	          |	Презентація.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатурыСсылка,			  
	          |	РегистрацияОбмена.ИД КАК ИД,
	          |	Презентація.Коментар КАК Комментарий,
			  |	Презентація.Ссылка.Коментар КАК КомментарийОбщий,
	          |	Презентація.Ссылка.Контрагент КАК КонтрагентСсылка,
	          |	Презентація.Ссылка.ПометкаУдаления КАК ПометкаУдаления
	          |ИЗ
	          |	РегистрСведений.РегистрацияОбмена КАК РегистрацияОбмена
	          |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Презентація.Товары КАК Презентація
	          |		ПО РегистрацияОбмена.Объект = Презентація.Ссылка";
	
	ТаблицаПрезентацій = з.Выполнить().Выгрузить();
	
	ТаблицаПрезентацій.Колонки.Добавить("Ссылка");
	ТаблицаПрезентацій.Колонки.Добавить("Номенклатура");
	ТаблицаПрезентацій.Колонки.Добавить("ХарактеристикаНоменклатуры");	
	ТаблицаПрезентацій.Колонки.Добавить("Контрагент");
	ТаблицаПрезентацій.Колонки.Добавить("Доставка");
	Для Каждого Строка Из ТаблицаПрезентацій Цикл 
		Строка.Ссылка 						= Строка.СсылкаСсылка.УникальныйИдентификатор();
		Строка.Номенклатура 				= Строка.НоменклатураСсылка.УникальныйИдентификатор();
		Строка.ХарактеристикаНоменклатуры	= Строка.ХарактеристикаНоменклатурыСсылка.УникальныйИдентификатор();		
		Строка.Контрагент 					= Строка.КонтрагентСсылка.УникальныйИдентификатор();
		Строка.Доставка 					= Строка(Строка.СсылкаСсылка.Доставка); 
	КонецЦикла;
	ТаблицаПрезентацій.Колонки.Удалить("СсылкаСсылка");
	ТаблицаПрезентацій.Колонки.Удалить("НоменклатураСсылка");
	ТаблицаПрезентацій.Колонки.Удалить("ХарактеристикаНоменклатурыСсылка");	
	
	СтруктураВозврата.Вставить("Презентации",ТаблицаПрезентацій);	
	
	
	
	//////////////// Маршрутники
	з = Новый Запрос;
	з.Текст = "ВЫБРАТЬ
	          |	""ТоварыЗаказов"" КАК ТабЧасть,
	          |	ТоварыЗаказов.Ссылка КАК СсылкаСсылка,
	          |	ТоварыЗаказов.Ссылка.Номер КАК Номер,
	          |	ТоварыЗаказов.Ссылка.Дата КАК Дата,
	          |	ТоварыЗаказов.Ссылка.ДатаПриезда КАК ДатаПриезда,
	          |	ТоварыЗаказов.Ссылка.СтатусДокумента КАК СтатусСсылка,
	          |	ТоварыЗаказов.Ссылка.СуммаДокумента КАК СуммаДокумента,
	          |	ТоварыЗаказов.Ссылка.Комментарий КАК Комментарий,
	          |	ТоварыЗаказов.Ссылка.Проведен КАК Проведен,
	          |	ТоварыЗаказов.Ссылка.ПометкаУдаления КАК ПометкаУдаления,
	          |	ТоварыЗаказов.ЗаказПокупателя КАК ЗаказПокупателяСсылка,
	          |	ТоварыЗаказов.Контрагент КАК КонтрагентСсылка,
	          |	ТоварыЗаказов.Номенклатура КАК НоменклатураСсылка,
	          |	ТоварыЗаказов.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатурыСсылка,
	          |	ТоварыЗаказов.ЕдиницаИзмерения КАК ЕдиницаИзмеренияСсылка,
	          |	ТоварыЗаказов.Количество КАК Количество,
	          |	ТоварыЗаказов.Цена КАК Цена,
	          |	ТоварыЗаказов.Сумма КАК Сумма,
	          |	NULL КАК РеализацияСсылка,
	          |	NULL КАК ОплатаСсылка,
	          |	ТоварыЗаказов.НомерСтроки КАК НомерСтроки,
	          |	NULL КАК Коментар
	          |ПОМЕСТИТЬ ВТМаршрутный
	          |ИЗ
	          |	Документ.МаршрутныйЛист.ТоварыЗаказов КАК ТоварыЗаказов
	          |
	          |ОБЪЕДИНИТЬ ВСЕ
	          |
	          |ВЫБРАТЬ
	          |	""Заказы"",
	          |	МаршрутныйЛистЗаказы.Ссылка,
	          |	МаршрутныйЛистЗаказы.Ссылка.Номер,
	          |	МаршрутныйЛистЗаказы.Ссылка.Дата,
	          |	МаршрутныйЛистЗаказы.Ссылка.ДатаПриезда,
	          |	МаршрутныйЛистЗаказы.Ссылка.СтатусДокумента,
	          |	МаршрутныйЛистЗаказы.Ссылка.СуммаДокумента,
	          |	МаршрутныйЛистЗаказы.Ссылка.Комментарий,
	          |	МаршрутныйЛистЗаказы.Ссылка.Проведен,
	          |	МаршрутныйЛистЗаказы.Ссылка.ПометкаУдаления,
	          |	МаршрутныйЛистЗаказы.ЗаказПокупателя,
	          |	МаршрутныйЛистЗаказы.Контрагент,
	          |	NULL,
	          |	NULL,
	          |	NULL,
	          |	NULL,
	          |	NULL,
	          |	NULL,
	          |	NULL,
	          |	NULL,
	          |	МаршрутныйЛистЗаказы.НомерСтроки,
	          |	NULL
	          |ИЗ
	          |	Документ.МаршрутныйЛист.Заказы КАК МаршрутныйЛистЗаказы
	          |
	          |ОБЪЕДИНИТЬ ВСЕ
	          |
	          |ВЫБРАТЬ
	          |	""Реализации"",
	          |	МаршрутныйЛистРеализации.Ссылка,
	          |	МаршрутныйЛистРеализации.Ссылка.Номер,
	          |	МаршрутныйЛистРеализации.Ссылка.Дата,
	          |	МаршрутныйЛистРеализации.Ссылка.ДатаПриезда,
	          |	МаршрутныйЛистРеализации.Ссылка.СтатусДокумента,
	          |	МаршрутныйЛистРеализации.Ссылка.СуммаДокумента,
	          |	МаршрутныйЛистРеализации.Ссылка.Комментарий,
	          |	МаршрутныйЛистРеализации.Ссылка.Проведен,
	          |	МаршрутныйЛистРеализации.Ссылка.ПометкаУдаления,
	          |	МаршрутныйЛистРеализации.ЗаказПокупателя,
	          |	МаршрутныйЛистРеализации.Контрагент,
	          |	NULL,
	          |	NULL,
	          |	NULL,
	          |	NULL,
	          |	NULL,
	          |	МаршрутныйЛистРеализации.Сумма,
	          |	МаршрутныйЛистРеализации.Реализация,
	          |	NULL,
	          |	МаршрутныйЛистРеализации.НомерСтроки,
	          |	NULL
	          |ИЗ
	          |	Документ.МаршрутныйЛист.Реализации КАК МаршрутныйЛистРеализации
	          |
	          |ОБЪЕДИНИТЬ ВСЕ
	          |
	          |ВЫБРАТЬ
	          |	""Продажи"",
	          |	МаршрутныйЛистПродажи.Ссылка,
	          |	МаршрутныйЛистПродажи.Ссылка.Номер,
	          |	МаршрутныйЛистПродажи.Ссылка.Дата,
	          |	МаршрутныйЛистПродажи.Ссылка.ДатаПриезда,
	          |	МаршрутныйЛистПродажи.Ссылка.СтатусДокумента,
	          |	МаршрутныйЛистПродажи.Ссылка.СуммаДокумента,
	          |	МаршрутныйЛистПродажи.Ссылка.Комментарий,
	          |	МаршрутныйЛистПродажи.Ссылка.Проведен,
	          |	МаршрутныйЛистПродажи.Ссылка.ПометкаУдаления,
	          |	МаршрутныйЛистПродажи.ЗаказПокупателя,
	          |	МаршрутныйЛистПродажи.Контрагент,
	          |	МаршрутныйЛистПродажи.Номенклатура,
	          |	МаршрутныйЛистПродажи.ХарактеристикаНоменклатуры,
	          |	МаршрутныйЛистПродажи.ЕдиницаИзмерения,
	          |	МаршрутныйЛистПродажи.Количество,
	          |	МаршрутныйЛистПродажи.Цена,
	          |	МаршрутныйЛистПродажи.Сумма,
	          |	NULL,
	          |	NULL,
	          |	МаршрутныйЛистПродажи.НомерСтроки,
	          |	NULL
	          |ИЗ
	          |	Документ.МаршрутныйЛист.Продажи КАК МаршрутныйЛистПродажи
	          |
	          |ОБЪЕДИНИТЬ ВСЕ
	          |
	          |ВЫБРАТЬ
	          |	""Оплаты"",
	          |	МаршрутныйЛистОплаты.Ссылка,
	          |	МаршрутныйЛистОплаты.Ссылка.Номер,
	          |	МаршрутныйЛистОплаты.Ссылка.Дата,
	          |	МаршрутныйЛистОплаты.Ссылка.ДатаПриезда,
	          |	МаршрутныйЛистОплаты.Ссылка.СтатусДокумента,
	          |	МаршрутныйЛистОплаты.Ссылка.СуммаДокумента,
	          |	МаршрутныйЛистОплаты.Ссылка.Комментарий,
	          |	МаршрутныйЛистОплаты.Ссылка.Проведен,
	          |	МаршрутныйЛистОплаты.Ссылка.ПометкаУдаления,
	          |	NULL,
	          |	МаршрутныйЛистОплаты.Оплата.Контрагент,
	          |	NULL,
	          |	NULL,
	          |	NULL,
	          |	NULL,
	          |	NULL,
	          |	МаршрутныйЛистОплаты.Сумма,
	          |	МаршрутныйЛистОплаты.Реализация,
	          |	МаршрутныйЛистОплаты.Оплата,
	          |	МаршрутныйЛистОплаты.НомерСтроки,
	          |	NULL
	          |ИЗ
	          |	Документ.МаршрутныйЛист.Оплаты КАК МаршрутныйЛистОплаты
	          |
	          |ОБЪЕДИНИТЬ ВСЕ
	          |
	          |ВЫБРАТЬ
	          |	""Завдання"",
	          |	МаршрутныйЛистЗавдання.Ссылка,
	          |	МаршрутныйЛистЗавдання.Ссылка.Номер,
	          |	МаршрутныйЛистЗавдання.Ссылка.Дата,
	          |	МаршрутныйЛистЗавдання.Ссылка.ДатаПриезда,
	          |	МаршрутныйЛистЗавдання.Ссылка.СтатусДокумента,
	          |	МаршрутныйЛистЗавдання.Ссылка.СуммаДокумента,
	          |	МаршрутныйЛистЗавдання.Ссылка.Комментарий,
	          |	МаршрутныйЛистЗавдання.Ссылка.Проведен,
	          |	МаршрутныйЛистЗавдання.Ссылка.ПометкаУдаления,
	          |	NULL,
	          |	МаршрутныйЛистЗавдання.Контрагент,
	          |	NULL,
	          |	NULL,
	          |	NULL,
	          |	NULL,
	          |	NULL,
	          |	NULL,
	          |	NULL,
	          |	NULL,
	          |	МаршрутныйЛистЗавдання.НомерСтроки,
	          |	МаршрутныйЛистЗавдання.Коментар
	          |ИЗ
	          |	Документ.МаршрутныйЛист.Завдання КАК МаршрутныйЛистЗавдання
	          |;
	          |
	          |////////////////////////////////////////////////////////////////////////////////
	          |ВЫБРАТЬ
	          |	РегистрацияОбмена.ИД КАК ИД,
	          |	ВТМаршрутный.ТабЧасть КАК ТабЧасть,
	          |	ВТМаршрутный.СсылкаСсылка КАК СсылкаСсылка,
	          |	ВТМаршрутный.Номер КАК Номер,
	          |	ВТМаршрутный.Дата КАК Дата,
	          |	ВТМаршрутный.ДатаПриезда КАК ДатаПриезда,
	          |	ВТМаршрутный.СтатусСсылка КАК СтатусСсылка,
	          |	ВТМаршрутный.СуммаДокумента КАК СуммаДокумента,
	          |	ВТМаршрутный.Комментарий КАК Комментарий,
	          |	ВТМаршрутный.Проведен КАК Проведен,
	          |	ВТМаршрутный.ПометкаУдаления КАК ПометкаУдаления,
	          |	ВТМаршрутный.ЗаказПокупателяСсылка КАК ЗаказПокупателяСсылка,
	          |	ВТМаршрутный.КонтрагентСсылка КАК КонтрагентСсылка,
	          |	ВТМаршрутный.НоменклатураСсылка КАК НоменклатураСсылка,
	          |	ВТМаршрутный.ХарактеристикаНоменклатурыСсылка КАК ХарактеристикаНоменклатурыСсылка,
	          |	ВТМаршрутный.ЕдиницаИзмеренияСсылка КАК ЕдиницаИзмеренияСсылка,
	          |	ВТМаршрутный.Количество КАК Количество,
	          |	ВТМаршрутный.Цена КАК Цена,
	          |	ВТМаршрутный.Сумма КАК Сумма,
	          |	ВТМаршрутный.РеализацияСсылка КАК РеализацияСсылка,
	          |	ВТМаршрутный.ОплатаСсылка КАК ОплатаСсылка,
	          |	ВТМаршрутный.НомерСтроки КАК НомерСтроки,
	          |	ВТМаршрутный.Коментар КАК Коментар
	          |ИЗ
	          |	РегистрСведений.РегистрацияОбмена КАК РегистрацияОбмена
	          |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТМаршрутный КАК ВТМаршрутный
	          |		ПО РегистрацияОбмена.Объект = ВТМаршрутный.СсылкаСсылка
	          |
	          |УПОРЯДОЧИТЬ ПО
	          |	НомерСтроки";
	
	РезультатЗапроса = з.Выполнить(); 
	Если НЕ РезультатЗапроса.Пустой() Тогда 
		ТаблицаМаршрутных = РезультатЗапроса.Выгрузить();
		
		ТаблицаМаршрутных.Колонки.Добавить("Ссылка");
		ТаблицаМаршрутных.Колонки.Добавить("СтатусДокумента");
		ТаблицаМаршрутных.Колонки.Добавить("ЗаказПокупателя");
		ТаблицаМаршрутных.Колонки.Добавить("РеализацияТоваровУслуг");
		ТаблицаМаршрутных.Колонки.Добавить("ПриходныйКассовыйОрдер");
		ТаблицаМаршрутных.Колонки.Добавить("Контрагент");
		ТаблицаМаршрутных.Колонки.Добавить("Номенклатура");
		ТаблицаМаршрутных.Колонки.Добавить("ХарактеристикаНоменклатуры");
		ТаблицаМаршрутных.Колонки.Добавить("ЕдиницаИзмерения");
		Для Каждого Строка Из ТаблицаМаршрутных Цикл 
			Строка.Ссылка 						= Строка.СсылкаСсылка.УникальныйИдентификатор();
			Строка.СтатусДокумента 				= ?(Строка.СтатусСсылка = Перечисления.СтатусыМаршрутногоЛиста.Составляется, "Составляется", ?(Строка.СтатусСсылка = Перечисления.СтатусыМаршрутногоЛиста.Отправлен, "Отправлен", ?(Строка.СтатусСсылка = Перечисления.СтатусыМаршрутногоЛиста.Завершен, "Завершен", Неопределено)));
			Строка.ЗаказПокупателя  			= ?(Строка.ЗаказПокупателяСсылка = NULL, Документы.Заказ.ПустаяСсылка() ,Строка.ЗаказПокупателяСсылка.УникальныйИдентификатор());
			Строка.РеализацияТоваровУслуг		= ?(Строка.РеализацияСсылка = NULL, Документы.РеализацияТоваровУслуг.ПустаяСсылка(), Строка.РеализацияСсылка.УникальныйИдентификатор());
			Строка.ПриходныйКассовыйОрдер  		= ?(Строка.ОплатаСсылка = NULL, Документы.КассовыйОрдер.ПустаяСсылка(), Строка.ОплатаСсылка.УникальныйИдентификатор());
			Строка.Контрагент  					= ?(Строка.КонтрагентСсылка = NULL, Справочники.Контрагенты.ПустаяСсылка() ,Строка.КонтрагентСсылка.УникальныйИдентификатор());
			Строка.Номенклатура 				= ?(Строка.НоменклатураСсылка = NULL, Справочники.Номенклатура.ПустаяСсылка(), Строка.НоменклатураСсылка.УникальныйИдентификатор());
			Строка.ХарактеристикаНоменклатуры 	= ?(Строка.ХарактеристикаНоменклатурыСсылка = NULL, Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка(), Строка.ХарактеристикаНоменклатурыСсылка.УникальныйИдентификатор());
			Строка.ЕдиницаИзмерения 			= ?(Строка.ЕдиницаИзмеренияСсылка = NULL, Справочники.ЕдиницыИзмерения.ПустаяСсылка(), Строка.ЕдиницаИзмеренияСсылка.УникальныйИдентификатор());
		КонецЦикла;
		ТаблицаМаршрутных.Колонки.Удалить("СсылкаСсылка");
		ТаблицаМаршрутных.Колонки.Удалить("СтатусСсылка");
		ТаблицаМаршрутных.Колонки.Удалить("ЗаказПокупателяСсылка");
		ТаблицаМаршрутных.Колонки.Удалить("РеализацияСсылка");
		ТаблицаМаршрутных.Колонки.Удалить("ОплатаСсылка");
		ТаблицаМаршрутных.Колонки.Удалить("КонтрагентСсылка");
		ТаблицаМаршрутных.Колонки.Удалить("НоменклатураСсылка");
		ТаблицаМаршрутных.Колонки.Удалить("ХарактеристикаНоменклатурыСсылка");
		ТаблицаМаршрутных.Колонки.Удалить("ЕдиницаИзмеренияСсылка");
		СтруктураВозврата.Вставить("МаршрутныеЛисты", ТаблицаМаршрутных);	
	КонецЕсли;
	
	
		//////////// Контрагенти
	~Контрагенты:
	з.Текст = "ВЫБРАТЬ
	          |	РегистрацияОбмена.ИД КАК ИД,
	          |	Контрагенты.Ссылка КАК КонтрагентСсылка,
	          |	Контрагенты.Телефон КАК Телефон,
	          |	Контрагенты.ТипЦен КАК ТипЦенСсылка,
	          |	Контрагенты.Наименование КАК Наименование,
	          |	Контрагенты.НомерТелефона КАК НомерТелефона,
	          |	Контрагенты.Город КАК Город,
	          |	Контрагенты.Область КАК Область,
	          |	Контрагенты.НомерВідділенняНП КАК НомерВідділенняНП,
	          |	Контрагенты.СтатусКонтрагента КАК СтатусКонтрагента,
	          |	Контрагенты.ОперативныйСтатусКонтрагента КАК ОперативныйСтатусКонтрагента,
	          |	Контрагенты.Маршрут КАК Маршрут,
	          |	Контрагенты.ДатаСоздания КАК ДатаСоздания,
	          |	Контрагенты.НаименованиеТТ КАК НаименованиеТТ,
	          |	Контрагенты.СсылкаНаСайт КАК СсылкаНаСайт,
	          |	Контрагенты.Геолокация КАК Геолокация,
	          |	Контрагенты.ОбъмЗаМесяц КАК ОбъмЗаМесяц,
	          |	Контрагенты.Улица КАК Улица,
	          |	Контрагенты.Дом КАК Дом,
	          |	Контрагенты.ДатаОновлення КАК ДатаОновлення,
	          |	Контрагенты.КодАсортимета.Порядок КАК КодАсортимента,
	          |	Контрагенты.Телефоны.(
	          |		НомерТелефона КАК НомерТелефона,
	          |		Месенджер.Порядок КАК Месенджер
	          |	) КАК Телефоны,
	          |	Контрагенты.КатегорияТТ КАК КатегорияТТ,
	          |	Контрагенты.СпособДоставки КАК СпособДоставки,
	          |	Контрагенты.Маршруты.(
	          |		Маршрут КАК МаршрутСсылка
	          |	) КАК Маршруты,
	          |	Контрагенты.Асортимент.(
	          |		Артикул КАК Артикул,
	          |		НеРучнаяЗапись КАК НеРучнаяЗапись
	          |	) КАК Асортимент,
	          |	Контрагенты.КаналПошуку КАК КаналПошуку,
	          |	Контрагенты.СоцМережі.(
	          |		Коментар КАК Коментар,
	          |		Посилання КАК Посилання,
	          |		Мережа КАК Мережа
	          |	) КАК СоцМережі
	          |ИЗ
	          |	РегистрСведений.РегистрацияОбмена КАК РегистрацияОбмена
	          |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
	          |		ПО РегистрацияОбмена.Объект = Контрагенты.Ссылка";
			  
			  
	ТаблицаКонтрагентов = з.Выполнить().Выгрузить();
			  
	Если НЕ Отбор = Неопределено Тогда 
		ТаблицаКонтрагентов = ТаблицаКонтрагентов.Скопировать(Отбор);
	КонецЕсли;
	
	ТаблицаКонтрагентов.Колонки.Добавить("Ссылка");
	ТаблицаКонтрагентов.Колонки.Добавить("ТипЦен");
	ТаблицаКонтрагентов.Колонки.Добавить("УИДОбласть");
	ТаблицаКонтрагентов.Колонки.Добавить("УИДГород");
	ТаблицаКонтрагентов.Колонки.Добавить("УИДМаршрут");
	ТаблицаКонтрагентов.Колонки.Добавить("УИДСтатусКонтрагента");
	ТаблицаКонтрагентов.Колонки.Добавить("УИДОперативныйСтатусКонтрагента");
	ТаблицаКонтрагентов.Колонки.Добавить("УИДКатегорияТТ");
	ТаблицаКонтрагентов.Колонки.Добавить("УИДСпособДоставки");
	ТаблицаКонтрагентов.Колонки.Добавить("УИДКаналПошуку");


	ТаблицаКонтрагентов.Колонки.Добавить("ОбластьНаименование");
	ТаблицаКонтрагентов.Колонки.Добавить("ГородНаименование");

	
	
	Для Каждого Строка Из ТаблицаКонтрагентов Цикл 
		
		Строка.Ссылка 							= Строка.КонтрагентСсылка.УникальныйИдентификатор();
		Строка.ТипЦен 							= Строка.ТипЦенСсылка.УникальныйИдентификатор();	
		Строка.ОбластьНаименование 				= Строка.Область.Наименование;
		Строка.ГородНаименование 				= Строка.Город.Наименование;
		Строка.УИДОбласть 						= Строка.Область.УникальныйИдентификатор();
		Строка.УИДГород							= Строка.Город.УникальныйИдентификатор();
		Строка.УИДМаршрут 						= Строка.Маршрут.УникальныйИдентификатор();
		Строка.УИДСтатусКонтрагента 			= Строка.СтатусКонтрагента.УникальныйИдентификатор();
		Строка.УИДОперативныйСтатусКонтрагента	= Строка.ОперативныйСтатусКонтрагента.УникальныйИдентификатор();
		Строка.УИДКатегорияТТ 					= Строка.КатегорияТТ.УникальныйИдентификатор();
		Строка.УИДСпособДоставки 				= Строка.СпособДоставки.УникальныйИдентификатор();
		Строка.УИДКаналПошуку 					= Строка.КаналПошуку.УникальныйИдентификатор();

		Строка.НомерТелефона 		= СтрПолучитьСтроку(Строка.НомерТелефона, 1);
		
		Маршруты = Строка.Маршруты;
		Маршруты.Колонки.Добавить("УИД_Маршрут");
		Для Каждого Элемент Из Маршруты Цикл
			Элемент.УИД_Маршрут = Элемент.МаршрутСсылка.УникальныйИдентификатор();
		КонецЦикла;
		Маршруты.Колонки.Удалить("МаршрутСсылка");
		
		ТЗ = Новый ТаблицаЗначений;
		Отбор = Новый Структура;
		Отбор.Вставить("НеРучнаяЗапись", Истина);
		Для Каждого Элемент из Строка.Асортимент.Найтистроки(Отбор) Цикл  
			Строка.Асортимент.Удалить(Элемент)
		КонецЦикла;
		
	КонецЦикла;
	

	ТаблицаКонтрагентов.Колонки.Удалить("КонтрагентСсылка");
	ТаблицаКонтрагентов.Колонки.Удалить("ТипЦенСсылка");
	ТаблицаКонтрагентов.Колонки.Удалить("Область");
	ТаблицаКонтрагентов.Колонки.Удалить("Город");
	ТаблицаКонтрагентов.Колонки.Удалить("СтатусКонтрагента");
	ТаблицаКонтрагентов.Колонки.Удалить("ОперативныйСтатусКонтрагента");
	ТаблицаКонтрагентов.Колонки.Удалить("Маршрут");
	ТаблицаКонтрагентов.Колонки.Удалить("КатегорияТТ");
	ТаблицаКонтрагентов.Колонки.Удалить("СпособДоставки");
	ТаблицаКонтрагентов.Колонки.Удалить("КаналПошуку");

	
	СтруктураВозврата.Вставить("Контрагенты",ТаблицаКонтрагентов);
	
	Если Не ИгнорироватьПерейти Тогда 
		Перейти ~Возврат;

	КонецЕсли;
	
	
		//////////// Склады Контрагентов
	
	з.Текст = "ВЫБРАТЬ
	          |	РегистрацияОбмена.ИД,
	          |	СкладыКонтрагентов.Ссылка КАК СкладСсылка,
	          |	СкладыКонтрагентов.Контрагент КАК КонтрагентСсылка,
	          |	СкладыКонтрагентов.Наименование
	          |ИЗ
	          |	РегистрСведений.РегистрацияОбмена КАК РегистрацияОбмена
	          |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.СкладыКонтрагентов КАК СкладыКонтрагентов
	          |		ПО РегистрацияОбмена.Объект = СкладыКонтрагентов.Ссылка";
	ТаблицаКонтрагентов = з.Выполнить().Выгрузить();
	
	ТаблицаКонтрагентов.Колонки.Добавить("Ссылка");
	ТаблицаКонтрагентов.Колонки.Добавить("Контрагент");

	Для Каждого Строка Из ТаблицаКонтрагентов Цикл 
		Строка.Ссылка = Строка.СкладСсылка.УникальныйИдентификатор();
		Строка.Контрагент = Строка.КонтрагентСсылка.УникальныйИдентификатор();	
	КонецЦикла;
	ТаблицаКонтрагентов.Колонки.Удалить("СкладСсылка");
	ТаблицаКонтрагентов.Колонки.Удалить("КонтрагентСсылка");
	
	СтруктураВозврата.Вставить("СкладыКонтрагентов",ТаблицаКонтрагентов);
	//////////////////////////////////////////// Кілометраж
	
	з.Текст = 
		"ВЫБРАТЬ
		|	тз.Период,
		|	ПРЕДСТАВЛЕНИЕ(тз.СтатусДня) КАК Статус,
		|	тз.Кілометраж
		|ИЗ
		|	РегистрСведений.Кілометраж КАК тз
		|ГДЕ
		|	тз.Период >= &Период";
	з.УстановитьПараметр("Период",ТекущаяДата()-7*24*60*60);
	ТаблицаКонтрагентов = з.Выполнить().Выгрузить();
	СтруктураВозврата.Вставить("Кілометраж",ТаблицаКонтрагентов);
	
//////////////////////////////////////////// Кілометраж
	
	з.Текст = 
		"ВЫБРАТЬ
		|	РегистрацияКоординат.Дата,
		|	РегистрацияКоординат.Широта,
		|	РегистрацияКоординат.Долгота
		|ИЗ
		|	РегистрСведений.РегистрацияКоординат КАК РегистрацияКоординат
		|ГДЕ
		|	РегистрацияКоординат.Дата > &НачалоДня";
	з.УстановитьПараметр("НачалоДня",НачалоДня(ТекущаяДата()));
	ТаблицаКоординат = з.Выполнить().Выгрузить();
	СтруктураВозврата.Вставить("Координаты",ТаблицаКоординат);
	
	  	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Справочник.Ссылка КАК Ссылка,
		|	Справочник.Наименование КАК Наименование,
		|	Справочник.Нагадування КАК ОписаниеНапоминания,
		|	Справочник.Періодичність.Порядок КАК Периодичность,
		|	Справочник.Активне КАК Активно,
		|	Справочник.ДеньНедели КАК ДеньНедели,
		|	Справочник.ДатаНапоминания КАК ДатаНапоминания,
		|	Справочник.Контрагент КАК Контрагент,
		|	Справочник.НагадатиПроТовар КАК НапоминаниеОТоваре,
		|	Справочник.ДатаСоздания КАК ДатаСоздания,
		|	Справочник.ИзЗаказа КАК ИзЗаказа,    
		|	Справочник.Товары.(
		|		Номенклатура КАК Номенклатура,
		|		Виконано КАК Выполнено,
		|		Кількість КАК Количество
		|	) КАК Товары,
		|	РегистрацияОбмена.ИД КАК ИД
		|ИЗ
		|	РегистрСведений.РегистрацияОбмена КАК РегистрацияОбмена
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Нагадування КАК Справочник
		|		ПО РегистрацияОбмена.Объект = Справочник.Ссылка";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Напоминания = РезультатЗапроса.Выбрать();
	Массив = Новый Массив;
	Пока Напоминания.Следующий() Цикл 
		
		Элемент = Новый Структура;
		Элемент.Вставить("ИД", Напоминания.ИД);
		Элемент.Вставить("УИДСсылка", Напоминания.Ссылка.УникальныйИдентификатор());
		Элемент.Вставить("Наименование", Напоминания.Наименование);
		Элемент.Вставить("ОписаниеНапоминания", Напоминания.ОписаниеНапоминания);
		Элемент.Вставить("Активно", Напоминания.Активно);
		Элемент.Вставить("НапоминаниеОТоваре", Напоминания.НапоминаниеОТоваре);
		Элемент.Вставить("ДатаСоздания", Напоминания.ДатаСоздания);
		Элемент.Вставить("ИзЗаказа", Напоминания.ИзЗаказа);		
		Если Напоминания.НапоминаниеОТоваре Тогда 
			
			Элемент.Вставить("Контрагент", Напоминания.Контрагент.УникальныйИдентификатор());
			Элемент.Вставить("Товары", Новый Массив);
			Артикул = Напоминания.Товары.Выбрать();
			Пока Артикул.Следующий() Цикл 
				СтруктураАртикул = Новый Структура();
				СтруктураАртикул.Вставить("Номенклатура", Артикул.Номенклатура.УникальныйИдентификатор());
				СтруктураАртикул.Вставить("Выполнено", Артикул.Выполнено);
				СтруктураАртикул.Вставить("Количество", Артикул.Количество);
				Элемент.Товары.Добавить(СтруктураАртикул);
			КонецЦикла;
			
		Иначе
			
			Элемент.Вставить("ДеньНедели", Напоминания.ДеньНедели);
			Элемент.Вставить("ДатаНапоминания", Напоминания.ДатаНапоминания);
			Элемент.Вставить("Периодичность", Напоминания.Периодичность);

		КонецЕсли;
		Массив.Добавить(Элемент);
	КонецЦикла;
	СтруктураВозврата.Вставить("Напоминания", Массив);
	
	~Возврат: 
	Возврат СтруктураВозврата;
	
	
	
КонецФункции

//Функция ОтриматиДаніКонтрагентаДляВідправкиНапряму(КонтрагентОбъект) Экспорт

//	
//	ТаблицаКонтрагентов = Новый ТаблицаЗначений;
//	НовСтр = ТаблицаКонтрагентов.Добавить();
//	Для Каждого мет Из Метаданные.Справочники.Контрагенты.Реквизиты Цикл
//		ТаблицаКонтрагентов.Колонки.Добавить(мет.Имя, мет.Тип);
//		НовСтр[мет.Имя] = КонтрагентОбъект[мет.Имя];
//	КонецЦикла;
//	
//	ТаблицаКонтрагентов.Колонки.ТипЦен.Имя = "ТипЦенСсылка";
//	ТаблицаКонтрагентов.Колонки.Добавить("КонтрагентСсылка");
//	НовСтр.КонтрагентСсылка = КонтрагентОбъект.Ссылка;
//	
//	
//	
//	
//	
//	ТаблицаКонтрагентов.Колонки.Добавить("Ссылка");
//	ТаблицаКонтрагентов.Колонки.Добавить("ТипЦен");
//	ТаблицаКонтрагентов.Колонки.Добавить("УИДОбласть");
//	ТаблицаКонтрагентов.Колонки.Добавить("УИДГород");
//	ТаблицаКонтрагентов.Колонки.Добавить("УИДМаршрут");
//	ТаблицаКонтрагентов.Колонки.Добавить("УИДСтатусКонтрагента");
//	ТаблицаКонтрагентов.Колонки.Добавить("УИДОперативныйСтатусКонтрагента");
//	ТаблицаКонтрагентов.Колонки.Добавить("УИДКатегорияТТ");
//	ТаблицаКонтрагентов.Колонки.Добавить("УИДСпособДоставки");
//	ТаблицаКонтрагентов.Колонки.Добавить("УИДКаналПошуку");


//	ТаблицаКонтрагентов.Колонки.Добавить("ОбластьНаименование");
//	ТаблицаКонтрагентов.Колонки.Добавить("ГородНаименование");
//	ТаблицаКонтрагентов.Колонки.Добавить("Маршруты");
//	ТаблицаКонтрагентов.Колонки.Добавить("Асортимент");
//	ТаблицаКонтрагентов.Колонки.Добавить("Телефоны");
//	ТаблицаКонтрагентов.Колонки.Добавить("КодАсортимента");
//	ТаблицаКонтрагентов.Колонки.Добавить("ИД");
//	ТаблицаКонтрагентов.Колонки.Добавить("Наименование");




//	
//	
//	Для Каждого Строка Из ТаблицаКонтрагентов Цикл 
//		
//		Строка.Ссылка 							= Строка.КонтрагентСсылка.УникальныйИдентификатор();
//		Строка.ТипЦен 							= Строка.ТипЦенСсылка.УникальныйИдентификатор();	
//		Строка.ОбластьНаименование 				= Строка.Область.Наименование;
//		Строка.ГородНаименование 				= Строка.Город.Наименование;
//		Строка.УИДОбласть 						= Строка.Область.УникальныйИдентификатор();
//		Строка.УИДГород							= Строка.Город.УникальныйИдентификатор();
//		Строка.УИДМаршрут 						= Строка.Маршрут.УникальныйИдентификатор();
//		Строка.УИДСтатусКонтрагента 			= Строка.СтатусКонтрагента.УникальныйИдентификатор();
//		Строка.УИДОперативныйСтатусКонтрагента	= Строка.ОперативныйСтатусКонтрагента.УникальныйИдентификатор();
//		Строка.УИДКатегорияТТ 					= Строка.КатегорияТТ.УникальныйИдентификатор();
//		Строка.УИДСпособДоставки 				= Строка.СпособДоставки.УникальныйИдентификатор();
//		Строка.УИДКаналПошуку 					= Строка.КаналПошуку.УникальныйИдентификатор();
//		Строка.ИД 								= Новый УникальныйИдентификатор;
//		Строка.Наименование						= КонтрагентОбъект.Наименование;
//		
//		з = Новый Запрос;
//		з.Текст = "ВЫБРАТЬ
//		          |	КодыАсортимета.Порядок КАК Порядок
//		          |ИЗ
//		          |	Перечисление.КодыАсортимета КАК КодыАсортимета
//		          |ГДЕ
//		          |	КодыАсортимета.Ссылка = &Ссылка";
//		з.УстановитьПараметр("Ссылка", Строка.КодАсортимета);
//		ВыборкаКодАс = з.Выполнить().Выбрать();
//		ВыборкаКодАс.Следующий();
//		
//		
//		Строка.КодАсортимента 					= ВыборкаКодАс.Порядок; //Перечисления.КодыАсортимета.Индекс(Строка.КодАсортимета) + 1;
//		Строка.НомерТелефона 		= СтрПолучитьСтроку(Строка.НомерТелефона, 1);
//		Строка.Маршруты = Новый ТаблицаЗначений;
//		

//		Строка.Маршруты.Колонки.Добавить("УИД_Маршрут");
//		Для Каждого Элемент Из КонтрагентОбъект.Маршруты Цикл
//			НовСтрМаршр = Строка.Маршруты.Добавить();
//			НовСтрМаршр.УИД_Маршрут = Элемент.Маршрут.УникальныйИдентификатор();
//		КонецЦикла;
//		
//		
//		//Маршруты.Колонки.Добавить("МаршрутСсылка");
//		
//		Строка.Асортимент = Новый ТаблицаЗначений;
//		Строка.Асортимент.Колонки.Добавить("Артикул");
//		Строка.Асортимент.Колонки.Добавить("НеРучнаяЗапись");
//		
//		
//		//АсТест = КонтрагентОбъект.Асортимент.Добавить();
//		//АсТест.Артикул = "333333";
//		//АсТест.НеРучнаяЗапись = Истина;
//		//
//		//АсТест = КонтрагентОбъект.Асортимент.Добавить();
//		//АсТест.Артикул = "888888";
//		//АсТест.НеРучнаяЗапись = Истина;

//		
//		Для Каждого Элемент Из КонтрагентОбъект.Асортимент Цикл
//			Если НЕ Элемент.НеРучнаяЗапись Тогда 
//				Продолжить;
//			КонецЕсли;
//			
//			НовСтрАсор = Строка.Асортимент.Добавить();
//			НовСтрАсор.Артикул =  Элемент.Артикул;
//			НовСтрАсор.НеРучнаяЗапись =  Элемент.НеРучнаяЗапись;
//		КонецЦикла;
//		
//		
//		Строка.Телефоны = Новый ТаблицаЗначений;
//		Строка.Телефоны.Колонки.Добавить("НомерТелефона");
//		Строка.Телефоны.Колонки.Добавить("Месенджер");	
//		Для Каждого Элемент Из КонтрагентОбъект.Телефоны Цикл	
//			НовСтрТел = Строка.Телефоны.Добавить();
//			НовСтрТел.НомерТелефона =  Элемент.НомерТелефона;
//			НовСтрТел.Месенджер =  Элемент.Месенджер;
//		КонецЦикла;

//				
//	КонецЦикла;
//	

//	ТаблицаКонтрагентов.Колонки.Удалить("КонтрагентСсылка");
//	ТаблицаКонтрагентов.Колонки.Удалить("ТипЦенСсылка");
//	ТаблицаКонтрагентов.Колонки.Удалить("Область");
//	ТаблицаКонтрагентов.Колонки.Удалить("Город");
//	ТаблицаКонтрагентов.Колонки.Удалить("СтатусКонтрагента");
//	ТаблицаКонтрагентов.Колонки.Удалить("ОперативныйСтатусКонтрагента");
//	ТаблицаКонтрагентов.Колонки.Удалить("Маршрут");
//	ТаблицаКонтрагентов.Колонки.Удалить("КатегорияТТ");
//	ТаблицаКонтрагентов.Колонки.Удалить("СпособДоставки");
//	ТаблицаКонтрагентов.Колонки.Удалить("КаналПошуку");

//	Возврат ТаблицаКонтрагентов;
//	
//КонецФункции



Функция СформироватьПакетДанныхИсторияРаботыСКлиентом(ДатаОбновления)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РаботаСКлиентом.Период КАК Период,
		|	РаботаСКлиентом.Клиент КАК Клиент,
		|	РаботаСКлиентом.Запись КАК Запись,
		|	РаботаСКлиентом.УИД_Записи КАК УИД_Записи,
		|	РаботаСКлиентом.АвтоматичнийЗаписБезВзаємодіїЗКлієнтом КАК АвтоматичнийЗаписБезВзаємодіїЗКлієнтом
		|ИЗ
		|	РегистрСведений.РаботаСКлиентом КАК РаботаСКлиентом
		|ГДЕ
		|	РаботаСКлиентом.Период > &ДатаОбновления";
	
	Запрос.УстановитьПараметр("ДатаОбновления", ДатаОбновления);
	
	История = Запрос.Выполнить().Выгрузить();
	История.Колонки.Добавить("КлиентУИД");
	Для Каждого Элемент Из История Цикл 
		Элемент.КлиентУИД = Элемент.Клиент.УникальныйИдентификатор();
	КонецЦикла;
	Возврат История;
КонецФункции
