
&НаКлиенте
Процедура ДействиеПоПредупреждению(Команда)

	Если Не ЗначениеЗаполнено(Напоминание) Тогда
		Предупреждение("Виберіть нагадування!");
		Возврат;
	КонецЕсли;	
	
	УстановитьВыполнено(УИД_Уведомления, Напоминание);
	
	ТипДействяПриНапоминании = ПолучитьТипДействияНапоминанияНаСервере();
	
	Если ТипДействяПриНапоминании = "ЗакрытиеСтарыхЗаказов" Тогда
		форма = ПолучитьФорму("Обработка.ЗакрытиеСтарыхЗаказов.Форма.Форма");
		форма.объект.Контрагент = ПолучитьКонтрагентаДляДействияНаСервере();
		форма.ОткрытьМодально();
		
	ИначеЕсли ТипДействяПриНапоминании = "ОтправкаСообщенияВайберОВидео" Тогда
		
		Характеристика = ПолучитьХарактеристикуДляДействияНаСервере();
		ПараметрыФормы = Новый Структура("Ключ", Характеристика);
		ОткрытьФорму("Справочник.ХарактеристикиНоменклатуры.ФормаОбъекта", ПараметрыФормы,,,,,,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
		
		
	ИначеЕсли ТипДействяПриНапоминании = "ПродолжениеБрониТовара" Тогда
		
		Отказ = Ложь;		
		Характеристика = ПолучитьХарактеристикуДляДействияНаСервере();
		
		Форма = ПолучитьФорму("Справочник.Номенклатура.Форма.ФормаУстановкиБрони");
		Форма.Номенклатура = ПолучитьНоменклатуруХарактеристикиДляДействияНаСервере();
		Форма.Вага = Характеристика;
		Форма.НаКого = ПолучитьКонтрагентаХарактеристикиНаСервере();
		Форма.ОткрытьМодально();
		
	КонецЕсли;	
	
	ЗакрытьУведомление();
КонецПроцедуры

&НаКлиенте
Процедура ОК(Команда)
	Перем ДанныеУведомления;
	Если Не ЗначениеЗаполнено(УИД_Уведомления) Тогда 
		Возврат;
	КонецЕсли;
	
	Если Действие = 0 Или  Действие = 1 Тогда
		Если НапоминаниеОТоваре Тогда 
			ОбработкаНапоминания()
		КонецЕсли;
		
		УстановитьВыполнено(УИД_Уведомления, Напоминание);
		ЗакрытьУведомление();;
		Возврат;
	КонецЕсли;
	
	ОтложитьУведомлениеНаСервере(ДанныеУведомления);
	
	#Если  МобильноеПриложениеКлиент Тогда
		Уведомление = Новый ДоставляемоеУведомление;
		ЗаполнитьЗначенияСвойств(Уведомление, ДанныеУведомления, ,"Данные");
		Уведомление.Данные = Общий.ПолучитьСтрокуИзДанных(ДанныеУведомления["Данные"]);
		
		Уведомление.ДатаПоявленияУниверсальноеВремя = ДатаОтправки(ДанныеУведомления["Данные"]["Дата"]);
		ДоставляемыеУведомления.ДобавитьЛокальноеУведомление(Уведомление);
	#КонецЕсли
	ЗакрытьУведомление();
КонецПроцедуры



&НаСервереБезКонтекста
Процедура УстановитьВыполнено(УИД, Напоминание)
	     
	Набор = РегистрыСведений.ЗапланированыеУведомления.СоздатьНаборЗаписей();
	Набор.Отбор.УИД_Уведомления.Установить(УИД);
	Набор.Прочитать();
	
	Если Набор.Количество() Тогда 
		Набор[0].Выполнено = Истина;
		Набор.Записать();
	КонецЕсли;
	
	Если Напоминание.Періодичність = Перечисления.Періоди.НеПовторювати Тогда 
		Об = Напоминание.ПолучитьОбъект();
		Об.Активне = Ложь;
		об.Записать();
	КонецЕсли;
	
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаНапоминания()
	
	Если Действие = 0 Тогда
	
		 
		
		обНапоминание = Напоминание.ПолучитьОбъект();
		строка = обНапоминание.Товары.Найти(Номенклатура, "Номенклатура");
		строка.Виконано = истина;
		Если обНапоминание.Товары.Найти(Ложь, "Виконано") = Неопределено Тогда 
			обНапоминание.Активне = Ложь;
		КонецЕсли;
		
		обНапоминание.Записать();
	
		
	КонецЕсли;

	
КонецПроцедуры

&НаСервере
Процедура ОтложитьУведомлениеНаСервере(ДанныеУведомления)
	Перем Напоминание;
	
	Если Действие = 0 Тогда 
		Возврат;
	КонецЕсли;
	
	мДата =  ТекущаяДата() + 60 * Действие;
	Набор = РегистрыСведений.ЗапланированыеУведомления.СоздатьНаборЗаписей();
	Набор.Отбор.УИД_Уведомления.Установить(УИД_Уведомления);
	Набор.Прочитать();
	Если Набор.Количество() Тогда 
		
		ДанныеУведомления = Набор[0].ДанныеУведомления.Получить();
		ДанныеУведомления["Данные"]["Дата"] = мДата;
		Набор[0].ДатаУведомления = мДата;
		Набор[0].Отложено = Истина;
		Набор.Записать();
		Возврат;
		
	Иначе	
		ДанныеУведомления = Новый Структура;;
		ДанныеУведомления.Вставить("Заголовок", "Нагадування!");
		ДанныеУведомления.Вставить("Текст", ТекстНагадування);
		ДанныеУведомления.Вставить("Данные", Новый Соответствие); 
		
		ДанныеУведомления["Данные"]["Действие"] = "Напоминание";
		ДанныеУведомления["Данные"]["УИД_Уведомления"] = Строка(УИД_Уведомления);
	КонецЕсли;
	

	Общий.ЗапланироватьУведомление(ДанныеУведомления, Истина, УИД_Уведомления, мДата, Напоминание); 
	
КонецПроцедуры



&НаСервере
Функция ПолучитьТипДействияНапоминанияНаСервере()
	ЗначениеПеречисления = Напоминание.ТипДействяПриНапоминании;
	ИмяПеречисления = ЗначениеПеречисления.Метаданные().Имя;
	ИндексЗначенияПеречисления = Перечисления[ИмяПеречисления].Индекс(ЗначениеПеречисления);
	ИмяЗначенияПеречисления = Метаданные.Перечисления[ИмяПеречисления].ЗначенияПеречисления[ИндексЗначенияПеречисления].Имя;
	
	Возврат ИмяЗначенияПеречисления;
КонецФункции

&НаСервере
Функция ПолучитьКонтрагентаДляДействияНаСервере()
	Возврат Напоминание.КонтрагентДляДействий;
КонецФункции 

&НаСервере
Функция ПолучитьХарактеристикуДляДействияНаСервере()
	Возврат Напоминание.ХарактеристикаДляДействий;
КонецФункции  

&НаСервере
Функция ПолучитьКонтрагентаХарактеристикиНаСервере()
	Возврат Напоминание.ХарактеристикаДляДействий.Контрагент;
КонецФункции


&НаСервере
Функция ПолучитьНоменклатуруХарактеристикиДляДействияНаСервере()
	Возврат Напоминание.ХарактеристикаДляДействий.Владелец;
КонецФункции

&НаСервере
Функция ПолучитьТекстСообщенияНаВайберПоВидеоНаСервере()
	Возврат "По артикулу " + Строка(Напоминание.ХарактеристикаДляДействий.Владелец.Артикул) + " " +  Строка(Напоминание.ХарактеристикаДляДействий.Владелец) + " з'явилось відео.";
КонецФункции

&НаСервереБезКонтекста
Функция  ДатаОтправки(Дата)
	
	Возврат Дата  + (ТекущаяУниверсальнаяДата() - ТекущаяДата()); 
	
КонецФункции

&НаКлиенте
Процедура АктивніНагадуванняВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Перем Значение;
	
	Если ЗначениеЗаполнено(УИД_Уведомления) Тогда 
		Отбор = Новый Структура;
		Отбор.Вставить("УИД_Уведомления", Строка(УИД_Уведомления));
		Строки = АктивніНагадування.НайтиСтроки(Отбор);
		Если Строки.Количество() Тогда 
			Строки[0].ВыбранаяСтрока = Ложь;
		КонецЕсли;
		ЗакрытьУведомление(Ложь);
	КонецЕсли;
	
	СписокВыбора = Элементы.Действие.СписокВыбора;
	_Элемент = СписокВыбора.НайтиПоЗначению(1);
	Если НЕ _Элемент = Неопределено Тогда 
		
		СписокВыбора.Удалить(_Элемент);
	КонецЕсли;
	
	Действие = 0;
	Строка = АктивніНагадування.НайтиПоИдентификатору(ВыбраннаяСтрока);
	Строка.ВыбранаяСтрока = Истина;
	ТекстНагадування 	= Строка.ДанныеУведомления.ТекстНагадування;
	ДатаНагадування 	= Строка.ДанныеУведомления.ДатаНагадування;
	УИД_Уведомления 	= Новый УникальныйИдентификатор(Строка.УИД_Уведомления);
	
	Если Строка.ДанныеУведомления.Свойство("УИД_Номенклатура", Значение) Тогда 
	//	УИД = Новый УникальныйИдентификатор(Значение);
		Номенклатура = ПолучитьНоменклатуруПоУИДу(Значение);
		НапоминаниеОТоваре = Истина;
		Элементы.Действие.СписокВыбора.Добавить(1,"Відкласти до нового надходження");
	КонецЕсли;
	
	Если Строка.ДанныеУведомления.Свойство("УИД_Напоминание", Значение)
		И Значение <> Неопределено Тогда 
		
		Отказ = Ложь;
		Напоминание = ПолучитьНагадуванняПоУИДу(Значение, Отказ);	
		
		Если Отказ = истина Тогда 
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	
	Элементы.ДействиеПоПредупреждению.Видимость = ЗначениеЗаполнено(ТипДействяПриНапоминании(Напоминание))
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПолучитьАктуальныеУведомления();
	ПодключитьОбработчикОжидания("ПолучитьАктуальныеУведомления", 60);
КонецПроцедуры


&НаКлиенте
Процедура ПолучитьАктуальныеУведомления() Экспорт 
	
	Напоминания = Общий.ПолучитьНеПросмотренныеНапоминания();
	
	Для Каждого ПараметрыФормы Из Напоминания Цикл 
		Отбор = Новый Структура;
		Отбор.Вставить("УИД_Уведомления", ПараметрыФормы.УИД_Уведомления);
		
		Если АктивніНагадування.НайтиСтроки(Отбор).Количество() Тогда 
			Продолжить;
		КонецЕсли;
		
		Строка = АктивніНагадування.Добавить();
		//Строка.Нагадування = ПолучитьНагадуванняПоУИДу(ПараметрыФормы.УИД_Напоминание);
		Строка.ДанныеУведомления = ПараметрыФормы;	
		Строка.УИД_Уведомления = ПараметрыФормы.УИД_Уведомления;
		Строка.Текст = ПараметрыФормы.ТекстНагадування;

	
	КонецЦикла;

КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьНагадуванняПоУИДу(УИД, Отказ = Ложь)
	Нагадування =  Справочники.Нагадування.ПолучитьСсылку(Новый УникальныйИдентификатор(УИД));
	Отказ = Не ЗначениеЗаполнено(Нагадування.ВерсияДанных);
	Возврат Нагадування;
КонецФункции
&НаСервереБезКонтекста
Функция ПолучитьНоменклатуруПоУИДу(УИД)
	Возврат Справочники.Номенклатура.ПолучитьСсылку(Новый УникальныйИдентификатор(УИД));
КонецФункции

&НаСервереБезКонтекста
Функция ТипДействяПриНапоминании(Напоминание)
	Возврат Напоминание.ТипДействяПриНапоминании;
КонецФункции


Процедура ЗакрытьУведомление(Удалить = Истина);
	кеш_ = УИД_Уведомления;
	
	ДатаНагадування = Неопределено;
	Напоминание = Неопределено;
	НапоминаниеОТоваре = Ложь;
	Номенклатура  = Неопределено;
	ТекстНагадування = Неопределено;
	УИД_Уведомления = Неопределено;
	
	Если Не Удалить Тогда 
		Возврат;
	КонецЕсли;
	
	Отбор = Новый Структура;
	Отбор.Вставить("УИД_Уведомления", Строка(кеш_));

	Строка = АктивніНагадування.НайтиСтроки(Отбор);
	
	Если Строка.Количество() Тогда 
		АктивніНагадування.Удалить(Строка[0]);
	КонецЕсли;
	
КонецПроцедуры
