
Функция НачатьОбмен(Версия, ИдентификаторКлиента, ПарольВхода,ЭтоНеПервыйОбмен)
	
	Возврат ОбменАРМ.НачатьОбмен(Версия, ИдентификаторКлиента, ПарольВхода,ЭтоНеПервыйОбмен);
	
КонецФункции

Функция СформироватьПакетДанных(ИдентификаторКлиента, ПарольВхода)
	
	Возврат ОбменАРМ.СформироватьПакетДанных(ИдентификаторКлиента, ПарольВхода);
	
КонецФункции

Функция ОбработатьПакетДанных(ПарольВхода, Данные)
	
	Возврат ОбменАРМ.ОбработатьПакетДанных(ПарольВхода, Данные);
	
КонецФункции

Функция ОчиститьПланОбмена(МассивИД,ПарольВхода)
	Возврат ОбменАРМ.УдалитьРегистрацию(МассивИД,ПарольВхода);
КонецФункции

Функция ВключитьЧастичныйОбмен(ПарольВхода)
	Возврат ОбменАРМ.ВключитьЧастичныйОбмен(ПарольВхода);
КонецФункции

Функция ПолучитьДолгПартнера(ПарольВхода)
	
	Возврат ОбменАРМ.ПолучитьДолгПартенра(ПарольВхода);
	
КонецФункции

Функция ОтриматиЗалишкиХарактеристик(ПарольВхода, Номенклатура)
	
	Возврат ОбменАРМ.ОтриматиЗалишкиХарактеристик(ПарольВхода, Номенклатура);
	
КонецФункции

Функция ОновитьОстаткиТаЦены(ПарольВхода)
	Возврат ОбменАРМ.ОновитиЗалишкиТаЦіниНоменклатури(ПарольВхода);
КонецФункции

Функция ОновитьОстаткиТаЦеныЧастково(ПарольВхода)
	Возврат ОбменАРМ.ОновитиЗалишкиТаЦіниНоменклатури(ПарольВхода, Истина);
КонецФункции

Функция ПолучитьДанныеНезакрытыхЗаказов(ПарольВхода, стр_уид)
	Возврат ОбменАРМ.ПолучитьДанныеНезакрытыхЗаказов_v1(ПарольВхода, стр_уид);
КонецФункции

Функция ЗакрытьСтарыеЗаказы(ПарольВхода, Товары, Контрагент_уид)
	Возврат ОбменАРМ.ЗакрытьСтарыеЗаказы(ПарольВхода, Товары, Контрагент_уид);
КонецФункции

Функция ПолучитьКурсЕвроНаДату(ПарольВхода, Дата)
	Возврат ОбменАРМ.ПолучитьКурсЕвроНаДату(ПарольВхода, Дата);
КонецФункции

Функция ВивантажитиТовари(ИдентификаторКлиента, ПарольВхода)
	Возврат ОбменАРМ.ВивантажитиТовари(ИдентификаторКлиента, ПарольВхода);
КонецФункции

Функция ВивантажитиКонтрагентів(ИдентификаторКлиента, ПарольВхода)
	Возврат ОбменАРМ.ВивантажитиКонтрагентів(ИдентификаторКлиента, ПарольВхода);
КонецФункции

Функция ВивантажитиДокументи(ИдентификаторКлиента, ПарольВхода)
	Возврат ОбменАРМ.ВивантажитиДокументи(ИдентификаторКлиента, ПарольВхода);
КонецФункции

Функция ОновитиКурси(ПарольВхода)
	Возврат ОбменАРМ.ОновитиКурси(ПарольВхода);
КонецФункции

Функция ЗаписатиКурсВалют(ПарольВхода, Данные)
	Возврат ОбменАРМ.ЗаписатиКурсВалют(ПарольВхода, Данные);
КонецФункции

Функция ОновитьЧат(ПарольВхода, НовыеСообщения, УИД_Клиента)
	Перем Дата;
	Продавец = ОбменАндроид.ПолучитьПродавцаПоКодуПартнера(ПарольВхода);
	Если Продавец = Неопределено  Тогда 
		Возврат Новый Структура();
	КонецЕсли;

		Уведомления = Новый Массив;
	ОбменАРМ.ЗаписьНовыхСообщений(Продавец, НовыеСообщения, Дата, Уведомления);
	Возврат ОбменАРМ.СформируватьДанныеДляЧата(Продавец.Користувач, Дата, Уведомления, УИД_Клиента, Продавец);
КонецФункции

Функция ЗабронюватиНоменклатуру(ПарольВхода, Данные)
	Ответ = Новый Структура;
	Продавец = ОбменАндроид.ПолучитьПродавцаПоКодуПартнера(ПарольВхода);
	
	Если Продавец = Неопределено  Тогда 
		Ответ.Вставить("Успешно", Ложь);
		Ответ.Вставить("Ошибка", "Помилка авторизації! Перевірте пароль");
	Иначе
		Ответ = ОбменАРМ.УстановитьБроньМешка(Данные, Продавец);	
	КонецЕсли;
	
	Возврат Сериализовать(Ответ);

 КонецФункции



Функция Сериализовать(ОбъектСериализации)
	
	Возврат Новый ХранилищеЗначения(ОбъектСериализации, Новый СжатиеДанных(9));
	
КонецФункции

Функция ОбновитьКлиента(ПарольВхода, Данные)
	Ответ = Новый Структура;
	Продавец = ОбменАндроид.ПолучитьПродавцаПоКодуПартнера(ПарольВхода);
	
	Если Продавец = Неопределено  Тогда 
		Ответ.Вставить("Успешно", Ложь);
		Ответ.Вставить("Ошибка", "Помилка авторизації! Перевірте пароль");
	Иначе
		ОбменАРМ.ОбновитьИдентификаторКлиента(Данные, Продавец);
		Ответ.Вставить("Успешно", Истина);
	КонецЕсли;
	
	Возврат Сериализовать(Ответ);

КонецФункции

Функция ВыполнитьКоменду(ПарольВхода, Данные)
		
	Ответ = Новый Структура;
	Продавец = ОбменАндроид.ПолучитьПродавцаПоКодуПартнера(ПарольВхода);
	Отказ = Ложь;
	
	Если Продавец = Неопределено  Тогда 
		Ответ.Вставить("Успешно", Ложь);
		Ответ.Вставить("Ошибка", "Помилка авторизації! Перевірте пароль");
	Иначе
		мДанные = ОбменАРМ.ВыполнитьКоманду(Продавец, Данные, Отказ);
		Ответ.Вставить("Успешно", Не Отказ);
		Ответ.Вставить("Данные", мДанные);
	КонецЕсли;
	
	Возврат Сериализовать(Ответ);


КонецФункции

Функция ЗаписатиЗміниКонтрагента(ПарольВхода, Данные)
	Возврат ОбменАРМ.ЗаписатиЗміниКонтрагента(ПарольВхода, Данные);
КонецФункции

Функция ОтриматиДаніХарактеристики(Данные, Сектор)
	Возврат ОбменАРМ.ОтриматиДаніХарактеристики(Данные, Сектор);
КонецФункции






