
Функция pingGETping(Запрос)
	
	Возврат ОбщегоНазначенияHTTPViber.ПростойУспешныйОтвет();
	
КонецФункции

Функция SendPOSTSend(Запрос)
	
	УстановитьПривилегированныйРежим(Истина);
	НастройкиВайбер = Справочники.НастройкиViber.НайтиПоРеквизиту("Метод", "Send");

	Попытка
		Ответ = МодульУправленияViber.ОбработатьВходящийЗапрос(Запрос, НастройкиВайбер);
	Исключение
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		Ответ = ОбщегоНазначенияHTTPViber.ОтветОбОшибке(ИнформацияОбОшибке);
	КонецПопытки;
	
	Если НастройкиВайбер.ВестиЛогированиеЗапросов Тогда
		ОбщегоНазначенияHTTPViber.ЗаписьЛогированияЗапросов("Send", Запрос, Ответ);
	КонецЕсли;	

	Возврат Ответ;
	
КонецФункции

Функция SendSecondPOSTSend(Запрос)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Попытка
		Ответ = МодульУправленияViber.ОбработатьВходящийЗапросSECOND(Запрос);
	Исключение
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		Ответ = ОбщегоНазначенияHTTPViber.ОтветОбОшибке(ИнформацияОбОшибке);
	КонецПопытки;
	
	НастройкиВайбер = Справочники.НастройкиViber.НайтиПоРеквизиту("Метод", "SendSecond");
	Если НастройкиВайбер.ВестиЛогированиеЗапросов Тогда
		ОбщегоНазначенияHTTPViber.ЗаписьЛогированияЗапросовВторойМетод("Send", Запрос, Ответ);
	КонецЕсли;	

	Возврат Ответ; 
	
КонецФункции


/////// Мобильный обмен ////////////////////////////
Функция exchangePOSTSendExchange(Запрос)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Попытка
		Ответ = ViberОбмен.ОбработатьВходящийЗапрос(Запрос);
	Исключение
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		Ответ = ViberОбмен.ОтветОбОшибке(ИнформацияОбОшибке);
	КонецПопытки;
	
	//ViberОбмен.ЗаписьЛогированияЗапросов("Send", Запрос, Ответ);
	
	Возврат Ответ;
	

КонецФункции

