////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

// Обработчик события ПередЗаписью объекта.
//
Процедура ПередЗаписью(Отказ)
	
	Если НЕ ОбменДанными.Загрузка
		И НЕ Владелец.ВестиУчетПоХарактеристикам Тогда
		ОбщегоНазначения.СообщитьОбОшибке(
		"Для номенклатуры """ + Владелец + """ не ведется учет по характеристикам.
		|Характеристика """ + Наименование + """ не может быть записана.", 
		Отказ);
		
	КонецЕсли;
	
	ДополнительныеСвойства.Вставить("ЗарегистрироватьИзмененияМешка", 
	Бронь <> Ссылка.Бронь 
	Или ПериодБрони <> Ссылка.ПериодБрони 
	Или  Контрагент <> Ссылка.Контрагент);
	
	Если Не Отказ Тогда
		Если ЕстьВидео <> ЭтотОбъект.Ссылка.ЕстьВидео Тогда
			Если ЕстьВидео Тогда
				Текст2 = "Появилося відео.";
			Иначе
				Текст2 = "Відео видалено.";
			КонецЕсли;
			ОтправитьИнформациюВЧат(Текст2);
		ИначеЕсли Бронь <> ЭтотОбъект.Ссылка.Бронь Или ПериодБрони <> ЭтотОбъект.Ссылка.ПериодБрони Тогда
			Если ЗначениеЗаполнено(НачалоДня(ПериодБрони)) Тогда 
				Текст2 = "Бронь на " + Бронь + " для " + Контрагент + " до " + Формат(ПериодБрони, "ДФ=dd.MM.yyyy") + ".";
			Иначе
				Текст2 = "Вільний";
			КонецЕсли;
			ОтправитьИнформациюВЧат(Текст2);
		КонецЕсли;
		
		
		
		Если (ПустаяСтрока(СекторНаСкладі) И НЕ ПустаяСтрока(Ссылка.СекторНаСкладі)) ИЛИ СекторНаСкладі = "Не вдалось" Тогда 
			СекторНаСкладі = Ссылка.СекторНаСкладі;
		КонецЕсли;
		
		Если ПустаяСтрока(Коментар) И НЕ ПустаяСтрока(Ссылка.Коментар) Тогда 
			Коментар = Ссылка.Коментар;
		КонецЕсли;
		
		Если НЕ Открыт И Ссылка.Открыт Тогда 
			Открыт = Истина;
		КонецЕсли;
		
		Если Ссылка.СекторНаСкладі <> СекторНаСкладі И НЕ ПустаяСтрока(СекторНаСкладі) Тогда 
			ОблікСекторів.РучнаЗмінаСектораНаСкладі(Ссылка, ОблікСекторів.ОтриматиСектор(СекторНаСкладі));
		КонецЕсли;
		
		
	КонецЕсли;
	 


КонецПроцедуры

Процедура ОтправитьИнформациюВЧат(Текст2)
			Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Штрихкоды.Штрихкод
		|ИЗ
		|	РегистрСведений.Штрихкоды КАК Штрихкоды
		|ГДЕ
		|	Штрихкоды.Владелец = &Владелец
		|	И Штрихкоды.ХарактеристикаНоменклатуры = &Характеристика";
		Запрос.УстановитьПараметр("Владелец", Владелец);
		Запрос.УстановитьПараметр("Характеристика", ЭтотОбъект.Ссылка);
		Выборка = Запрос.Выполнить().Выбрать();
		ШК = "";
		Если Выборка.Следующий() Тогда
			ШК = Выборка.Штрихкод;
		КонецЕсли;
		
		Текст = Владелец.Артикул + " / " + ШК + " / " + ЭтотОбъект.Ссылка + " - " + Текст2;
		
		Общий.ОтправитьИнформациюВЧат(Текст);

КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТИРУЕМЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

// Функция устанавливает новое наименование характеристики по значениям свойств.
//
// Параметры:
//  КоллекцияЗначенийСвойств - коллекция значений, имеющая свойство Значение.
//
// Возвращаемое значение:
//  Строка - сформированное наименование.
//
Функция СформироватьНаименование(КоллекцияЗначенийСвойств) Экспорт

	Строка = "";

	Для каждого ЭлементКоллекции Из КоллекцияЗначенийСвойств Цикл
		
		Если ЗначениеЗаполнено(ЭлементКоллекции.Значение) Тогда
			
			Если ТипЗнч(ЭлементКоллекции.Значение) = Тип("Дата") Тогда
				
				Если ЭлементКоллекции.Свойство.ТипЗначения.КвалификаторыДаты.ЧастиДаты = ЧастиДаты.Дата Тогда
					Строка = Строка + Формат(ЭлементКоллекции.Значение, "ДФ=dd.MM.yyyy") + ", ";
				ИначеЕсли ЭлементКоллекции.Свойство.ТипЗначения.КвалификаторыДаты.ЧастиДаты = ЧастиДаты.Время Тогда
					Строка = Строка + Формат(ЭлементКоллекции.Значение, "ДФ=ЧЧ:мм:сс") + ", ";
				Иначе
					Строка = Строка + ЭлементКоллекции.Значение + ", ";
				КонецЕсли;
				
			Иначе
				
				Строка = Строка + ЭлементКоллекции.Значение + ", ";
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;

	Строка = Лев(Строка, СтрДлина(Строка) - 2);

	Если ПустаяСтрока(Строка) Тогда
		Строка = "<Свойства не назначены>";
	КонецЕсли;

	Возврат Строка;

КонецФункции

Процедура ПриЗаписи(Отказ)
	
	Перем ЗначениеСвойства;
	
	Если Не ОбменДанными.Загрузка И Не ЭтоГруппа И НЕ Отказ Тогда
		
		ТЗ = ОбменАндроид.ПолучитьТорговыхЗаданнойНоменклатуры(Владелец);
		
		
		Для Каждого ТорговийАгент ИЗ ТЗ Цикл
			ОбменАндроид.ЗарегистрироватьОбъектОбменАндроидДляПродавца(Владелец, ТорговийАгент, Ложь);
		КонецЦикла;
	КонецЕсли;
	
	Если ДополнительныеСвойства.Свойство("ЗарегистрироватьИзмененияМешка", ЗначениеСвойства) 
		И ЗначениеСвойства Тогда 
		РегистрыСведений.ИзмененияБрониХарактеристики.ЗарегистрироватьИзмененияМешка(Ссылка);
	КонецЕсли;
	
	ПоточнийКористувач = ПараметрыСеанса.ТекущийПользователь;
	Если Не ПоточнийКористувач.Наименование = "SOAP" Тогда
		Общий.ЗаписІсторіїЗміниХарактеристики(Ссылка, ПоточнийКористувач);
	КонецЕсли;
	
	

КонецПроцедуры