
Процедура ОбработкаПроведения(Отказ, Режим)

	// регістр Презентації 
	Движения.Презентації.Записывать = Истина;
	Движения.Презентації.Очистить();
	Для Каждого ТекСтрокаТовари Из Товари Цикл
		Движение = Движения.Презентації.Добавить();
		Движение.Период = Дата;
		Движение.Контрагент = Контрагент;
		Движение.Номенклатура = ТекСтрокаТовари.Номенклатура;
		Движение.Количество = 1;
		Движение.Коментар = ТекСтрокаТовари.Коментар;
		Движение.КоментарМенеджера = ТекСтрокаТовари.КоментарМенеджера;
	КонецЦикла;
	
	Если Не Отказ Тогда
	
		Артикулы  = Товари.Выгрузить(,"Номенклатура");
		Артикулы.Свернуть("Номенклатура");
		Для Каждого Элемент Из Артикулы Цикл 
			Запись = РегистрыСведений.АсортиментПрезентацій.СоздатьМенеджерЗаписи();
			Запись.Контрагент = Контрагент;
			Запись.Асортимент = Элемент.Номенклатура.Артикул + " " + Элемент.Номенклатура;
			Запись.Записать(Истина);	
		КонецЦикла;
		
		ОбменАндроид.ЗарегистрироватьОбъектОбменАндроид(Контрагент);

		
	КонецЕсли;
	
КонецПроцедуры
