Перем НП Экспорт;
Перем СхемаКомпоновки Экспорт;
Перем мИменаМесяцев Экспорт;
Перем КодЯзыкаПечать Экспорт;
Перем ЭтоРасшифровка Экспорт;
Перем ДанныеРасшифровки Экспорт;
Перем НастройкиРасшифровки Экспорт;
Перем КодПоЕДРПОУ Экспорт; 

Процедура ПечатьРазделаОтчета(СхемаКомпоновкиДанных,Шапка, ДанныеРасшифровки, ЭтоРасшифровка = Ложь, НастройкиРасшифровки, ФормаОтчета) Экспорт 
	
	//Очищаем поле табличного документа
	Результат = ФормаОтчета.ЭлементыФормы.Результат;
	Результат.Очистить();
	
	Если НЕ ЭтоРасшифровка Тогда
		Макет 		 						= ПолучитьМакет(Шапка);
		ОбластьШапки 						= Макет.ПолучитьОбласть("Шапка");
		ПериодОтчета 						= ПолучитьпериодОтчета();
		ОбластьШапки.Параметры.Период 		= ПериодОтчета;
		Результат.Вывести(ОбластьШапки);
		Результат.ОриентацияСтраницы 		= ОриентацияСтраницы.Портрет;
	КонецЕсли;
	
	//Настройки по умолчанию из схемы
	Настройки = КомпоновщикНастроек.Настройки;
	
	//Не выводить заголовок
	ЗначениеЗаголовка = СхемаКомпоновкиДанных.НастройкиПоУмолчанию.ПараметрыВывода.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Title"));
	ЗначениеЗаголовка.Использование = Ложь;
	
	//Не выводить параметры
	ВыводПараметров = Настройки.ПараметрыВывода.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("DataParametersOutput"));
	ВыводПараметров.Использование = Истина;
	ВыводПараметров.Значение = ТипВыводаТекстаКомпоновкиДанных.НеВыводить;
	
	//Не выводить отбор
	ВыводФильтра = СхемаКомпоновкиДанных.НастройкиПоУмолчанию.ПараметрыВывода.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("FilterOutput"));
	ВыводФильтра.Использование = Истина;
	ВыводФильтра.Значение = ТипВыводаТекстаКомпоновкиДанных.НеВыводить;

	//Настройки по умолчанию из схемы
	Настройки = КомпоновщикНастроек.Настройки;

	//Данные о расшифровке данных в переменную
	ДанныеРасшифровки = Новый ДанныеРасшифровкиКомпоновкиДанных;

	//Формируем макет, с помощью компоновщика макета
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;

	//Передаем в макет компоновки схему, настройки и данные расшифровки
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных,
	Настройки, ДанныеРасшифровки);

	//Выполним компоновку с помощью процессора компоновки
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки,,
	ДанныеРасшифровки);

 	//Выводим результат в табличный документ
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	
	ПроцессорВывода.УстановитьДокумент(Результат);

	Результат.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	Результат.АвтоМасштаб = Истина;
	
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);				
	
	Если СхемаКомпоновки = "ТитульнаяСтраница" Тогда 
		Результат.ПоказатьУровеньГруппировокСтрок(3);
	КонецЕсли;	
	Если СхемаКомпоновки = "Поступления" Тогда 
		Результат.ПоказатьУровеньГруппировокСтрок(3);
	КонецЕсли;		
	Если СхемаКомпоновки = "Возвраты" Тогда 
		Результат.ПоказатьУровеньГруппировокСтрок(2);
	КонецЕсли;			
	
	//Если НЕ ЭтоРасшифровка Тогда
	//	
	//	Подвал = СхемаКомпоновки+"Подвал";
	//	
	//	Макет = ПолучитьМакет(Подвал);
	//	
	//	ОбластьПодвала = Макет.ПолучитьОбласть("Подвал");

	//	Результат.Вывести(ОбластьПодвала);
	//	
	//КонецЕсли;	
	////В табличном документе выключаем пустые колонки
	//Если НЕ ЭтоРасшифровка Тогда
	//	Смещать = ТипСмещенияТабличногоДокумента.ПоГоризонтали;
	//	Для НомерКолонки = 2 По 100 Цикл
	//		ТекАдрес = "R8C" + СокрЛП(Строка(НомерКолонки));
	//		ТекОбласть = Результат.Область(ТекАдрес);
	//		ТекКолонка = Результат.Область("C" + СокрЛП(Строка(НомерКолонки)));
	//		Если СокрЛП(ТекОбласть.Текст) = "" Тогда
	//			Результат.УдалитьОбласть(ТекКолонка, Смещать);
	//		КонецЕсли;	
	//	КонецЦикла;	
	//КонецЕсли;
	//ТекОбласть = Результат.НайтиТекст("Разом", ТекОбласть, Результат.Область(), Истина, Истина, Истина, Ложь);
	//Если ТекОбласть <> Неопределено Тогда
	//	ТекОбласть.Текст = НСтр("ru='Всего';uk='Всього'",КодЯзыкаПечать);
	//КонецЕсли;	
	//ТекОбласть = Результат.НайтиТекст("Разом", ТекОбласть, Результат.Область(), Истина, Истина, Истина, Ложь);
	//Если ТекОбласть <> Неопределено Тогда
	//	ТекОбласть.Текст = НСтр("ru='Остаток на конец';uk='Залишок на кінець'",КодЯзыкаПечать);
	//КонецЕсли;		
	
КонецПроцедуры	

//Служебные процедуры и функции

//Представление периода для шапок отчетов
Функция ПолучитьпериодОтчета()Экспорт 
	
	ПериодОтчета = "";
	
	ПериодОтчета = НСтр("ru='на ';uk='на '") + Формат(Период,"ДЛФ=Д");
	
	Возврат ПериодОтчета;
	
КонецФункции	

