
Процедура ЗарегистрироватьИзмененияМешка(Мешок) Экспорт
	 Запрос = Новый Запрос( "ВЫБРАТЬ
	 |	ТорговыеАгенты.Ссылка
	 |ИЗ
	 |	Справочник.ТорговыеАгенты КАК ТорговыеАгенты
	 |ГДЕ
	 |	НЕ ТорговыеАгенты.ПометкаУдаления");
	 
	 Результат = Запрос.Выполнить().Выбрать();
	 Пока Результат.Следующий() Цикл 
		Запись = СоздатьМенеджерЗаписи();
		Запись.Торговий = Результат.Ссылка;
		Запись.Характеристика = Мешок;
		Запись.УИД = Новый  УникальныйИдентификатор();
		Запись.Записать();
	 КонецЦикла;
	 
КонецПроцедуры


Процедура УдалитьИзменение(МассивУИД) Экспорт
	 Запрос = Новый Запрос( "ВЫБРАТЬ
	                        |	ИзмененияБрониХарактеристики.Характеристика,
	                        |	ИзмененияБрониХарактеристики.Торговий
	                        |ИЗ
	                        |	РегистрСведений.ИзмененияБрониХарактеристики КАК ИзмененияБрониХарактеристики
	                        |ГДЕ
	                        |	ИзмененияБрониХарактеристики.УИД В(&УИД)");
	 Запрос.УстановитьПараметр("УИД", МассивУИД);
	 Результат = Запрос.Выполнить().Выбрать();
	 Набор =  СоздатьНаборЗаписей();

	 Пока Результат.Следующий() Цикл 
		
		Набор.Отбор.Характеристика.Установить(Результат.Характеристика);
		Набор.Отбор.Торговий.Установить(Результат.Торговий);
		Набор.Записать();
	 КонецЦикла;
	 КонецПроцедуры
