&НаКлиенте
Перем УИДФормы;
&НаКлиенте
Перем мЗакрытиеСПараметром;

&НаКлиенте
Перем СписокКлиентов;

//++
&НаКлиенте
Перем мОбработкаНапоминанияУжеОтрывалась;
//++


&НаКлиенте
Процедура ТоварыНоменклатураПриИзменении(Элемент)
	Если Элементы.Товары.ТекущиеДанные.Количество = 0 Тогда 
		Элементы.Товары.ТекущиеДанные.Количество = 1;
	КонецЕсли;	
КонецПроцедуры


&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	ТекущиеДанные.Сума = ТекущиеДанные.ЦенаПродажиВес * ТекущиеДанные.Количество;
	ТоварыКоличествоПриИзмененииНаСервере(ТекущиеДанные.Номенклатура, ТекущиеДанные.ХарактеристикаНоменклатуры, ТекущиеДанные.Сума);

КонецПроцедуры

&НаСервере
Процедура ТоварыКоличествоПриИзмененииНаСервере(нНоменклатура, нХарактеристикаНоменклатуры, Сумма)
	Номенклатура = Справочники.Номенклатура.НайтиПоНаименованию(нНоменклатура, Истина);

	нХарактеристикаНоменклатуры = Справочники.ХарактеристикиНоменклатуры.НайтиПоНаименованию(нХарактеристикаНоменклатуры,Истина,,Номенклатура);
	Сумма = нХарактеристикаНоменклатуры.Вага * Сумма
КонецПроцедуры





&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора) Экспорт
	Если ТипЗнч(ВыбранноеЗначение) = Тип("СправочникСсылка.Номенклатура") Тогда 
		ШКТовара = Общий.ПолучитьШтрихкодТовара(ВыбранноеЗначение);

		СтруктураТовара = Общий.ПолучитьДанныеТовараПоШК(Строка(ШКТовара));		
		ДобавитьТовар(ВыбранноеЗначение,,СтруктураТовара.ЕдиницаИзмерения,1,СтруктураТовара.Штрихкод,Объект.ТипЦен);
		ФормаДобавления = ПолучитьФорму("Справочник.Номенклатура.ФормаСписка",Новый Структура("РежимВыбора",Истина),ЭтаФорма);
		ФормаДобавления.Открыть();

	ИначеЕсли ТипЗнч(ВыбранноеЗначение) = Тип("Строка") Тогда
		Объект.Коментар = ВыбранноеЗначение;
	Иначе
		Если ВыбранноеЗначение.УИД <> УИДФормы Тогда 
			Возврат;
		КонецЕсли;
		
		Если ВыбранноеЗначение.Количество = 0 Тогда 
			Сообщить("Не хватает остатка: "+ВыбранноеЗначение.Номенклатура+", "+ВыбранноеЗначение.ХарактеристикаНоменклатуры);
			Возврат;
		КонецЕсли;
		ДобавитьТовар(ВыбранноеЗначение.Номенклатура,ВыбранноеЗначение.ХарактеристикаНоменклатуры,ВыбранноеЗначение.ЕдиницаИзмерения,ВыбранноеЗначение.Количество,ВыбранноеЗначение.Штрихкод,Объект.ТипЦен);
		ФормаДобавления = ПолучитьФорму("Справочник.Номенклатура.ФормаСписка",Новый Структура("РежимВыбора",Истина),ЭтаФорма);
		ФормаДобавления.Открыть();
	
	КонецЕсли;
	ЗаписатьПриИзменении(); //intrata_wald_02072021
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "Подбор" Тогда 
		Если Параметр.УИД <> УИДФормы Тогда 
			Возврат;
		КонецЕсли;

		ВыбранноеЗначение =  Параметр;
		Если ТипЗнч(ВыбранноеЗначение) = Тип("СправочникСсылка.Номенклатура") Тогда 
		ШКТовара = Общий.ПолучитьШтрихкодТовара(ВыбранноеЗначение);

		СтруктураТовара = Общий.ПолучитьДанныеТовараПоШК(Строка(ШКТовара));		
		ДобавитьТовар(ВыбранноеЗначение,,СтруктураТовара.ЕдиницаИзмерения,1,СтруктураТовара.Штрихкод,Объект.ТипЦен, Параметр.Цена);
		//Сообщить("Товар додано");

		ИначеЕсли ТипЗнч(ВыбранноеЗначение) = Тип("Строка") Тогда
			Объект.Коментар = ВыбранноеЗначение;
		Иначе		
			Если ВыбранноеЗначение.Количество = 0 Тогда 
				Сообщить("Не хватает остатка: "+ВыбранноеЗначение.Номенклатура+", "+ВыбранноеЗначение.ХарактеристикаНоменклатуры);
				Возврат;
			КонецЕсли;
			ДобавитьТовар(ВыбранноеЗначение.Номенклатура,ВыбранноеЗначение.ХарактеристикаНоменклатуры,ВыбранноеЗначение.ЕдиницаИзмерения,ВыбранноеЗначение.Количество,ВыбранноеЗначение.Штрихкод,Объект.ТипЦен, ВыбранноеЗначение.Цена);
			//Сообщить("Товар додано");
		КонецЕсли;
		
	КонецЕсли;
	
	ЗаписатьПриИзменении(); //intrata_wald_02072021

КонецПроцедуры



&НаКлиенте
Процедура ИзменитьТовары(Команда)
	Если Не ЗначениеЗаполнено(Объект.Контрагент) И Не ЗначениеЗаполнено(Объект.ТипЦен) Тогда 
		Предупреждение("Виберіть спочатку контрагента і тип цін",30,"Доступ до підбору заборонений");
		Возврат;
		КонецЕсли;
	
		ФормаДобавления = ПолучитьФорму("Справочник.Номенклатура.ФормаСписка",Новый Структура("РежимВыбора,ТипЦен,Товары,УИД",Истина,Объект.ТипЦен,ПолучитьТоварыДокумента(),УИДФормы),ЭтаФорма);
		
		//Для Каждого Строка Из Объект.Товары Цикл
		//	НовСтрока = ФормаДобавления.ТаблицаВыбора.Добавить();
		//	ЗаполнитьЗначенияСвойств(НовСтрока,Строка);
		//КонецЦикла;

	ФормаДобавления.Открыть();
	ЗаписатьПриИзменении(); //intrata_wald_02072021
	ПересчитатьИтогЕвро(); //intrata_wald_02072021
  		
КонецПроцедуры

&НаСервере
Функция ПолучитьТоварыДокумента()
	сз = Новый СписокЗначений;
	Для Каждого Строка Из Объект.Товары Цикл
		сз.Добавить(Строка.Номенклатура);
	КонецЦикла;
	Возврат сз;
КонецФункции



&НаКлиенте
Процедура УдалитьСтроку(Команда)
	Если Объект.Товары.Количество() Тогда 
		Объект.Товары.Удалить(Объект.Товары.Индекс(Элементы.Товары.ТекущиеДанные));
	КонецЕсли;
	ЗаписатьПриИзменении(); //intrata_wald_02072021
	ПересчитатьИтогЕвро(); //intrata_wald_02072021
КонецПроцедуры

&НаКлиенте
Процедура КомандаЗакрыть(Команда)
	ЗаписатьПриИзменении(); //intrata_wald_02072021
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура СканироватьШК(Команда)
	#Если МобильноеПриложениеКлиент Тогда
	
	ОбработчикСканирования = Новый ОписаниеОповещения("ОбработкаСканирования", ЭтаФорма);	
	СредстваМультимедиа.ПоказатьСканированиеШтрихКодов("Сканируйте штрихкоды",ОбработчикСканирования);
	ЗаписатьПриИзменении(); //intrata_wald_02072021
	ПересчитатьИтогЕвро(); //intrata_wald_02072021
	
	#КонецЕсли
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаСканирования(Штрихкод, Результат, Сообщение, ДополнительныеПараметры) Экспорт
	СтруктураТовара = Общий.ПолучитьДанныеТовараПоШК(Строка(Штрихкод));
	Если СтруктураТовара = "" Тогда 
		Сообщить("Не найден товар "+Штрихкод);
		Возврат;
	КонецЕсли;
	ДобавитьТовар(СтруктураТовара.Номенклатура,СтруктураТовара.Характеристика,СтруктураТовара.ЕдиницаИзмерения,1,Штрихкод,Объект.ТипЦен);
	ЗаписатьПриИзменении(); //intrata_wald_02072021
КонецПроцедуры


&НаКлиенте
Процедура ТоварыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ=Истина;
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьШКБыстро(Команда)
	ДобавитьШКБыстроКод = Формат(ДобавитьШКБыстро,"ЧДЦ=; ЧГ=0");
	СтруктураТовара = Общий.ПолучитьДанныеТовараПоШК(Строка(ДобавитьШКБыстроКод));
	Если СтруктураТовара = "" Тогда 
		Сообщить("Не найден товар "+ДобавитьШКБыстроКод);
		Возврат;
	КонецЕсли;
	
	УжеВТаблице = 0;
	СтрокиТовара = Объект.Товары.НайтиСтроки(Новый Структура("Номенклатура,ХарактеристикаНоменклатуры,ЕдиницаИзмерения",СтруктураТовара.Номенклатура,СтруктураТовара.Характеристика,СтруктураТовара.ЕдиницаИзмерения));
	Для Каждого Строка Из СтрокиТовара Цикл
		УжеВТаблице = УжеВТаблице + Строка.Количество;
	КонецЦикла;
	СтруктураТовара.Вставить("УжеВТаблице",УжеВТаблице);

	
	ФормаПодтверждения = ПолучитьФорму("Документ.Заказ.Форма.ФормаПодтверждения",СтруктураТовара,ЭтаФорма);	
	ФормаПодтверждения.Открыть();
	//ДобавитьТовар(СтруктураТовара.Номенклатура,СтруктураТовара.Характеристика,СтруктураТовара.ЕдиницаИзмерения,1,ДобавитьШКБыстроКод);
	ДобавитьШКБыстро = 0;
	ЗаписатьПриИзменении(); //intrata_wald_02072021
	ПересчитатьИтогЕвро(); //intrata_wald_02072021
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьТовар(Номенклатура,ХарактеристикаНоменклатуры,ЕдиницаИзмерения,Количество,Штрихкод,ТипЦен,Знач Цена = 0)
	СтрокиТовара = Объект.Товары.НайтиСтроки(Новый Структура("Номенклатура,ХарактеристикаНоменклатуры,ЕдиницаИзмерения",Номенклатура,ХарактеристикаНоменклатуры,ЕдиницаИзмерения,Цена));
	НовСтр = Неопределено;
	Если СтрокиТовара.Количество() Тогда 
		НовСтр = СтрокиТовара[0];
		НовСтр.Количество = НовСтр.Количество + Количество;
		НовСтр.Сума = НовСтр.Количество * НовСтр.Цена;
	Иначе
		НовСтр = Объект.Товары.Добавить();
		НовСтр.Номенклатура = Номенклатура;
		НовСтр.ХарактеристикаНоменклатуры = ХарактеристикаНоменклатуры;
		НовСтр.ЕдиницаИзмерения = ЕдиницаИзмерения;
		Вага = 20;
		Попытка
			Вага = Число(Строка(ХарактеристикаНоменклатуры));
		Исключение
		КонецПопытки;
		Если Вага > 900 Тогда 
			Вага = 20;
		КонецЕсли;
		
		НовСтр.Количество = Количество;
		НовСтр.Штрихкод = Штрихкод;
		Если Цена > 0 Тогда 
			НовСтр.ЦенаПродажиВес = Цена;
			НовСтр.Цена = Цена * Вага;
		Иначе
			НовСтр.ЦенаПродажиВес = Общий.ПолучитьЦенуНоменклатуры(Номенклатура,ХарактеристикаНоменклатуры,ТипЦен);
			
			НовСтр.Цена = НовСтр.ЦенаПродажиВес * Вага;
		КонецЕсли;
		НовСтр.Сума = Количество * НовСтр.Цена;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	//Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
	//	Элементы.ГруппаДоступа.Доступность = Ложь;
	//	Элементы.Товары.ТолькоПросмотр = Истина;
	//	Элементы.Дата.Доступность = Ложь;
	//КонецЕсли;
	//Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда 
	//#Если МобильноеПриложениеКлиент Тогда
	//    ПодключитьОпросКоординат();
	//#КонецЕсли		
	//КонецЕсли;
	мЗакрытиеСПараметром = Ложь;

	УИДФормы = Новый УникальныйИдентификатор();
	
	ПолучитьКурсЕвро();
	
КонецПроцедуры

#Если МобильноеПриложениеКлиент Тогда
	



&НаКлиенте
Процедура ОпросКоординат(ИмяПровайдера, ДанныеМестоположения, ДополнительныеДанные) Экспорт 
	////РаботаСГеоданнымиСервер.ЗафиксироватьКоординаты(ИмяПровайдера, ДанныеМестоположения); // Тут запись в регистр сведений

	//Если Объект.Широта > 0 Тогда 
	//	ОпсианиеОповещения = Новый ОписаниеОповещения("ОпросКоординат", ЭтаФорма);
	//	СредстваГеопозиционирования.ОтключитьОбработчикИзмененияМестоположения(ОпсианиеОповещения, ИмяПровайдера);
	//	Возврат;
	//КонецЕсли;
	//
	//Если ДанныеМестоположения.Координаты.Широта > 0 Тогда 
	//	Объект.Широта = ДанныеМестоположения.Координаты.Широта;
	//	Объект.Долгота = ДанныеМестоположения.Координаты.Долгота;
	//	//Сообщить(Объект.Широта);
	//	//Сообщить(Объект.Долгота);

	//КонецЕсли;
КонецПроцедуры // ОпросКоординат
#КонецЕсли

&НаКлиенте
Процедура ДодатиКоментар(Команда)
	ФормаДобавления = ПолучитьФорму("Документ.Заказ.Форма.ФормаВводаКоментаря",Новый Структура("Коментар",Объект.Коментар),ЭтаФорма);
	ФормаДобавления.Открыть();
	ЗаписатьПриИзменении(); //intrata_wald_02072021
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	Перем ДанныеПроверки;
	
	ЗаповнитиСпосібДоставки();
	ТипЦенКонтрагента = ПолучитьТипЦенКонтрагента(Объект.Контрагент);
	Если ЗначениеЗаполнено(ТипЦенКонтрагента) Тогда 
		Объект.ТипЦен = ТипЦенКонтрагента;
	КонецЕсли;
	Объект.СкладКонтрагента = ПолучитьСкладКонтрагента(Объект.Контрагент);
	Объект.ПершаФорма = Ложь;
	ИнфоБорг();
	Общий.ПоискАктуальныхЗаказов(Объект.Контрагент, ДанныеПроверки);
	
	Если ДанныеПроверки.Свойство("Предупреждение") Тогда 
		Предупреждение(ДанныеПроверки.Предупреждение);
		Если ДанныеПроверки.Свойство("ОткрытьЗакрытиеЗаказа") Тогда 
			форма = ПолучитьФорму("Обработка.ЗакрытиеСтарыхЗаказов.Форма.Форма");
			форма.объект.Контрагент = Объект.Контрагент;
			форма.Открыть();
		ИначеЕсли ДанныеПроверки.Свойство("Заказ") Тогда 
			ОткрытьЗначение(ДанныеПроверки.Заказ);
		КонецЕсли;	
		Модифицированность = Ложь;
		ПодключитьОбработчикОжидания("ЗакрытьФорму", 1, Истина);

	ИначеЕсли ДанныеПроверки.Свойство("Ошибка") Тогда 
		Предупреждение(ДанныеПроверки.Ошибка);
	Иначе
		ЗаписатьПриИзменении();
	КонецЕсли;

	
	//ЗаписатьПриИзменении(); //intrata_wald_02072021
	
КонецПроцедуры

&НаСервере
Процедура ЗаповнитиСпосібДоставки()
	Если ЗначениеЗаполнено(Объект.Контрагент) Тогда 
		//Объект.Доставка = Перечисления.НаявністьДоставки.Доставка;
		Если Объект.Контрагент.СпособДоставки = Справочники.СпособыДоставки.НайтиПоКоду("000000001") Тогда
			Объект.Доставка = Перечисления.НаявністьДоставки.Доставка;
		ИначеЕсли Объект.Контрагент.СпособДоставки = Справочники.СпособыДоставки.НайтиПоКоду("000000004") Тогда
			Объект.Доставка = Перечисления.НаявністьДоставки.Почта;
		ИначеЕсли Объект.Контрагент.СпособДоставки = Справочники.СпособыДоставки.НайтиПоКоду("000000005") Тогда
			Объект.Доставка = Перечисления.НаявністьДоставки.Самовывоз;
		//Иначе
		//	Объект.Доставка = "";
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура  ИнфоБорг()
	Клієнтський.ИнфоБорг(Объект,  Элементы.Борги);
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьФорму()
	Модифицированность = Ложь;
	//ЭтаФорма.Закрыть();
	Пока Открыта() Цикл 
		Закрыть();
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьТипЦенКонтрагента(Контрагент)
	Возврат Контрагент.ТипЦен;
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьСкладКонтрагента(Контрагент)
	з = Новый Запрос;
	з.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	          |	СкладыКонтрагентов.Ссылка КАК Склад
	          |ИЗ
	          |	Справочник.СкладыКонтрагентов КАК СкладыКонтрагентов
	          |ГДЕ
	          |	СкладыКонтрагентов.Контрагент = &Контрагент";
	з.УстановитьПараметр("Контрагент",Контрагент);
	Выборка = З.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Склад;
	Иначе 
		Возврат Справочники.СкладыКонтрагентов.ПустаяСсылка();
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура ПершаФормаПриИзменении(Элемент)
	Если НЕ Общий.Можно1Форму(Объект.Контрагент,Объект.СкладКонтрагента) Тогда 
		Сообщить("Не можна встановлювати 1 форму. Прострочена ліцензія!");
		Объект.ПершаФорма = Ложь;
	КонецЕсли;
	ИнфоБорг();	
КонецПроцедуры

&НаКлиенте
Процедура СкладКонтрагентаПриИзменении(Элемент)
	СкладКонтрагентаПриИзмененииНаСервере();
	Объект.ПершаФорма = Ложь;
КонецПроцедуры

&НаСервере
Процедура СкладКонтрагентаПриИзмененииНаСервере()
	Объект.ПершаФорма = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Список = ПроверитьРекомендации();	
	Если НЕ Список.Количество() = 0 Тогда
		Если Вопрос("Ви не додали всі рекомендовані позиції. Записати?",РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Нет Тогда
			Отказ = Истина;
			Возврат;
		КонецЕсли; 	
	КонецЕсли;
	Объект.Архив = Ложь; 
	
    //++
	ТаблицаТоваровДляНапоминания.Очистить();
	Для Каждого стрТовар Из Объект.Товары Цикл
		Если стрТовар.СоздатьНапоминаиние Тогда
			НоваяСтрока = ТаблицаТоваровДляНапоминания.Добавить();
			НоваяСтрока.Номенклатура = стрТовар.Номенклатура;
			НоваяСтрока.Количество = стрТовар.Количество;		
		КонецЕсли;		
	КонецЦикла;	
	//++
	
	
КонецПроцедуры

&НаСервере
Функция ПроверитьРекомендации() Экспорт 
	
	СписокРекомендаций = Новый СписокЗначений;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Номенклатура.Ссылка
	               |ИЗ
	               |	Справочник.Номенклатура КАК Номенклатура
	               |ГДЕ
	               |	Номенклатура.Рекомендация";
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Если Объект.Товары.НайтиСтроки(Новый Структура("Номенклатура",Выборка.Ссылка)).Количество() = 0 Тогда
			СписокРекомендаций.Добавить(Выборка.Ссылка);
		КонецЕсли;	
	КонецЦикла;
	
	Возврат СписокРекомендаций;
	
КонецФункции

&НаСервере
Процедура ТипЦенПриИзмененииНаСервере()
	
	Для Каждого Строка ИЗ Объект.Товары Цикл
		Строка.ЦенаПродажиВес = Общий.ПолучитьЦенуНоменклатуры(Строка.Номенклатура,Строка.ХарактеристикаНоменклатуры,Объект.ТипЦен);
		Вес = Строка.ХарактеристикаНоменклатуры.Вага;
		Если Вес = 0 Тогда 
			Попытка
				Вес = Число(Строка(Строка.ХарактеристикаНоменклатуры));
			Исключение
				Вес = 20;
			КонецПопытки;
		КонецЕсли;
	
		Строка.Цена = Строка.ЦенаПродажиВес * Вес;
		Строка.Сума = Строка.Цена * Строка.Количество;
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ТипЦенПриИзменении(Элемент)
	ТипЦенПриИзмененииНаСервере();
	ЗаписатьПриИзменении(); //intrata_wald_02072021
	ПересчитатьИтогЕвро(); //intrata_wald_02072021
КонецПроцедуры

&НаСервере
Процедура ТоварыПриИзмененииНаСервере()
	ПересчитатьСуммы();

КонецПроцедуры

&НаСервере
Процедура ПересчитатьСуммы()
	Для Каждого Строка ИЗ Объект.Товары Цикл
		Вес = Строка.ХарактеристикаНоменклатуры.Вага;
		Если Вес = 0 Тогда 
			Попытка

				Вес = Число(Строка(Строка.ХарактеристикаНоменклатуры));
			Исключение
				Вес = 20;
			КонецПопытки;
		КонецЕсли;
	
		Строка.Цена = Строка.ЦенаПродажиВес * Вес;
		Строка.Сума = Строка.Цена * Строка.Количество;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПриИзменении(Элемент)
    //++
	ТаблицаТоваровДляНапоминания.Очистить();
	Для Каждого стрТовар Из Объект.Товары Цикл
		Если стрТовар.СоздатьНапоминаиние Тогда
			НоваяСтрока = ТаблицаТоваровДляНапоминания.Добавить();
			НоваяСтрока.Номенклатура = стрТовар.Номенклатура;
			НоваяСтрока.Количество = стрТовар.Количество;		
		КонецЕсли;		
	КонецЦикла;	
	//++
	
	ТоварыПриИзмененииНаСервере();
	ЗаписатьПриИзменении(); //intrata_wald_02072021
	ПересчитатьИтогЕвро(); //intrata_wald_02072021 
	
	
	//++
	Для Каждого стрТоварТемп Из ТаблицаТоваровДляНапоминания Цикл
		Для Каждого стрТовар Из Объект.Товары Цикл    
			Если стрТоварТемп.Номенклатура = стрТовар.Номенклатура Тогда
				стрТовар.СоздатьНапоминаиние = Истина;
			КонецЕсли;		
		КонецЦикла;	
	КонецЦикла;	
	//++   
	
КонецПроцедуры

&НаСервере
Процедура ПересчитатьИтогЕвро() //intrata_wald_02072021
	
	ИтогСуммаЕвро = Объект.Товары.Итог("Сума")* КурсЕвро;
	
КонецПроцедуры

&НаСервере
Процедура ПолучитьКурсЕвро()
	
	//Попытка
	//	Прокси = СоединениеСБазой.ПолучитьПрокси();
	//	СисИнфо = Новый СистемнаяИнформация;
	//	КодМобильногоКомпьютера = Строка(СисИнфо.ИдентификаторКлиента);
	//	ПарольВхода = СокрЛП(Константы.ПарольВхода.Получить());
	//	КурсЕвро = Прокси.ПолучитьКурсЕвроНаДату(ПарольВхода, Новый ХранилищеЗначения(Объект.Дата)).Курс;
	//	Элементы.ТоварыИтогСумаЕвро.Видимость = Истина;
	//Исключение
	//	КурсЕвро = 0;
	//	Элементы.ТоварыИтогСумаЕвро.Видимость = Ложь;
	//КонецПопытки;
	КурсЕвро = Константы.КурсEUR.Получить();
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	ПересчитатьСуммы();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Не ЗначениеЗаполнено(Объект.ТипЦен) Тогда 
		з = Новый Запрос;
		з.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
		          |	ТипыЦенНоменклатуры.Ссылка КАК Ссылка
		          |ИЗ
		          |	Справочник.ТипыЦенНоменклатуры КАК ТипыЦенНоменклатуры";
		Выборка = з.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда 
			Объект.ТипЦен = Выборка.Ссылка;
		КонецЕсли;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Объект.Доставка) Тогда 
		Объект.Доставка = Перечисления.НаявністьДоставки.Доставка;
	КонецЕсли;
	
	Если Параметры.Свойство("МаршрутныйЛист") Тогда
		Объект.МаршрутныйЛист 	= Параметры.МаршрутныйЛист;
	КонецЕсли;		
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура КонтрагентАвтоПодборНаСервере(Текст, ДанныеВыбора)
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Контрагенты.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Контрагенты КАК Контрагенты
		|ГДЕ
		|	Контрагенты.Наименование ПОДОБНО &Текст
		|	Или Контрагенты.НомерТелефона ПОДОБНО &Текст";
	
	Запрос.УстановитьПараметр("Текст", "%"+ Текст + "%");
		
	Выборка = Запрос.Выполнить().Выгрузить();
	ДанныеВыбора = Новый СписокЗначений;
	ДанныеВыбора.ЗагрузитьЗначения(Выборка.ВыгрузитьКолонку("Ссылка"));
КонецПроцедуры

&НаКлиенте

Процедура КонтрагентАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	//КонтрагентАвтоПодборНаСервере(Текст, ДанныеВыбора);
	
	//ПараметрыПолученияДанных.СпособПоискаСтроки =  СпособПоискаСтрокиПриВводеПоСтроке.ЛюбаяЧасть;
	//ПараметрыПолученияДанных.ПолнотекстовыйПоиск = ПолнотекстовыйПоискПриВводеПоСтроке.Использовать;
	ДанныеВыбора = Новый СписокЗначений;
	Для Каждого Элемент Из СписокКлиентов Цикл 
		Если СтрНайти(НРег(Элемент.Значение), НРег(Текст)) Тогда 
			ДанныеВыбора.Добавить(Элемент.Значение, Элемент.Представление);
		КонецЕсли;
		
	КонецЦикла;
	

КонецПроцедуры

&НаСервере
Процедура ЗаписатьПриИзменении() //intrata_wald_02072021
	
	Если НЕ Объект.Ссылка.Пустая() Тогда
		Записать();
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент) //intrata_wald_02072021
	ЗаписатьПриИзменении(); //intrata_wald_02072021
	ПолучитьКурсЕвро();
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентОбластьПриИзменении(Элемент)
	ЗаписатьПриИзменении(); //intrata_wald_02072021
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентГородПриИзменении(Элемент)
	ЗаписатьПриИзменении(); //intrata_wald_02072021
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентНомерТелефонаПриИзменении(Элемент)
	ЗаписатьПриИзменении(); //intrata_wald_02072021
КонецПроцедуры

&НаКлиенте
Процедура ДоставкаПриИзменении(Элемент)
	ЗаписатьПриИзменении(); //intrata_wald_02072021
КонецПроцедуры

&НаКлиенте
Процедура СтатусОплатиПриИзменении(Элемент)
	ЗаписатьПриИзменении(); //intrata_wald_02072021
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьШКБыстроПриИзменении(Элемент)
	ЗаписатьПриИзменении(); //intrata_wald_02072021
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	//Если ВладелецФормы <> Неопределено И ВладелецФормы.Имя = "ЗаказыЗаказПокупателя" Тогда 
	//	ВладелецФормы.Родитель.ТекущиеДанные.ЗаказПокупателя = Объект.Ссылка;
	//КонецЕсли;
	
	//++	
	Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение И Объект.Проведен  И Не мОбработкаНапоминанияУжеОтрывалась Тогда
		Если ТаблицаТоваровДляНапоминания.Количество() > 0 Тогда
			форма = ПолучитьФорму("Обработка.Нагадування.Форма.Форма");
			форма.Контрагент = Объект.Контрагент;
			
			Для Каждого стрТовар Из ТаблицаТоваровДляНапоминания Цикл
				НоваяСтрока = форма.Товары.Добавить();
				НоваяСтрока.Товар = стрТовар.Номенклатура;
				НоваяСтрока.Кількість = стрТовар.Количество;
			КонецЦикла;	

			форма.Открыть();
			форма.Элементы.ОсновнаяПанель.ТекущаяСтраница = форма.Элементы.НапоминаниеОТоваре;	
			//форма.ТипНапоминания = "Нагадати про товар";
			форма.ТипНапоминания = форма.Элементы.ТипНапоминания.СписокВыбора[1].Значение; 
			форма.ИзЗаказа = Истина;
			мОбработкаНапоминанияУжеОтрывалась = Истина;
		КонецЕсли;	
	КонецЕсли;
	//++

КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	ОповеститьОВыборе(Объект.Ссылка);
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если НЕ мЗакрытиеСПараметром Тогда 
		Отказ = Истина;
		СтандартнаяОбработка = Ложь;
		мЗакрытиеСПараметром = Истина;
		Закрыть(Объект.Ссылка);
		Возврат;
	КонецЕсли;
	Если Отказ Тогда 
		мЗакрытиеСПараметром = Ложь;
	Иначе 
		Если Объект.Товары.Количество() И Объект.Проведен Тогда 
			Записать();
		КонецЕсли;
	КонецЕсли;	
	

КонецПроцедуры

&НаСервере
Функция ПолучитьКонтрагентаПоЗначению()
	СЗ = Новый СписокЗначений;	
	//Элементы.Контрагент.СписокВыбора.Очистить();
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Контрагенты.Ссылка КАК Ссылка,
		|	Контрагенты.Город КАК Город,
		|	Контрагенты.Наименование КАК Наименование
		|ИЗ
		|	Справочник.Контрагенты КАК Контрагенты";
	
	ВыборкаДетальныеЗаписи = Запрос.Выполнить().Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СЗ.Добавить(ВыборкаДетальныеЗаписи.Ссылка, ВыборкаДетальныеЗаписи.Наименование + " (" + ВыборкаДетальныеЗаписи.Город + ")");
		//Элементы.Контрагент.СписокВыбора.Добавить(ВыборкаДетальныеЗаписи.Ссылка, ВыборкаДетальныеЗаписи.Наименование + " (" + ВыборкаДетальныеЗаписи.Город + ")");

	КонецЦикла;
	
	Возврат СЗ;
КонецФункции


&НаКлиенте
Процедура ТоварыСоздатьНапоминаиниеПриИзменении(Элемент)
	// Вставити вміст обробника.
КонецПроцедуры


СписокКлиентов = ПолучитьКонтрагентаПоЗначению();

мОбработкаНапоминанияУжеОтрывалась = Ложь;



