Перем мЭтоОбмен Экспорт;

Процедура ПриЗаписи(Отказ)
	Если НЕ Проведен Тогда          //  ИЛИ Архив
		Возврат;
	КонецЕсли;
	
	// Перевірим обратні ссилки якщо документи створювались з нового маршрутника
	Для Каждого Стр Из Оплаты Цикл
		Если НЕ ЗначениеЗаполнено(Стр.Оплата.МаршрутныйЛист) И ЗначениеЗаполнено(Стр.Оплата) Тогда 
			Попытка
				ДокОб = Стр.Оплата.ПолучитьОбъект();
				ДокОб.МаршрутныйЛист = Ссылка;
				ДокОб.Записать();
			Исключение
			КонецПопытки;
		КонецЕсли;	
	КонецЦикла;
	Для Каждого Стр Из Заказы Цикл
		Если НЕ ЗначениеЗаполнено(Стр.ЗаказПокупателя.МаршрутныйЛист) И ЗначениеЗаполнено(Стр.ЗаказПокупателя) Тогда 
			Попытка
				ДокОб = Стр.ЗаказПокупателя.ПолучитьОбъект();
				ДокОб.МаршрутныйЛист = Ссылка;
				ДокОб.Записать();
			Исключение
			КонецПопытки;
		КонецЕсли;	
	КонецЦикла;
	Для Каждого Стр Из Реализации Цикл
		Если НЕ ЗначениеЗаполнено(Стр.Реализация.МаршрутныйЛист) И ЗначениеЗаполнено(Стр.Реализация) Тогда 
			Попытка
				ДокОб = Стр.Реализация.ПолучитьОбъект();
				ДокОб.МаршрутныйЛист = Ссылка;
				ДокОб.Записать();
			Исключение
			КонецПопытки;
		КонецЕсли;	
	КонецЦикла;


	
	
	Если мЭтоОбмен <> Истина Тогда 
		Общий.ЗарегистрироватьИзменения(ЭтотОбъект.Ссылка);
		Для Каждого СтрТЧ Из Заказы Цикл 
			Общий.ЗарегистрироватьИзменения(СтрТЧ.ЗаказПокупателя);	
		КонецЦикла;	
		Для Каждого СтрТЧ Из Реализации Цикл 
			Общий.ЗарегистрироватьИзменения(СтрТЧ.Реализация);	
		КонецЦикла;			
		Для Каждого СтрТЧ Из Оплаты Цикл 
			Общий.ЗарегистрироватьИзменения(СтрТЧ.Оплата);	
		КонецЦикла;					
	КонецЕсли;	 
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	//контроль продаж
	Для Каждого Строка Из Продажи Цикл
		СтрокиНайденные = Строка.Реализация.Товары.НайтиСтроки(Новый Структура("Номенклатура, ХарактеристикаНоменклатуры, ЦенаПродажиВес", Строка.Номенклатура, Строка.ХарактеристикаНоменклатуры, Строка.ЦенаПродажиВес));
		Если НЕ СтрокиНайденные.Количество() Тогда 
			Продолжить;
		КонецЕсли;
		Строка.Цена = СтрокиНайденные[0].Цена;
		Строка.Сумма = СтрокиНайденные[0].Сума; 
	КонецЦикла;
	
	Для Каждого Строка Из Реализации Цикл
		Строка.Сумма = Строка.Реализация.Сума;
	КонецЦикла;
	
	Попытка
		МассивНаУдаление = Новый Массив;
		Если Не ЭтоНовый() Тогда
			Для Каждого стрЗаказСсылка Из Ссылка.Заказы Цикл
				Нашли = Ложь;
				Для Каждого стрЗаказ Из Заказы Цикл
					Если стрЗаказСсылка.ЗаказПокупателя = стрЗаказ.ЗаказПокупателя Тогда
						Нашли = Истина;
					КонецЕсли;				
				КонецЦикла;   
				Если Не Нашли Тогда
					МассивНаУдаление.Добавить(стрЗаказСсылка.ЗаказПокупателя)
				КонецЕсли;	
			КонецЦикла;	  	
		КонецЕсли;	      
		
		Для Каждого стрЗаказ Из МассивНаУдаление Цикл
			ЗаказОбъект = стрЗаказ.ПолучитьОбъект();
			ЗаказОбъект.МаршрутныйЛист = Документы.МаршрутныйЛист.ПустаяСсылка();
			ЗаказОбъект.Записать();
		КонецЦикла;	
		
	Исключение
	КонецПопытки;
КонецПроцедуры


мЭтоОбмен = Ложь;