
&НаСервере
Процедура ЗабронюватиНаСервере(ошибка)
	
	Прокси = СоединениеСБазой.ПолучитьПрокси();
	Пароль = Константы.ПарольВхода.Получить();
	Данные = Новый Структура;
	Данные.Вставить("Команда", "УстановитьБронь");
	Данные.Вставить("Характеристика", Вага.УникальныйИдентификатор());
	Данные.Вставить("ПериодБрони", КонецДня(ПериодБрони));
	Данные.Вставить("Контрагент", НаКого.УникальныйИдентификатор());
	Ответ = Прокси.ЗабронюватиНоменклатуру(Пароль, Обмен_УправлениеОбменом.Сериализовать(Данные));
	Ответ = Ответ.Получить();
	
	Если Ответ.Успешно Тогда 
		ВагаОбъект = Вага.ПолучитьОбъект();
		ВагаОбъект.Бронь = Ответ.Бронь;
		ВагаОбъект.ПериодБрони = ПериодБрони;
		ВагаОбъект.МояБронь = Истина;
		ВагаОбъект.Записать(); 
		
		НагадуванняТекст = "Встановлення броні" + Символы.ПС + Символы.ВК + Символы.ПС + Символы.ВК;
		НагадуванняТекст = НагадуванняТекст + Строка(Номенклатура) + "  вага " + Строка(Вага) + " кг   період " + Формат(ПериодБрони, "ДФ=dd.MM.yyyy");
		
		Менеджер = РегистрыСведений.РаботаСКлиентом.СоздатьМенеджерЗаписи();
		Менеджер.Период = ТекущаяДата();
		Менеджер.Клиент = НаКого;
		Менеджер.Запись = НагадуванняТекст;
		Менеджер.УИД_Записи = Новый УникальныйИдентификатор;
		Менеджер.АвтоматичнийЗаписБезВзаємодіїЗКлієнтом = Истина;
		Менеджер.Записать();		
		Общий.ОбновитьПоследнююРаботуСКлиентом(НаКого);
	Иначе
		ошибка = Ответ.Ошибка;
	КонецЕсли; 	
	
КонецПроцедуры

&НаКлиенте
Процедура Забронювати(Команда)
	Отказ = Ложь;
	Если Не ЗначениеЗаполнено(НаКого) Тогда 
		Сообщить("Виберіть контрагента на якого потрбіно забронювати мішок!");
		Отказ = Истина;
	КонецЕсли;
	
	Если  ТекущаяДата() > ПериодБрони Тогда 
		Сообщить("Виберіть дату до якої буде дійсна бронь!");
		Отказ = Истина;
	КонецЕсли;
	
	Если Отказ Тогда 
		Возврат;
	КонецЕсли;
	мОшибка = "";
	Попытка
		ЗабронюватиНаСервере(мОшибка);
	Исключение
		мОшибка = ОписаниеОшибки();
	КонецПопытки;
	
	Если Не ПустаяСтрока(мОшибка) Тогда 
		Предупреждение(мОшибка);
	КонецЕсли;
	
	Оповестить("Установка брони");
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура НаКогоПриИзменении(Элемент)
	Элементы.Забронювати.Доступность = ЗначениеЗаполнено(НаКого) И  Не ТекущаяДата() > КонецДня(ПериодБрони);
КонецПроцедуры
