
&НаСервере
Процедура СумаUAHПриИзмененииНаСервере()
	
	Объект.СуммаДокумента 	 	= Объект.СумаEUR + (Объект.СумаUAH / Объект.КурсEUR) + (Объект.СумаUAH_Безнал / Объект.КурсEUR) + (Объект.СумаUSD *  Объект.КурсUSD / Объект.КурсEUR);
	СуммаРеализации 		 	= Объект.Основание.Сума;
	РекомендованоДоСплатиEUR 	= СуммаРеализации - (ОплаченаСума + Объект.СуммаДокумента);
	РекомендованоДоСплатиUAH 	= РекомендованоДоСплатиEUR * Объект.КурсEUR;
	РекомендованоДоСплатиUSD 	= РекомендованоДоСплатиUAH / Объект.КурсUSD;

КонецПроцедуры

&НаКлиенте
Процедура СумаПриИзменении(Элемент)
	
	СумаUAHПриИзмененииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	//мКурсEUR = 0;
	//мКурсUSD = 0;
	//Если ЗначениеЗаполнено(Объект.Основание) Тогда 
	//	мКурсEUR = ПолучитьКурсВалютыОснования(Объект.Основание, "КурсEUR");
	//	мКурсUSD = ПолучитьКурсВалютыОснования(Объект.Основание, "КурсUSD");
	//КонецЕсли;
	//Если мКурсEUR = 0 Тогда
	//	мКурсEUR = ПолучитьКурсВалюты("КурсEUR");
	//КонецЕсли;
	//
	//Если мКурсUSD = 0 Тогда
	//	мКурсUSD = ПолучитьКурсВалюты("КурсUSD");
	//КонецЕсли;
	
	ЭтаФорма.ТолькоПросмотр = Объект.Архив;
	Если ЗначениеЗаполнено(Объект.Основание) Тогда 
		Элементы.Контрагент.ТолькоПросмотр = Истина;
		РекомендацииПоОплате();
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьКурсВалюты(ИмяВалюты)
	
	Возврат Константы[ИмяВалюты].Получить();
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьКурсВалютыОснования(Основание, ИмяВалюты)
	
	Возврат Основание[ИмяВалюты];
	
КонецФункции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(Объект.Основание)  Тогда
		Если НЕ ЗначениеЗаполнено(Объект.КурсEUR) Тогда 
			Объект.КурсEUR = Константы.КурсEUR.Получить();
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(Объект.КурсUSD) Тогда
			Объект.КурсUSD = Константы.КурсUSD.Получить();
		КонецЕсли;
		
		Если Не (ЗначениеЗаполнено(Объект.КурсEUR) 
			И ЗначениеЗаполнено(Объект.КурсUSD)) Тогда  
			Сообщить("Виконайте обмін, не заповнені курси валют");
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;

	Если Параметры.Свойство("МаршрутныйЛист") Тогда
		Объект.Основание 		= Параметры.Основание;
		Объект.Контрагент 		= Параметры.Контрагент;
		Объект.МаршрутныйЛист 	= Параметры.МаршрутныйЛист;
		Объект.ЗаказПокупателя 	= Параметры.ЗаказПокупателя;
	КонецЕсли;	
	
	Если Объект.ВидДвиженияДенежныхСредств = Перечисления.ВидДвиженияДенежныхСредств.Приход Тогда
		Элементы.СтатьяДвиженияДенежныхСредств.Видимость = Ложь;
		Элементы.Контрагент.Видимость = Истина; 
	Иначе	
		Элементы.СтатьяДвиженияДенежныхСредств.Видимость = Истина;
		Элементы.Контрагент.Видимость = Ложь; 
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Процедура РекомендацииПоОплате()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЕСТЬNULL(ВложенныйЗапрос.СуммаОборот, 0) КАК СуммаОборот
		|ИЗ
		|	(ВЫБРАТЬ
		|		СУММА(ДенежныеСредстваОбороты.СуммаОборот) КАК СуммаОборот
		|	ИЗ
		|		Документ.КассовыйОрдер КАК КассовыйОрдер
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ДенежныеСредства.Обороты(, , Регистратор, ) КАК ДенежныеСредстваОбороты
		|			ПО КассовыйОрдер.Ссылка = ДенежныеСредстваОбороты.Регистратор
		|	ГДЕ
		|		КассовыйОрдер.Основание = &Основание
		|		И КассовыйОрдер.Ссылка <> &Ссылка) КАК ВложенныйЗапрос";
	
	Запрос.УстановитьПараметр("Основание", Объект.Основание);
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);

	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда 	
		ОплаченаСума = Выборка.СуммаОборот;
	КонецЕсли;	
	
	СумаUAHПриИзмененииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Если ВладелецФормы = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	Попытка
		Если ВладелецФормы.Имя = "ОплатыОплата" Тогда 
			ВладелецФормы.Родитель.ТекущиеДанные.Оплата 			= Объект.Ссылка;
			ВладелецФормы.Родитель.ТекущиеДанные.Сумма 				= Объект.СуммаДокумента;
		ИначеЕсли ВладелецФормы.Имя = "ОплатыСумма" Тогда 	
			ВладелецФормы.Родитель.ТекущиеДанные.Сумма 				= Объект.СуммаДокумента;
		КонецЕсли;	
	Исключение
	КонецПопытки;
	
КонецПроцедуры

&НаСервере
Функция  ТелефонКонтрагента() 
	СЗ = Новый СписокЗначений();
	НомерТелефона = Объект.Контрагент.НомерТелефона;
	Если Не ПустаяСтрока(НомерТелефона) Тогда 
		Для Н=1 по СтрЧислоСтрок(НомерТелефона) Цикл
			СЗ.Добавить(СтрПолучитьСтроку(НомерТелефона, Н));
		КонецЦикла;
	КонецЕсли;
	
	Возврат СЗ;	
КонецФункции 

#Если МобильноеПриложениеКлиент Тогда
	
	&НаКлиенте
	Процедура ВідправитиКонтрагенту(Команда)
		Если ЗначениеЗаполнено(Объект.Основание) И ТипЗнч(Объект.Основание) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда 
			мОбъект = Объект.Основание;
		ИначеЕсли ЗначениеЗаполнено(Объект.СдачаДокумента) Тогда  
			мОбъект = Объект.СдачаДокумента;
		Иначе 
			мОбъект = Объект;
		КонецЕсли;

		НомераТелефонов = ТелефонКонтрагента();
		Если НомераТелефонов.Количество() > 1 Тогда 
			ВыбрЗнач = НомераТелефонов.ВыбратьЭлемент("Номер телефона клієнта");
			Если ВыбрЗнач = Неопределено Тогда 
				Возврат;
			КонецЕсли;
			Телефон = ВыбрЗнач.Значение;
		ИначеЕсли  НомераТелефонов.Количество() = 1 Тогда 
			Телефон = НомераТелефонов[0].Значение;
		КонецЕсли;

		
		НовВз = Новый ЗапускПриложенияМобильногоУстройства();
		
		НовВз.Действие = "android.intent.action.SEND";
		НовВз.Приложение = "com.viber.voip"; 
		НовВз.ИмяКласса = "com.viber.voip.WelcomeShareActivity"; 
		НовВз.Тип = "text/plain";
		НовВз.ДополнительныеДанные.Добавить("android.intent.extra.TEXT", Общий.ПолучитьТекстСообщенияВайбер(мОбъект, Истина, Телефон));
		
		НовВз.Запустить(Истина);
		
		
	КонецПроцедуры
	
	&НаКлиенте
	Процедура ВідправитиВГрупу(Команда)
			Если ЗначениеЗаполнено(Объект.Основание) И ТипЗнч(Объект.Основание) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда 
			мОбъект = Объект.Основание;
		ИначеЕсли ЗначениеЗаполнено(Объект.СдачаДокумента)  Тогда
			мОбъект = Объект.СдачаДокумента;
		Иначе 
			мОбъект = Объект;
		КонецЕсли;

		
		НомераТелефонов = ТелефонКонтрагента();
		Если НомераТелефонов.Количество() > 1 Тогда 
			ВыбрЗнач = НомераТелефонов.ВыбратьЭлемент("Номер телефона клієнта");
			Если ВыбрЗнач = Неопределено Тогда 
				Возврат;
			КонецЕсли;
			Телефон = ВыбрЗнач.Значение;
		ИначеЕсли  НомераТелефонов.Количество() = 1 Тогда 
			Телефон = НомераТелефонов[0].Значение;
		КонецЕсли;
		
		НовВз = Новый ЗапускПриложенияМобильногоУстройства();
		
		НовВз.Действие = "android.intent.action.SEND";
		НовВз.Приложение = "com.viber.voip"; 
		НовВз.ИмяКласса = "com.viber.voip.WelcomeShareActivity"; 
		НовВз.Тип = "text/plain";
		НовВз.ДополнительныеДанные.Добавить("android.intent.extra.TEXT", Общий.ПолучитьТекстСообщенияВайбер(мОбъект, Ложь, Телефон));
		
		НовВз.Запустить(Истина);
		
		//НовВз.ДополнительныеДанныеЦикл
		//Объект.ВідправленоВВайбер = Истина;
		//Объект.ВивантажуватиВ1С = Истина;
		//Элементы.ВивантажуватиВ1С.Доступность = Истина;
		
	КонецПроцедуры
	
#Иначе
	&НаКлиенте
	Процедура ВідправитиКонтрагенту(Команда)
			Если ЗначениеЗаполнено(Объект.Основание) И ТипЗнч(Объект.Основание) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда 
			мОбъект = Объект.Основание;
		ИначеЕсли ЗначениеЗаполнено(Объект.СдачаДокумента) Тогда 
			мОбъект = Объект.СдачаДокумента;
		Иначе 
			мОбъект = Объект;
		КонецЕсли;

		НомераТелефонов = ТелефонКонтрагента();
		Если НомераТелефонов.Количество() > 1 Тогда 
			ВыбрЗнач = НомераТелефонов.ВыбратьЭлемент("Номер телефона клієнта");
			Если ВыбрЗнач = Неопределено Тогда 
				Возврат;
			КонецЕсли;
			Телефон = ВыбрЗнач.Значение;
		ИначеЕсли  НомераТелефонов.Количество() = 1 Тогда 
			Телефон = НомераТелефонов[0].Значение;
		КонецЕсли;


		Сообщить(Общий.ПолучитьТекстСообщенияВайбер(мОбъект, Истина, Телефон));
		
		
	КонецПроцедуры
	
	&НаКлиенте
	Процедура ВідправитиВГрупу(Команда)
			Если ЗначениеЗаполнено(Объект.Основание) И ТипЗнч(Объект.Основание) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда 
			мОбъект = Объект.Основание;
		ИначеЕсли ЗначениеЗаполнено(Объект.СдачаДокумента) Тогда 
			мОбъект = Объект.СдачаДокумента;
		Иначе 
			мОбъект = Объект;
		КонецЕсли;


		НомераТелефонов = ТелефонКонтрагента();
		
		Если НомераТелефонов.Количество() > 1 Тогда 
			ВыбрЗнач = НомераТелефонов.ВыбратьЭлемент("Номер телефона клієнта");
			Если ВыбрЗнач = Неопределено Тогда 
				Возврат;
			КонецЕсли;
			Телефон = ВыбрЗнач.Значение;
		ИначеЕсли  НомераТелефонов.Количество() = 1 Тогда 
			Телефон = НомераТелефонов[0].Значение;
		КонецЕсли;
		
		Сообщить( Общий.ПолучитьТекстСообщенияВайбер(мОбъект, Ложь, Телефон));
		
	КонецПроцедуры
	
#КонецЕсли

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	Клієнтський.ИнфоБорг(Объект,  Элементы.Борги);
	КонтрагентПриИзмененииНаСервере();
	СумаUAHПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура КонтрагентПриИзмененииНаСервере()
	Объект.СумаEUR = Объект.Контрагент.Борг;
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьУЧат(Команда)
	
	Если ЗначениеЗаполнено(Объект.Основание) И ТипЗнч(Объект.Основание) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда 
		мОбъект = Объект.Основание;
	ИначеЕсли ЗначениеЗаполнено(Объект.СдачаДокумента)  Тогда
		мОбъект = Объект.СдачаДокумента;
	Иначе 
		мОбъект = Объект;
	КонецЕсли;
	
	
	Записать(); 	
	сз_Чаты = ПолучитьАктуалныеЧаты();
	Чат = сз_Чаты.ВыбратьЭлемент("Відправити у чат");
	Если Чат = Неопределено Тогда 
		Возврат;
	КонецЕсли;

	НомераТелефонов = ТелефонКонтрагента();
	Если НомераТелефонов.Количество() > 1 Тогда 
		ВыбрЗнач = НомераТелефонов.ВыбратьЭлемент("Номер телефона клієнта");
		Если ВыбрЗнач = Неопределено Тогда 
			Возврат;
		КонецЕсли;
		Телефон = ВыбрЗнач.Значение;
	ИначеЕсли  НомераТелефонов.Количество() = 1 Тогда 
		Телефон = НомераТелефонов[0].Значение;
	КонецЕсли;

	
	ОтправитьУЧатНаСервере(Чат.Значение, Телефон, мОбъект);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция  ПолучитьАктуалныеЧаты();
	сз_Чаты = Новый СписокЗначений;
	Чаты = Справочники.ГруппыЧата.Выбрать();
	Пока  Чаты.Следующий() Цикл 
		Если Чаты.ПометкаУдаления Тогда 
			Продолжить;
		КонецЕсли;
		
		сз_Чаты.Добавить(Чаты.Ссылка);
	КонецЦикла;
	Возврат сз_Чаты;
КонецФункции

&НаСервере

Процедура ОтправитьУЧатНаСервере(Чат, Телефон, мОбъект)
	
	Текст = Общий.ПолучитьТекстСообщенияВайбер(мОбъект, Ложь, Телефон);
	
	Менеджер = РегистрыСведений.ИсходящиеСообщения.СоздатьМенеджерЗаписи();
	Менеджер.Получатель = Чат; 
	Менеджер.Дата = ТекущаяДата();
	Менеджер.Уид_Сообщения = Новый УникальныйИдентификатор();
	Менеджер.Повідомлення = Текст;
	Менеджер.Записать();

КонецПроцедуры


&НаКлиенте
Процедура КонтрагентАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ДанныеВыбора = ПолучитьКонтрагентаПоЗначению(Текст)
КонецПроцедуры

&НаСервере
Функция ПолучитьКонтрагентаПоЗначению(Значение)
	СЗ = Новый СписокЗначений;	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Контрагенты.Ссылка КАК Ссылка,
		|	Контрагенты.Город КАК Город,
		|	Контрагенты.Наименование КАК Наименование
		|ИЗ
		|	Справочник.Контрагенты КАК Контрагенты
		|ГДЕ
		|	Контрагенты.Наименование ПОДОБНО &Наименование";
	
	Запрос.УстановитьПараметр("Наименование", "%" + Значение + "%");
	
	ВыборкаДетальныеЗаписи = Запрос.Выполнить().Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СЗ.Добавить(ВыборкаДетальныеЗаписи.Ссылка, ВыборкаДетальныеЗаписи.Наименование + " (" + ВыборкаДетальныеЗаписи.Город + ")");
	КонецЦикла;
	
	Возврат СЗ;
КонецФункции


