&НаКлиенте
Перем мОтбор;

&НаКлиенте
Процедура БроньПриИзменении(Элемент)
	Если Не отборБронь Тогда 
		мОтбор[2].Использование =  Ложь;
		мОтбор[3].Использование =  Ложь;
	ИначеЕсли Бронь = 1 Тогда	
		мОтбор[2].Использование =  Истина;
		мОтбор[2].ВидСравнения = ВидСравненияКомпоновкиДанных.БольшеИлиРавно;
		мОтбор[3].Использование =  Истина;
		
	ИначеЕсли Бронь = 2 Тогда
		мОтбор[2].Использование =  Истина;
		мОтбор[2].ВидСравнения = ВидСравненияКомпоновкиДанных.БольшеИлиРавно;
		мОтбор[3].Использование =  Ложь;
		
		
	ИначеЕсли Бронь = 3 Тогда
		мОтбор[2].Использование =  Истина;
		мОтбор[2].ВидСравнения = ВидСравненияКомпоновкиДанных.Меньше;
		мОтбор[3].Использование =  Истина;
		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура отборБроньПриИзменении(Элемент)
	Элементы.ГруппаБронь.Видимость = отборБронь;
	БроньПриИзменении(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	отборБронь = Истина;
	Бронь = 1;
	отборБроньПриИзменении(Элементы.отборБронь);
//	Список.КомпоновщикНастроек.Настройки.Структура
//Список.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы[2].Структура[0].Состояние = СостояниеЭлементаНастройкиКомпоновкиДанных.Включен;
КонецПроцедуры

&НаКлиенте
Процедура отборЦелевыйПриИзменении(Элемент)
	мОтбор[1].Использование = отборЦелевый;
	
КонецПроцедуры

&НаКлиенте
Процедура отборВидеоПриИзменении(Элемент)
	мОтбор[0].Использование = отборВидео;

КонецПроцедуры

&НаКлиенте
Процедура отборНаявніПриИзменении(Элемент)
	мОтбор[4].Использование = отборНаявні;

КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если ТипЗнч(ВыбраннаяСтрока) = Тип("СправочникСсылка.ХарактеристикиНоменклатуры") Тогда 
		СтандартнаяОбработка = Ложь;
		ОткрытьЗначение(ВыбраннаяСтрока);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Групування(Команда)
	
	//СтрДоб = Список.Группировка.Элементы.Добавить(Тип("ПолеГруппировкиКомпоновкиДанных"));
	//СтрДоб.Поле = Новый ПолеКомпоновкиДанных("Артикул");
	//СтрДоб.ТипГруппировки = ТипГруппировкиКомпоновкиДанных.Элементы;
	
	//Список.КомпоновщикНастроек.Настройки.Структура[0].Использование = НЕ Список.КомпоновщикНастроек.Настройки.Структура[0].Использование;
	//Состояние = Список.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы[2].Структура[0].Состояние;
	//Состояние = ?(Состояние = СостояниеЭлементаНастройкиКомпоновкиДанных.Включен, СостояниеЭлементаНастройкиКомпоновкиДанных.Отключен, СостояниеЭлементаНастройкиКомпоновкиДанных.Включен)
	КонецПроцедуры

мОтбор = Список.КомпоновщикНастроек.Настройки.Отбор.Элементы;