

#Область Процедуры_И_Функции_Приложения

//////////// подключаем фоновое задание ////////////////////////////////////////
Процедура ВыполнитьОбменСообщениями()Экспорт
	
	//Если НЕ ИдетОбмен() Тогда
	//	Идентификатор = ViberОбновлениеСервер.ВыполнитьОбменДаннымиВФоне();
	//	ТекстОшибки = "";
	//	Если ViberОбновлениеСервер.ОбменДаннымиЗакончен(Идентификатор, ТекстОшибки) Тогда
	//		Если ТекстОшибки <> "" Тогда
	//			Сообщить(ТекстОшибки);
	//		КонецЕсли;
	//	Иначе
	//		ИдентификаторФоновогоЗадания = Идентификатор;
	//    КонецЕсли;
	//КонецЕсли;
	ViberОбновлениеСервер.ВыполнитьЗагрузкуНовыхСообщений();
	
КонецПроцедуры

//////////// проверяем не идет ли шяс обновление ///////////////////////////////
Функция ИдетОбмен() Экспорт
	
	ТекстОшибки = "";
	Возврат ИдентификаторФоновогоЗадания <> Неопределено
		И НЕ ViberОбновлениеСервер.ОбменДаннымиЗакончен(ИдентификаторФоновогоЗадания, ТекстОшибки);
		
КонецФункции

///////////формируем запись новых сообщений ///////////////////////////////////
Процедура ПолучитьСписокНовыхОповещений()Экспорт
	
	//////// получаем список новых сообщений //////////////////
	Ответ = ViberОбновлениеСервер.ОбновитьСписокИсторииСообщений();
	Если Ответ <> Неопределено Тогда
		Если Ответ.Свойство("МассивСообщений") Тогда
			ViberОбновлениеСервер.ЗаписатьИсториюСообщенийВайбер(Ответ.МассивСообщений);		
		КонецЕсли;
		
		Если Ответ.Свойство("Шаблоны") Тогда
			ViberОбновлениеСервер.ОбновитьШаблоныВайбер(Ответ.Шаблоны);				
		КонецЕсли;	
	Иначе
		 #Если МобильноеПриложениеКлиент Тогда
			 Текст = "Помилка оновлення вайбер";  
			 СредстваМультимедиа.ВоспроизвестиТекст(Текст,,,,,Истина);
		 #Иначе
			 Текст = "Помилка оновлення вайбер";
			 Сообщить(Текст);
		 #КонецЕсли
	КонецЕсли;	
	

	
	
КонецПроцедуры	

//////////Делаем отправку сообщения н клиенте //////////////////////////////////
Процедура ОтправитьСообщенияСКлиента(СписокКонтактов, НовоеСообщение, ВыбраныйФайл)Экспорт
	
	Если ЗначениеЗаполнено(ВыбраныйФайл) Тогда
		СтруктуруФайла = ОбработатьСтруктуруФайлаНаКлиенте(ВыбраныйФайл);
	КонецЕсли;
	
	
	Ответ = ViberОбновлениеСервер.ОтправитьСообщение(СписокКонтактов, НовоеСообщение, СтруктуруФайла);
	Если Ответ = Неопределено Тогда
		
	 #Если МобильноеПриложениеКлиент Тогда
		 Текст = "Помилка оновлення вайбер";  
		 СредстваМультимедиа.ВоспроизвестиТекст(Текст,,,,,Истина);
	 #Иначе
		 Текст = "Помилка оновлення вайбер";
		 Сообщить(Текст);
	 #КонецЕсли
	 
	КонецЕсли;
	
	
	
КонецПроцедуры	

///////// формируем структуруДанных файла //////////////////////////////////////
Функция ОбработатьСтруктуруФайлаНаКлиенте(ВыбраныйФайл)
	
	ТипФайлаОтправки = СформироватьТипФайлаОтправки(ВыбраныйФайл);
	
	//СтруктураФайлаОтправки = Новый Структура("СтруктураФайлаОтправки", СтруктураФайлаОтправки);
	
	Двоичное = Новый ДвоичныеДанные(ВыбраныйФайл);
	Строка64 = Base64Строка(Двоичное);
	
	ТипФайлаОтправки.Вставить("Строка64", Строка64);
	
	Возврат ТипФайлаОтправки; 
	
КонецФункции

///////// получаем тип файла отправки ///////////////////////////////////////////
Функция СформироватьТипФайлаОтправки(ВыбраныйФайл) 
	
	
	Файл = Новый Файл(ВыбраныйФайл);
	Размер = Файл.Размер();
	Расшерение = Файл.Расширение;
	ИмяФайла   = Файл.Имя;
	
	Если Размер < 3000000 Тогда 
		Если Найти(НРег(ВыбраныйФайл), ".JPEG") > 0 ИЛИ
			 Найти(НРег(ВыбраныйФайл), ".png") > 0 ИЛИ
			 Найти(НРег(ВыбраныйФайл), ".jpg") > 0 ИЛИ
			 Найти(НРег(ВыбраныйФайл), ".BMP") > 0 Тогда
			 ТипФайлаОтправки = "Изображение";
		ИначеЕсли Найти(НРег(ВыбраныйФайл), "mpeg") > 0 Или
				  Найти(НРег(ВыбраныйФайл), ".mp4") > 0 Или
				  Найти(НРег(ВыбраныйФайл), ".mov") > 0 Или
				  Найти(НРег(ВыбраныйФайл), ".3gp") > 0 Или
				  Найти(НРег(ВыбраныйФайл), ".3g2") > 0 Или
				  Найти(НРег(ВыбраныйФайл), ".asf") > 0 Или
				  Найти(НРег(ВыбраныйФайл), ".avi") > 0 Или
				  Найти(НРег(ВыбраныйФайл), ".mpg") > 0 Тогда
			ТипФайлаОтправки = "Видео";
		Иначе
			ТипФайлаОтправки = "Файл";			
		КонецЕсли;
	Иначе
		ТипФайлаОтправки = "Файл";
	КонецЕсли;
	
	Возврат Новый Структура("ТипФайлаОтправки, Размер, Расширение, ИмяФайла", ТипФайлаОтправки, Размер, Расшерение, ИмяФайла); 
	
	
КонецФункции	

///////// отправляем индекатор прочитано ///////////////////////////////////////
Процедура ОправляемИндикаторПрочитано()Экспорт
	
	Если НЕ ИдетОбмен() Тогда
		Идентификатор = ViberОбновлениеСервер.ВыполнитьОбменДаннымиВФоне();
		ТекстОшибки = "";
		Если ViberОбновлениеСервер.ОбменДаннымиЗакончен(Идентификатор, ТекстОшибки) Тогда
			Если ТекстОшибки <> "" Тогда
				Сообщить(ТекстОшибки);
			КонецЕсли;
		Иначе
			ИдентификаторФоновогоЗадания = Идентификатор;
	    КонецЕсли;
	КонецЕсли;

	
КонецПроцедуры	


#КонецОбласти
