
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если УспешноеНачалоОбмена Тогда 
		Возврат;
	КонецЕсли;
	
	Обмен_УправлениеОбменом.Лог("СбросЛога",1);
	Обмен_УправлениеОбменом.Лог("Форма. ВыполнитьОбмен","A");
	Попытка
		//ПодключитьОбработчикОжидания("ОбновитьПрогрес",3,Ложь);
		Обмен_УправлениеОбменом.Лог("Форма. ВыполнитьОбмен1","F");
		ВыполнитьОбмен();
		Обмен_УправлениеОбменом.Лог("Форма. ВыполнитьОбмен2","G");
	Исключение
		Обмен_УправлениеОбменом.Лог("Форма. ВыполнитьОбмен3","H");
		ПоказатьПредупреждение(Новый ОписаниеОповещения("ЗакрытьФорму",ЭтаФорма), ОписаниеОшибки(),0,"Выполнение обмена");
	КонецПопытки;
	Обмен_УправлениеОбменом.Лог("Форма. ВыполнитьОбмен4","I");
	//Ошибка = Обмен_УправлениеОбменом.ВыполнитьОбменДанными();
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьОбмен(СбрасыватьОбмен = Истина)
	
	Если Общий.АвтообмінВключений() Тогда
		
		Возврат;
	КонецЕсли;
	
	
	Если СбрасыватьОбмен Тогда 
		УспешноеНачалоОбмена = Ложь;
		ОтключитьЗапускОбменаПриСтарте();
	КонецЕсли;
	 УстановитьКонстантыНоль();
	//Константы.ОшибкаОбмена.Установить("");
	//ФЗ = ФоновыеЗадания.Выполнить("Обмен_УправлениеОбменом.ВыполнитьОбменДанными");
	//ФЗУИД = ФЗ.УникальныйИдентификатор;
	//Обмен_УправлениеОбменом.ВыполнитьОбменДанными();
	ПодключитьОбработчикОжидания("ВыполнитьОбменНапрямую",1,Истина);
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьОбменНапрямую()
	Если РежимВыполненияОбмена = 1 Тогда   // Частковий обмін
		Обмен_УправлениеОбменом.ВыполнитьОбменДанными();	
	ИначеЕсли  РежимВыполненияОбмена = 2 Тогда  // Повний обмін 	
		Обмен_УправлениеОбменом.ВыполнитьОбменДаннымиВыгрузкаЗаказов();
		Обмен_УправлениеОбменом.ВыполнитьОбменДанными(Ложь);
		Обмен_УправлениеОбменом.ОновитиЗалишкиТаЦіни();
	ИначеЕсли  РежимВыполненияОбмена = 3 Тогда  // Оновити ціни
		Обмен_УправлениеОбменом.ОновитиЗалишкиТаЦіни(); // Обмен_УправлениеОбменом.ОновитиЗалишкиТаЦіни(Истина); 
	ИначеЕсли  РежимВыполненияОбмена = 4 Тогда  // Вивантажити документи
		Обмен_УправлениеОбменом.ВыполнитьОбменДаннымиВыгрузкаЗаказов(); 
		Обмен_УправлениеОбменом.ВыполнитьОбменДаннымиВыгрузкаЗаказов();  
	ИначеЕсли  РежимВыполненияОбмена = 5 Тогда  // Завантажити товари
		Обмен_УправлениеОбменом.ВыполнитьОбменДаннымиЗагрузкаТоварів();
	ИначеЕсли  РежимВыполненияОбмена = 6 Тогда  // Завантажити контрагентів
		Обмен_УправлениеОбменом.ВыполнитьОбменДаннымиЗагрузкаКонтрагентів();
	ИначеЕсли  РежимВыполненияОбмена = 7 Тогда  // Завантажити документи
		Обмен_УправлениеОбменом.ВыполнитьОбменДаннымиЗагрузкаДокументів();
	ИначеЕсли  РежимВыполненияОбмена = 8 Тогда  // Завантажити документи
		Обмен_УправлениеОбменом.ЗавантажитиКурсиВалют();

	КонецЕсли;
	ОбновитьПрогрес();
	УстановитьЗаголовокПриложения("Обмін: "+ТекущаяДата());
КонецПроцедуры


&НаКлиенте
Процедура ОбновитьПрогрес()
	УспешноеНачалоОбмена = ПолучитьОбменВыполняется();
	Прогрес = ПолучитьТекущийПрогрес();
	Ошибка = ПолучитьОшибку();
	Если Найти(Ошибка,"Ошибка работы с Интернет") > 0 ИЛИ Найти(Ошибка,"Помилка роботи з Інтернет") > 0 Тогда 
		//Ошибка = "Отсутствует подключение к интернету.";
		УстановитьОшибку(Ошибка);
	КонецЕсли;
	//СтруктураСостоянияОбмена = ПолучитьСостоянеОбмена();
	Обмен_УправлениеОбменом.Лог("------- Форма. Обновить прогрес","B");
	Попытка
		//Если НЕ СтруктураСостоянияОбмена.Активен Тогда             //  Прогрес >= 100 ИЛИ Ошибка <> "" ИЛИ   
			ОтключитьОбработчикОжидания("ОбновитьПрогрес");
			Обмен_УправлениеОбменом.Лог("------- Форма. Обмен не активен","C");
			
			Оповестить("СобытиеОбновленДолг");
			//МассивОшибок = СтруктураСостоянияОбмена.МассивОшибок;
			//Для Каждого Элемент Из МассивОшибок Цикл
			//	
			//	Ошибка = Ошибка + " " + Элемент;
			//	
			//КонецЦикла;
			//УстановитьОшибку(Ошибка);
			
			УстановитьКонстантыНоль();
			Если ЗначениеЗаполнено(Ошибка) Тогда 
				//ПоказатьПредупреждение(Новый ОписаниеОповещения("ЗакрытьФорму",ЭтаФорма), Ошибка + "После закрытия окна сообщения обмен будет продолжен.",20,"Выполнение обмена");
				Если УспешноеНачалоОбмена Тогда 
					ПоказатьПредупреждение(Новый ОписаниеОповещения("ПродолжитьОбмен",ЭтаФорма), Ошибка + Символы.ПС + " После закрытия окна сообщения обмен будет продолжен.",20,"Выполнение обмена");				
					//ВыполнитьОбмен(Ложь);
				Иначе 
					
					ПоказатьПредупреждение(Новый ОписаниеОповещения("ЗакрытьФорму",ЭтаФорма), Ошибка,0,"Выполнение обмена");
				КонецЕсли;
			Иначе 
				//ОтключитьОбработчикОжидания("ОбновитьПрогрес");
				УстановитьЧастичныйОбмен();

				ПоказатьПредупреждение(Новый ОписаниеОповещения("ЗакрытьФорму",ЭтаФорма), "Обмін пройшов успішно!",,"Выполнение обмена");
				
			КонецЕсли;
			//ОбновитьИнтерфейс();	
		//Иначе 
		//	УспешноеНачалоОбмена = ПолучитьОбменВыполняется();
		//	Обмен_УправлениеОбменом.Лог("------- Форма. Обмен активен","D");
		//КонецЕсли;
		
	Исключение
		Обмен_УправлениеОбменом.Лог("------- Форма. ОШИБКА обновления прогреса "+ ОписаниеОшибки(),"E");
		ПоказатьПредупреждение(, ОписаниеОшибки(),20,"Выполнение обмена");
		//Если НЕ СтруктураСостоянияОбмена.Активен Тогда
		//	ВыполнитьОбмен(Ложь);
		//КонецЕсли;
	КонецПопытки;
	//ОбновитьИнтерфейс();
	//Предупреждение("Тест",1,"тест");
КонецПроцедуры

&НаСервере
Функция ПолучитьСостоянеОбмена()
	ФЗ = ФоновыеЗадания.НайтиПоУникальномуИдентификатору(ФЗУИД);
	НовСтруктура = Новый Структура;
	Если ФЗ = Неопределено Тогда 
		НовСтруктура.Вставить("Активен", Ложь);
		НовСтруктура.Вставить("МассивОшибок", Новый Массив);
	Иначе	
		НовСтруктура.Вставить("Активен", ФЗ.Состояние = СостояниеФоновогоЗадания.Активно);
		НовСтруктура.Вставить("МассивОшибок", ФЗ.ПолучитьСообщенияПользователю());
	КонецЕсли;
	Возврат НовСтруктура;
КонецФункции


&НаКлиенте
Процедура ЗакрытьФорму(Параметр) Экспорт
	Обмен_УправлениеОбменом.Лог("Форма. Закрыть Форму","Z");
	ОтключитьОбработчикОжидания("ОбновитьПрогрес");
	ОтключитьЗапускОбменаПриСтарте();
	Прогрес = 100;
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура ПродолжитьОбмен(Параметр) Экспорт
	Элементы.ДекорацияОбмен.Заголовок = "Продовження обміну...";
	ВыполнитьОбмен(Ложь);
	Обмен_УправлениеОбменом.Лог("Форма. Подключения обработчика Обновления","A");
	//ПодключитьОбработчикОжидания("ОбновитьПрогрес",3,Ложь);
КонецПроцедуры



&НаСервереБезКонтекста
Процедура УстановитьКонстантыНоль()
	Константы.ПроцентОбмена.Установить(0);
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ОтключитьЗапускОбменаПриСтарте()
	Константы.ОбменВыполняется.Установить(Ложь);
	
КонецПроцедуры


&НаСервереБезКонтекста
Процедура УстановитьЧастичныйОбмен()	
	Константы.ЭтоНеПервыйОбмен.Установить(Истина);
КонецПроцедуры


&НаСервереБезКонтекста
Функция ПолучитьТекущийПрогрес()
	Возврат Константы.ПроцентОбмена.Получить();
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьОшибку()
	Возврат Константы.ОшибкаОбмена.Получить();
КонецФункции

&НаСервереБезКонтекста
Функция УстановитьОшибку(Ошибка)
	Константы.ОшибкаОбмена.Установить(Ошибка);
КонецФункции


&НаСервереБезКонтекста
Функция ПолучитьОбменВыполняется()
	Возврат Константы.ОбменВыполняется.Получить();
КонецФункции


&НаКлиенте
Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)
	Если Прогрес < 100 Тогда 
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	РежимВыполненияОбмена = Параметры.РежимВыполненияОбмена;
КонецПроцедуры




