
Перем мЭтоОбмен Экспорт;



Процедура ПриЗаписи(Отказ)
	
	Если мЭтоОбмен <> Истина Тогда 
		Общий.ЗарегистрироватьИзменения(ЭтотОбъект.Ссылка);		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ВидДвиженияДенежныхСредств = Перечисления.ВидДвиженияДенежныхСредств.ПустаяСсылка() Тогда  
		ВидДвиженияДенежныхСредств = Перечисления.ВидДвиженияДенежныхСредств.Приход;
	КонецЕсли; 
	Если Не Архив Тогда 
		Архив = ЭтотОбъект.ПометкаУдаления;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(УИДUSD) Тогда 
		УИДUSD = Новый УникальныйИдентификатор;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(УИДГРН) Тогда 
		УИДГРН = Новый УникальныйИдентификатор;
	КонецЕсли;
	
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)

	// регистр ДенежныеСредства 
	Движения.ДенежныеСредства.Записывать 	= Истина;
	Движение 								= Движения.ДенежныеСредства.Добавить();
	Движение.Период 						= Дата;
	Движение.Сумма 							= СуммаДокумента;
	Если ВидДвиженияДенежныхСредств = Перечисления.ВидДвиженияДенежныхСредств.ПустаяСсылка() 
		ИЛИ ВидДвиженияДенежныхСредств = Перечисления.ВидДвиженияДенежныхСредств.Приход Тогда 
		Движение.ВидДвиженияДенежныхСредств = Перечисления.ВидДвиженияДенежныхСредств.Приход;
	Иначе 
		Движение.ВидДвиженияДенежныхСредств = ВидДвиженияДенежныхСредств;	
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ДанныеЗаполнения <> Неопределено Тогда 
		Если ДанныеЗаполнения.Свойство("Контрагент") Тогда 
			Контрагент = ДанныеЗаполнения.Контрагент;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры


мЭтоОбмен = Ложь;
