перем мПроведен; 

Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Даний фрагмент побудований конструктором.
	// При повторному використанні конструктора, внесені вручну зміни будуть втрачені!!!

	// регістр ЦеныНоменклатуры
	Движения.ЦеныНоменклатуры.Записывать = Истина;
	Движения.ЦеныНоменклатуры.Очистить();
	Движения.ЦеныНоменклатуры.мКонтрольАкций = ложь;
	Движения.ЦеныНоменклатуры.мПериод = ДатаНачала;
	Движения.ЦеныНоменклатуры.ДополнительныеСвойства.Вставить("УстановкаАкций", Ссылка);
	Для Каждого ТекСтрокаТовары Из Товары Цикл
		
		//Если ТекСтрокаТовары.АкционнаяЦена = ТекСтрокаТовары.Цена Тогда 
		//	Продолжить;
		//КонецЕсли;
		
		ЕдиницаИзмерения =  Справочники.ЕдиницыИзмерения.НайтиПоНаименованию("кг",,, ТекСтрокаТовары.Номенклатура); 
		Движение = Движения.ЦеныНоменклатуры.Добавить();
		Движение.Период = ДатаНачала;
		Движение.ТипЦен = ТипЦен;
		Движение.Номенклатура = ТекСтрокаТовары.Номенклатура;
		Движение.Валюта = ТекСтрокаТовары.Валюта;
		Движение.Цена = ТекСтрокаТовары.АкционнаяЦена;
		Движение.ЕдиницаИзмерения = ЕдиницаИзмерения; 


		Движение = Движения.ЦеныНоменклатуры.Добавить();
		Движение.Период = КонецДня(ДатаОкончания);
		Движение.ТипЦен = ТипЦен;
		Движение.Номенклатура = ТекСтрокаТовары.Номенклатура;
		Движение.Валюта = ТекСтрокаТовары.Валюта;
		//Движение.Цена = ТекСтрокаТовары.Цена;
		Движение.Цена = 0;

		Движение.ЕдиницаИзмерения = ЕдиницаИзмерения;

	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры


Процедура ПриЗаписи(Отказ)
	Если Не мПроведен = Ссылка.Проведен Тогда 
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЦеныНоменклатуры.Регистратор
		|ИЗ
		|	Документ.УстановкаАкций.Товары КАК УстановкаАкцийТовары
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры КАК ЦеныНоменклатуры
		|		ПО УстановкаАкцийТовары.Номенклатура = ЦеныНоменклатуры.Номенклатура
		|			И УстановкаАкцийТовары.Ссылка.ДатаНачала < ЦеныНоменклатуры.Период
		|			И УстановкаАкцийТовары.Ссылка.ДатаОкончания > ЦеныНоменклатуры.Период
		|ГДЕ
		|	УстановкаАкцийТовары.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	ЦеныНоменклатуры.Регистратор";
		
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			Выборка.Регистратор.ПолучитьОбъект().Записать(РежимЗаписиДокумента.Проведение);
		КонецЦикла;
		
		
	КонецЕсли;
	
КонецПроцедуры


Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	мПроведен = Проведен;
КонецПроцедуры

// Производит перезаполнение и установку необходимых полей в строке табличной части.
//
// Параметры:
//  СтрокаТабличнойЧасти - строка табличной части, которую необходимо перезаполнить.
//
Процедура ПерезаполнитьСтроку(СтрокаТабличнойЧасти) Экспорт 

	Если Не ЗначениеЗаполнено(ТипЦен) Тогда // ничего делать не надо.
		Возврат;
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаЦен", КонецДня(ДатаОкончания));
	Запрос.УстановитьПараметр("ТипыЦен", Справочники.ТипыЦенНоменклатуры.ЦенаПродажиВес);
	Запрос.УстановитьПараметр("Номенклатура", СтрокаТабличнойЧасти.Номенклатура);
	Запрос.УстановитьПараметр("ХарактеристикаНоменклатуры", Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка());

	Запрос.Текст = "ВЫБРАТЬ
	               |	ТипыЦенСправочник.Ссылка КАК ТипЦен,
	               |	ВЫБОР
	               |		КОГДА ЦеныНоменклатурыБезХарактеристики.Цена ЕСТЬ NULL
	               |				И ЦеныНоменклатурыСХарактеристикой.Цена ЕСТЬ NULL
	               |			ТОГДА 0
	               |		ИНАЧЕ ЕСТЬNULL(ЦеныНоменклатурыСХарактеристикой.Цена, ЦеныНоменклатурыБезХарактеристики.Цена)
	               |	КОНЕЦ КАК Цена,
	               |	ВЫБОР
	               |		КОГДА ЦеныНоменклатурыБезХарактеристики.Валюта ЕСТЬ NULL
	               |				И ЦеныНоменклатурыСХарактеристикой.Валюта ЕСТЬ NULL
	               |			ТОГДА ТипыЦенСправочник.ВалютаЦены
	               |		ИНАЧЕ ЕСТЬNULL(ЦеныНоменклатурыСХарактеристикой.Валюта, ЦеныНоменклатурыБезХарактеристики.Валюта)
	               |	КОНЕЦ КАК Валюта
	               |ИЗ
	               |	Справочник.ТипыЦенНоменклатуры КАК ТипыЦенСправочник
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
	               |				&ДатаЦен,
	               |				ТипЦен В (&ТипыЦен)
	               |					И Номенклатура = &Номенклатура
	               |					И ХарактеристикаНоменклатуры = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)) КАК ЦеныНоменклатурыБезХарактеристики
	               |		ПО ТипыЦенСправочник.Ссылка = ЦеныНоменклатурыБезХарактеристики.ТипЦен
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
	               |				&ДатаЦен,
	               |				ТипЦен В (&ТипыЦен)
	               |					И Номенклатура = &Номенклатура
	               |					И ХарактеристикаНоменклатуры = &ХарактеристикаНоменклатуры) КАК ЦеныНоменклатурыСХарактеристикой
	               |		ПО ТипыЦенСправочник.Ссылка = ЦеныНоменклатурыСХарактеристикой.ТипЦен
	               |ГДЕ
	               |	ТипыЦенСправочник.Ссылка В(&ТипыЦен)";

	Выборка = Запрос.Выполнить().Выбрать();


	Пока Выборка.Следующий() Цикл
		
		СтрокаТабличнойЧасти.Цена 			= Выборка.Цена;
		СтрокаТабличнойЧасти.АкционнаяЦена 	= Выборка.Цена;
		СтрокаТабличнойЧасти.Валюта 		= Выборка.Валюта;
		
	КонецЦикла;

КонецПроцедуры 