Процедура ДвижениеПриходВеса(Движения,Склад,ТаблицаТоваров) Экспорт 
	
	//Для Каждого стр Из ТаблицаТоваров Цикл
	//	
	//	НаборЗаписей = РегистрыНакопления.ТовариНаСкладахУВазі.СоздатьНаборЗаписей();
	//	НаборЗаписей.Отбор.Склад.Значение = Склад;
	//	НаборЗаписей.Отбор.Номенклатура.Значение = стр.Номенклатура;		
	//	
	//	НоваяЗапись = НаборЗаписей.Добавить();
	//	НоваяЗапись.ВидДвижения = ВидДвиженияНакопления.Приход;
	//	НоваяЗапись.Склад = стр.Склад;
	//	НоваяЗапись.Номенклатура = стр.Номенклатура;
	//	НоваяЗапись.Характеристика = стр.Характеристика;
	//	НоваяЗапись.Вага = стр.Характеристика;
	//	НаборЗаписей.Записать();

	//КонецЦикла;
	

КонецПроцедуры

Процедура ДвижениеРасходВеса(Движения,Склад,ТаблицаТоваров) Экспорт 
	
	//Для Каждого стр Из ТаблицаТоваров Цикл
	//	
	//	НаборЗаписей = РегистрыНакопления.ТовариНаСкладахУВазі.СоздатьНаборЗаписей();
	//	НаборЗаписей.Отбор.Склад.Значение = Склад;
	//	НаборЗаписей.Отбор.Номенклатура.Значение = стр.Номенклатура;		
	//	
	//	НоваяЗапись = НаборЗаписей.Добавить();
	//	НоваяЗапись.ВидДвижения = ВидДвиженияНакопления.Расход;
	//	НоваяЗапись.Склад = стр.Склад;
	//	НоваяЗапись.Номенклатура = стр.Номенклатура;
	//	НоваяЗапись.Характеристика = стр.Характеристика;
	//	НоваяЗапись.Вага = стр.Характеристика;
	//	НаборЗаписей.Записать();

	//КонецЦикла;
	    
КонецПроцедуры
