
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Даний фрагмент побудований конструктором.
	// При повторному використанні конструктора, внесені вручну зміни будуть втрачені!!!

	// регістр Сектори
	
	Если НЕ ЗначениеЗаполнено(Сектор) Тогда 
		Возврат;
	КонецЕсли;
	
	Движения.Сектори.Записывать = Истина;
	Движения.Сектори.Очистить();
	Движение = Движения.Сектори.Добавить();
	Движение.Период = Дата;
	Движение.ХарактеристикаНоменклатуры = ХарактеристикаНоменклатуры;
	Движение.Сектор = Сектор;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Попытка
		Відповідальний = ПараметрыСеанса.ТекущийПользователь;
	Исключение
	КонецПопытки;

КонецПроцедуры
