
#Область ПрограммныйИнтерфейс_КлючДоступаGoogleAPI

// Отправляет серверу Google данные для аутентификации сервиса и возврашает ключ доступа (access token) для возможности
// отправлять запросы к Google API. В случае возникновения ошибки или передачи неверных данных будет вызвано Исключение.
//
// Параметры:
//  СекретныйКлюч - Строка - строка в формате JSON, содержащая данные секретного ключа.
//  Разрешения - Строка - разрешения, необходимые для доступа к Google API.
//  ПутьКOpenSsl - Строка - строка к каталогу программы OpenSsl, которая используется для создания подписи отправляемого
//                          JSON Web Token.
// 
// Возвращаемое значение:
//  Строка - ключ доступа к Google API.
//
Функция ПолучитьКлючДоступаGoogleAPI(СекретныйКлюч, Разрешения, Знач ПутьКOpenSsl) Экспорт
	
	Если Прав(ПутьКOpenSsl, 1) <> "\" Тогда
		ПутьКOpenSsl = ПутьКOpenSsl + "\";
	КонецЕсли; 
	
	Заголовки = Новый Соответствие;
	Заголовки.Вставить("Content-Type", "application/json");
	
	ПараметрыЗапроса = Локализация.СтрШаблонУкр("{""grant_type"":""%1"",""assertion"":""%2""}",
		"urn:ietf:params:oauth:grant-type:jwt-bearer",
		СформироватьJWT(СекретныйКлюч, Разрешения, ПутьКOpenSsl)
	);
	
	Запрос = Новый HTTPЗапрос("token", Заголовки);
	Запрос.УстановитьТелоИзСтроки(ПараметрыЗапроса);
	
	Соединение = Новый HTTPСоединение(
		АдресСервераАутентификацииGoogle(), , , , , ,
		Новый ЗащищенноеСоединениеOpenSSL
	);
	Ответ = Соединение.ОтправитьДляОбработки(Запрос);
	
	ТелоОтвета = Ответ.ПолучитьТелоКакСтроку();
	
	Если Не ПустаяСтрока(ТелоОтвета) Тогда
		
		ЧтениеJSON = Новый ЧтениеJSON;
		ЧтениеJSON.УстановитьСтроку(ТелоОтвета);
		
		СтруктураОтвета = ПрочитатьJSON(ЧтениеJSON);
		
		ЧтениеJSON.Закрыть();
		
	Иначе
		
		СтруктураОтвета = Неопределено;
		
	КонецЕсли; 
	
	Если Ответ.КодСостояния <> 200 Тогда
		
		ИнформацияОбОшибке = ?(СтруктураОтвета <> Неопределено,
			СтруктураОтвета,
			Новый Структура
		);
		ИнформацияОбОшибке.Вставить("КодСостояния", Ответ.КодСостояния);
		ВызватьИсключение СформироватьОписаниеОшибкиGoogleAPI(ИнформацияОбОшибке);
		
	КонецЕсли; 
	

	
	Возврат СтруктураОтвета.access_token;
	
КонецФункции 

#КонецОбласти 

#Область СлужебныеПроцедурыИФункции

#Область ФормированиеJSONWebToken

// Выполняет формирование JSON Web Token (JWT), который необходимо отправить для аутентификации.
//
// Параметры:
//  СекретныйКлюч - Строка - строка в формате JSON, содержащая данные секретного ключа.
//  Разрешения - Строка - разрешения, необходимые для доступа к Google API.
//  ПутьКOpenSsl - Строка - строка к каталогу программы OpenSsl, которая используется для создания подписи отправляемого
//                          JSON Web Token.
// 
// Возвращаемое значение:
//  Строка - JSON Web Token в строке формата Base64, подписанный секретным ключом.
//
Функция СформироватьJWT(СекретныйКлюч, Разрешения, ПутьКOpenSsl)
	
	//СтруктураКлюча = СекретныйКлючJSONВСтруктуру(СекретныйКлюч);
	
	ЗаголовокJWT = СформироватьЗаголовокJWT();
	ТелоJWT = СформироватьТелоJWT(СекретныйКлюч, Разрешения);
	
	ПодписываемаяСтрока = ЗаголовокJWT + "." + ТелоJWT;
	Подпись = ПодписатьJWT(ПодписываемаяСтрока, СекретныйКлюч.private_key, ПутьКOpenSsl);
	
	JWT = ЗаголовокJWT + "." + ТелоJWT + "." + Подпись;
	Возврат JWT;
	
КонецФункции 

// Формирует заголовок JSON Web Token (JWT). Заголовок содержит алгортим подписи (RS256) и тип токена (JWT).
// 
// Возвращаемое значение:
//  Строка - заголовок JSON Web Token в строке формата Base64.
//
Функция СформироватьЗаголовокJWT()
	
	ЗаголовокJWT = "{""alg"":""RS256"",""typ"":""JWT""}";
	Возврат СтрокаВСтрокуBase64(ЗаголовокJWT);
	
КонецФункции 

// Формирует тело JSON Web Token (JWT) в формате JSON. Тело содержит идентификатор сервиса, разрешения, срок действия
// ключа доступа (устанавливается максимально возможное значение - 1 ч) и другие параметры.
//
// Параметры:
//  СекретныйКлюч - Структура - данные секретного ключа, по которому формируется тело JSON Web Token.
//  Разрешения - Строка - разрешения, необходимые для доступа к Google API.
// 
// Возвращаемое значение:
//  Строка - тело JSON Web Token в строке формата Base64.
//
Функция СформироватьТелоJWT(СекретныйКлюч, Разрешения)
	
	СекундВЧасе = 3600;
	ДатаВыдачи = ДатаВДатуUnix(ТекущаяУниверсальнаяДатаСервера());
	ДатаОкончания = ДатаВыдачи + СекундВЧасе;
	
	ШаблонТела =
	"{
	|	""iss"": ""%1"",
	|	""scope"": ""%2"",
	|	""aud"": ""%3"",
	|	""exp"": %4,
	|	""iat"": %5
	|}";
	Тело = Локализация.СтрШаблонУкр(ШаблонТела,
		СекретныйКлюч.client_email,
		Разрешения,
		СекретныйКлюч.token_uri,
		Формат(ДатаОкончания, "ЧГ="),
		Формат(ДатаВыдачи, "ЧГ="));
		
	Возврат СтрокаВСтрокуBase64(Тело);
	
КонецФункции 

// Выполняет подписание JSON Web Token секретным ключом с использованием программы OpenSsl и возвращает сформированную
// подпись.
//
// Параметры:
//  JWT - Строка - строка в формате Base64, сформированная из заголовка и тела JSON Web Token, которая будет подписана
//                 секретным ключом.
//  СекретныйКлюч - Строка - секретный ключ (private key), используемый для подписания JSON Web Token.
//  ПутьКOpenSsl - Строка - строка к каталогу программы OpenSsl, которая используется для создания подписи JSON Web Token.
// 
// Возвращаемое значение:
//  Строка - подпись JSON Web Token в строке формата Base64.
//
Функция ПодписатьJWT(JWT, СекретныйКлюч, ПутьКOpenSsl)
	
	КаталогФайлов = ПолучитьИмяВременногоФайла();
	СоздатьКаталог(КаталогФайлов);
	
	ИмяФайлаКлюча = КаталогФайлов + "\private.key";
	ИмяФайлаJWT = КаталогФайлов + "\jwt.txt";
	ИмяФайлаПодписи = КаталогФайлов + "\jwt.sgn";
	
	ЗаписатьСтрокуВФайл(JWT, ИмяФайлаJWT);
	ЗаписатьСтрокуВФайл(СекретныйКлюч, ИмяФайлаКлюча);
	
	OpenSsl = ПутьКOpenSsl + "openssl.exe";
	СтрокаКоманды = OpenSsl + " dgst -sha256 -sign " + ИмяФайлаКлюча + " -out " + ИмяФайлаПодписи + " " + ИмяФайлаJWT;
	КодВозврата = Неопределено;
	
	ЗапуститьПриложение(СтрокаКоманды, , Истина, КодВозврата);
	
	Если КодВозврата <> 0 Тогда
		УдалитьФайлы(КаталогФайлов);
		ВызватьИсключение Локализация.СтрШаблонУкр(
			НСтр("ru='Произошла ошибка при подписании JSON Web Token. Код возврата: %1'"),
			КодВозврата);
	КонецЕсли; 
	
	ДанныеПодписи = Новый ДвоичныеДанные(ИмяФайлаПодписи);
	
	УдалитьФайлы(КаталогФайлов);
	
	Возврат Base64СтрокаБезРазделителей(ДанныеПодписи);
	
КонецФункции 

// Записывает строку в файл для использования в программе OpenSsl.
//
// Параметры:
//  Строка - Строка - строка, которую необходимо записать в файл.
//  ИмяФайла - Строка - имя файла, в который будет записана строка.
//
Процедура ЗаписатьСтрокуВФайл(Строка, ИмяФайла)
	
	// Используется поток, чтобы записать текст в формате UTF-8 без BOM.
	Поток = Новый ПотокВПамяти;
	
	ЗаписьТекста = Новый ЗаписьТекста(Поток, КодировкаТекста.UTF8, , , Ложь);
	ЗаписьТекста.Записать(Строка);
	ЗаписьТекста.Закрыть();
	
	ДвоичныеДанные = Поток.ЗакрытьИПолучитьДвоичныеДанные();
	ДвоичныеДанные.Записать(ИмяФайла);
	
КонецПроцедуры 

#КонецОбласти 

#Область Прочее

// Удаляет из строки формата Base64 разделители ВК + ПС.
//
// Параметры:
//  Значение - Строка - строка формата Base64.
// 
// Возвращаемое значение:
//  Строка - строка формата Base64 без разделителей ВК + ПС.
//
Функция Base64СтрокаБезРазделителей(Значение)
	
	Результат = Base64Строка(Значение);
	Возврат СтрЗаменить(Результат, Символы.ВК + Символы.ПС, "");
	
КонецФункции 

// Преобразует дату 1С в дату формата Unix (количество секунд, прошедших с 01.01.1970).
//
// Параметры:
//  Дата - Дата - дата, которую необходимо преобразовать в формат Unix.
// 
// Возвращаемое значение:
//  Число - дата в формате Unix (количество секунд, прошедших с 01.01.1970).
//
Функция ДатаВДатуUnix(Дата)
	
	Возврат Дата - '19700101';
	
КонецФункции 

// Преобразует секретный ключ из строки в формате JSON в структуру.
//
// Параметры:
//  СекретныйКлюч - Строка - строка в формате JSON, содержащая данные секретного ключа.
// 
// Возвращаемое значение:
//  Структура - данные секретного ключа, преобразованные из строки в формате JSON.
//
Функция СекретныйКлючJSONВСтруктуру(СекретныйКлюч)
	
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(СекретныйКлюч);
	
	Результат = ПрочитатьJSON(ЧтениеJSON);
	
	ЧтениеJSON.Закрыть();
	
	Возврат Результат;
	
КонецФункции 

// Преобразует строку в строку формата Base64.
//
// Параметры:
//  ИсходнаяСтрока - Строка - строка, которую необходимо преобразовать в строку формата Base64.
// 
// Возвращаемое значение:
//  Строка - строка, преобразованная в строку формата Base64.
//
Функция СтрокаВСтрокуBase64(ИсходнаяСтрока)
	
	Поток = Новый ПотокВПамяти;
	
	ЗаписьТекста = Новый ЗаписьТекста(Поток, КодировкаТекста.UTF8);
	ЗаписьТекста.Записать(ИсходнаяСтрока);
	ЗаписьТекста.Закрыть();
	
	ДвоичныеДанные = Поток.ЗакрытьИПолучитьДвоичныеДанные();
	Возврат Base64СтрокаБезРазделителей(ДвоичныеДанные);
	
КонецФункции 

// Возвращает описание ошибки Google API из HTTP ответа для отображения пользователю.
//
// Параметры:
//  ИнформацияОбОшибке - Структура - информация об ошибке, полученной их HTTP ответа.
// 
// Возвращаемое значение:
//  Строка - описание ошибки Google API из HTTP ответа для отображения пользователю.
//
Функция СформироватьОписаниеОшибкиGoogleAPI(ИнформацияОбОшибке)
	
	ОписаниеОшибки = "";
	
	Если ИнформацияОбОшибке.Свойство("error_description") Тогда
		ОписаниеОшибки = ИнформацияОбОшибке.error_description;
	КонецЕсли; 
	
	Если ИнформацияОбОшибке.Свойство("error") Тогда
		ОписаниеОшибки = ?(ПустаяСтрока(ОписаниеОшибки),
			ИнформацияОбОшибке.error,
			"(" + ИнформацияОбОшибке.error + ") " + ОписаниеОшибки
		);
	КонецЕсли; 
	
	ТекстСообщения = НСтр("ru='Ошибка при получении ключа доступа Google API'");
	ТекстСообщения = ТекстСообщения + ?(Не ПустаяСтрока(ОписаниеОшибки),
		": " + ОписаниеОшибки,
		НСтр("ru='. Код состояния: '") + ИнформацияОбОшибке.КодСостояния + "."
	);
		
	Возврат ТекстСообщения;
	
КонецФункции 

// Возвращает текущую универсальную дата (UTC). Так как данную дату можно получить только на сервере, то на клиенте
// используется вызов сервера.
// 
// Возвращаемое значение:
//  Дата - текущая универсальная дата (UTC).
//
Функция ТекущаяУниверсальнаяДатаСервера()
	

	Возврат ТекущаяУниверсальнаяДата();

КонецФункции 

Функция АдресСервераАутентификацииGoogle()
	Возврат "oauth2.googleapis.com";
КонецФункции 

#КонецОбласти 

#КонецОбласти


//////////////////////////////////////////////////////////////////////////////////////////////////////
#Область ПрограммныйИнтерфейс

// Выполняет отправку push-уведомления через Firebase Cloud Messaging. Если при отправке уведомления произошла ошибка,
// то будет вызвано Исключение.
//
// Параметры:
//  Уведомление - Структура - структура, описывающая push-уведомление. Подробнее см. описание функции СоздатьУведомление.
//  ПроектFirebase - Строка - идентификатор проекта сервиса  Firebase.
//  КлючДоступа - Строка - ключ доступа к сервису Firebase Cloud Messaging.
// 
// Возвращаемое значение:
//  Строка - идентификатор Firebase Cloud Messaging отправленного уведомления.
//
Функция ОтправитьУведомление(Уведомление, ПроектFirebase, КлючДоступа) Экспорт
	
	АдресРесурса = Локализация.СтрШаблонУкр(ШаблонАдресаРесурсаОтправкиУведомления(), ПроектFirebase);
	
	Заголовки = Новый Соответствие;
	Заголовки.Вставить("Authorization", "Bearer " + КлючДоступа);
	Заголовки.Вставить("Content-Type", "application/json");
	
	ТелоЗапроса = УведомлениеВJSON(Уведомление);
	
	Запрос = Новый HTTPЗапрос(АдресРесурса, Заголовки);
	Запрос.УстановитьТелоИзСтроки(ТелоЗапроса);
	
	Соединение = Новый HTTPСоединение(АдресСервераFCM(), , , , , , Новый ЗащищенноеСоединениеOpenSSL);
	Ответ = Соединение.ОтправитьДляОбработки(Запрос);
	
	ТелоОтвета = Ответ.ПолучитьТелоКакСтроку();
	
	Если Не ПустаяСтрока(ТелоОтвета) Тогда
		
		ЧтениеJSON = Новый ЧтениеJSON;
		ЧтениеJSON.УстановитьСтроку(ТелоОтвета);
		СтруктураОтвета = ПрочитатьJSON(ЧтениеJSON, Истина);
		ЧтениеJSON.Закрыть();
		
	Иначе
		
		СтруктураОтвета = Неопределено;
		
	КонецЕсли; 
	
	Если Ответ.КодСостояния <> 200 Тогда
		
		ОписаниеОшибки = "";
		
		Если СтруктураОтвета <> Неопределено
				И СтруктураОтвета["error"] <> Неопределено
				И СтруктураОтвета["error"]["message"] <> Неопределено Тогда
			
			ОписаниеОшибки = СтруктураОтвета["error"]["message"];
			
		КонецЕсли; 
		
		ТекстСообщения = НСтр("ru='Ошибка при отправке push-уведомления'");
		ТекстСообщения = ТекстСообщения + ?(Не ПустаяСтрока(ОписаниеОшибки),
			": " + ОписаниеОшибки,
			НСтр("ru='. Код состояния: '") + Ответ.КодСостояния + "."
		);
		
		ВызватьИсключение ТекстСообщения;
		
	КонецЕсли; 
	
	Возврат СтруктураОтвета["name"];
	
КонецФункции 

// Возвращает структуру, описывающую push-уведомление и инициализированную пустыми значениями.
// Описание параметров см. https://firebase.google.com/docs/reference/fcm/rest/v1/projects.messages
//
// Возвращаемое значение:
//  Структура
//
Функция СоздатьУведомление() Экспорт
	
	Уведомление = Новый Структура;
	Уведомление.Вставить("token", "");
	Уведомление.Вставить("topic", "");
	Уведомление.Вставить("condition", "");
	Уведомление.Вставить("data", Новый Соответствие);
	Уведомление.Вставить("notification", Неопределено);
	Уведомление.Вставить("android", Неопределено);
	Уведомление.Вставить("webpush", Неопределено);
	Уведомление.Вставить("apns", Неопределено);
	
	Возврат Уведомление;
	
КонецФункции 

// Возвращает структуру, описывающую оповещение (Notification) и инициализированную пустыми значениями.
// Описание параметров см. https://firebase.google.com/docs/reference/fcm/rest/v1/projects.messages#Notification
//
// Возвращаемое значение:
//  Структура
//
Функция СоздатьОповещение() Экспорт
	
	Оповещение = Новый Структура;
	Оповещение.Вставить("title", "");
	Оповещение.Вставить("body", "");
	Оповещение.Вставить("image", "");
	
	Возврат Оповещение;
	
КонецФункции 

// Возвращает структуру, описывающую конфигурацию push-уведомление для Android и инициализированную пустыми значениями.
// Описание параметров см. https://firebase.google.com/docs/reference/fcm/rest/v1/projects.messages#AndroidConfig
//
// Возвращаемое значение:
//  Структура
//
Функция СоздатьКонфигурациюAndroid() Экспорт
	
	Конфигурация = Новый Структура;
	Конфигурация.Вставить("collapse_key", "");
	Конфигурация.Вставить("priority", "");
	Конфигурация.Вставить("ttl", "");
	Конфигурация.Вставить("restricted_package_name", "");
	Конфигурация.Вставить("data", Новый Соответствие);
	Конфигурация.Вставить("notification", Неопределено);

	Возврат Конфигурация;
КонецФункции 

// Возвращает структуру, описывающую оповещение для Android (AndroidNotification) и инициализированную пустыми
// значениями.
// Описание параметров см. https://firebase.google.com/docs/reference/fcm/rest/v1/projects.messages#AndroidNotification
//
// Возвращаемое значение:
//  Структура
//
Функция СоздатьОповещениеAndroid() Экспорт
	
	Оповещение = Новый Структура;
	Оповещение.Вставить("title", "");
	Оповещение.Вставить("body", "");
	Оповещение.Вставить("icon", "");
	Оповещение.Вставить("color", "");
	Оповещение.Вставить("sound", "");
	Оповещение.Вставить("tag", "");
	Оповещение.Вставить("click_action", "");
	Оповещение.Вставить("body_loc_key", "");
	Оповещение.Вставить("body_loc_args", Новый Массив);
	Оповещение.Вставить("title_loc_key", "");
	Оповещение.Вставить("title_loc_args", Новый Массив);
	Оповещение.Вставить("channel_id", "");
	Оповещение.Вставить("ticker", "");
	Оповещение.Вставить("sticky", "");
	Оповещение.Вставить("event_time", "");
	Оповещение.Вставить("local_only", "");
	Оповещение.Вставить("notification_priority", "");
	Оповещение.Вставить("default_sound", "");
	Оповещение.Вставить("default_vibrate_timings", "");
	Оповещение.Вставить("default_light_settings", "");
	Оповещение.Вставить("vibrate_timings", Новый Массив);
	Оповещение.Вставить("visibility", "");
	Оповещение.Вставить("notification_count", "");
	Оповещение.Вставить("light_settings", Неопределено);
	Оповещение.Вставить("image", "");
	
	Возврат Оповещение;
	
КонецФункции 

// Возвращает структуру, описывающую конфигурацию push-уведомление для Webpush protocol и инициализированную пустыми
// значениями.
// Описание параметров см. https://firebase.google.com/docs/reference/fcm/rest/v1/projects.messages#WebpushConfig
//
// Возвращаемое значение:
//  Структура
//
Функция СоздатьКонфигурациюWebPush() Экспорт
	
	Конфигурация = Новый Структура;
	Конфигурация.Вставить("headers", Новый Соответствие);
	Конфигурация.Вставить("data", Новый Соответствие);
	Конфигурация.Вставить("notification", Неопределено);
	
	Возврат Конфигурация;
	
КонецФункции 

// Возвращает структуру, описывающую конфигурацию push-уведомление для Apple Push Notification Service и
// инициализированную пустыми значениями.
// Описание параметров см. https://firebase.google.com/docs/reference/fcm/rest/v1/projects.messages#ApnsConfig
//
// Возвращаемое значение:
//  Структура
//
Функция СоздатьКонфигурациюAPNS() Экспорт
	
	Конфигурация = Новый Структура;
	Конфигурация.Вставить("headers", Новый Соответствие);
	Конфигурация.Вставить("payload", Неопределено);
	
	Возврат Конфигурация;
	
КонецФункции 

// Возвращает структуру, описывающую настройки светового оповещения (LightSettings) и инициализированную пустыми значениями.
// Описание параметров см. https://firebase.google.com/docs/reference/fcm/rest/v1/projects.messages#LightSettings
//
// Возвращаемое значение:
//  Структура
//
Функция НастройкиСветовогоОповещения() Экспорт
	
	Настройки = Новый Структура;
	Настройки.Вставить("color", Неопределено);
	Настройки.Вставить("light_on_duration", "");
	Настройки.Вставить("light_off_duration", "");
	
	Возврат Настройки;
	
КонецФункции 

// Возвращает структуру, описывающую цвет RGBA.
//
// Параметры:
//  R - Число - красный (red), дробное число от 0 до 1;
//  G - Число - зеленый (green), дробное число от 0 до 1;
//  B - Число - синий (blue), дробное число от 0 до 1;
//  A - Число - значение альфа-канала, определяющее прозрачность (alpha), дробное число от 0 до 1.
// 
// Возвращаемое значение:
//  Структура - структура, описывающая цвет RGBA.
//
Функция ЦветRGBA(R, G, B, A) Экспорт
	
	ЦветRGBA = Новый Структура;
	ЦветRGBA.Вставить("red", R);
	ЦветRGBA.Вставить("green", G);
	ЦветRGBA.Вставить("blue", B);
	ЦветRGBA.Вставить("alpha", A);
	
	Возврат ЦветRGBA;
	
КонецФункции 

#Область ПредопределенныеЗначения

Функция РазрешениеFCMОтправкаУведомлений() Экспорт	Возврат "https://www.googleapis.com/auth/firebase.messaging"; КонецФункции 

Функция ПриоритетAndroidНормальный() Экспорт		Возврат "NORMAL";					КонецФункции 
Функция ПриоритетAndroidВысокий() Экспорт			Возврат "HIGH";						КонецФункции

Функция ПриоритетОповещенияНеУказан() Экспорт		Возврат "PRIORITY_UNSPECIFIED";		КонецФункции 
Функция ПриоритетОповещенияМинимальный() Экспорт 	Возврат "PRIORITY_MIN";				КонецФункции 
Функция ПриоритетОповещенияНизкий() Экспорт			Возврат "PRIORITY_LOW";				КонецФункции 
Функция ПриоритетОповещенияПоУмолчанию() Экспорт	Возврат "PRIORITY_DEFAULT";			КонецФункции 
Функция ПриоритетОповещенияВысокий() Экспорт		Возврат "PRIORITY_HIGH";			КонецФункции 
Функция ПриоритетОповещенияМаксимальный() Экспорт 	Возврат "PRIORITY_MAX";				КонецФункции 

Функция ВидимостьУведомленияНеУказана() Экспорт		Возврат "VISIBILITY_UNSPECIFIED";	КонецФункции 
Функция ВидимостьУведомленияПриватное() Экспорт		Возврат "PRIVATE";					КонецФункции 
Функция ВидимостьУведомленияПубличное() Экспорт		Возврат "PUBLIC";					КонецФункции 
Функция ВидимостьУведомленияСекретное() Экспорт		Возврат "SECRET";					КонецФункции 

#КонецОбласти 

#КонецОбласти 

#Область СлужебныеПроцедурыИФункции

// Выполняет преобразование структуры, описывающей push-уведомление, в строку JSON для отправки на сервере.
//
// Параметры:
//  Уведомление - Структура - структура, описывающая push-уведомление. Подробнее см. описание функции СоздатьУведомление.
// 
// Возвращаемое значение:
//  Строка - строка в формате JSON, содержащая данные push-уведомления для отправки на сервер.
//
Функция УведомлениеВJSON(Уведомление)
	
	Сообщение = Новый Структура("message", Уведомление);
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	
	ЗаписатьОбъектВJSON(ЗаписьJSON, Сообщение);
	
	Возврат ЗаписьJSON.Закрыть();
	
КонецФункции 

Процедура ЗаписатьОбъектВJSON(ЗаписьJSON, Объект)
	
	// Используется самостоятельный обход и запись значений вместо "ЗаписатьJSON" для пропуска незаполненных значений.
	
	ТипОбъекта = ТипЗнч(Объект);
	
	Если ТипОбъекта = Тип("Массив") Тогда
		
		Если Объект.Количество() = 0 Тогда
			Возврат;
		КонецЕсли; 
		
		ЗаписьJSON.ЗаписатьНачалоМассива();
		
		Для каждого ЭлементМассива Из Объект Цикл
			ЗаписатьОбъектВJSON(ЗаписьJSON, ЭлементМассива);
		КонецЦикла;
		
		ЗаписьJSON.ЗаписатьКонецМассива();
		
	ИначеЕсли ТипОбъекта = Тип("Структура") Или ТипОбъекта = Тип("Соответствие") Тогда
		
		Если Объект.Количество() = 0 Тогда
			Возврат;
		КонецЕсли; 
		
		НачалоОбъектаЗаписано = Ложь;
		
		Для каждого КлючЗначение Из Объект Цикл
			
			Если Не ЗначениеЗаполнено(КлючЗначение.Значение) Тогда
				Продолжить;
			КонецЕсли; 
			
			Если Не НачалоОбъектаЗаписано Тогда
				ЗаписьJSON.ЗаписатьНачалоОбъекта();
				НачалоОбъектаЗаписано = Истина;
			КонецЕсли; 
			
			ЗаписьJSON.ЗаписатьИмяСвойства(КлючЗначение.Ключ);
			ЗаписатьОбъектВJSON(ЗаписьJSON, КлючЗначение.Значение);
			
		КонецЦикла;
		
		Если НачалоОбъектаЗаписано Тогда
			ЗаписьJSON.ЗаписатьКонецОбъекта();
		КонецЕсли; 
		
	ИначеЕсли ЗначениеЗаполнено(Объект) Тогда
		
		Если ТипОбъекта = Тип("Строка")
				Или ТипОбъекта = Тип("Число")
				Или ТипОбъекта = Тип("Булево") Тогда
			
			ЗаписьJSON.ЗаписатьЗначение(Объект);
			
		Иначе
			
			ЗаписьJSON.ЗаписатьЗначение(XMLСтрока(Объект));
			
		КонецЕсли;
		
	КонецЕсли; 
	
КонецПроцедуры 

Функция АдресСервераFCM()
	Возврат "fcm.googleapis.com";
КонецФункции 

Функция ШаблонАдресаРесурсаОтправкиУведомления()
	Возврат "/v1/projects/%1/messages:send";
КонецФункции 

#КонецОбласти 
