
&НаКлиенте
Процедура Добавить(Команда)
	
   Форма = ПолучитьФорму("Документ.Заказ.ФормаОбъекта");

   Форма.Открыть();
КонецПроцедуры


&НаКлиенте
Процедура ВідображатиАрхівніПриИзменении(Элемент)
	Отбор =  Список.КомпоновщикНастроек.Настройки.Отбор.Элементы[0];
	Отбор.Использование = НЕ ВідображатиАрхівні;
	
	
	
КонецПроцедуры

&НаСервере
Процедура ВилучитиЗамовленняНаСервере()
	// Вставити вміст обробника.
КонецПроцедуры

&НаКлиенте
Процедура ВилучитиЗамовлення(Команда)
	ВилучитиЗамовленняНаСервере();
КонецПроцедуры

&НаСервере
Процедура ФильтрАртикулНаименованиеПриИзмененииНаСервере()
	Если СокрЛП(ФильтрАртикулНаименование) <> "" Тогда
		
		СписокСсылокДляОтбора = Новый СписокЗначений;	
		
		ОтборСсылка =  Список.КомпоновщикНастроек.Настройки.Отбор.Элементы[1];
		ОтборСсылка.Использование = Истина;
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаказТовары.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.Заказ.Товары КАК ЗаказТовары
		|ГДЕ
		|	(ЗаказТовары.Номенклатура.Артикул ПОДОБНО &Артикул
		|			ИЛИ ЗаказТовары.Номенклатура.Наименование ПОДОБНО &Наименование)
		|	И ЗаказТовары.Ссылка.Актуальный = ИСТИНА
		|
		|СГРУППИРОВАТЬ ПО
		|	ЗаказТовары.Ссылка";
		
		Запрос.УстановитьПараметр("Артикул", "%" + ФильтрАртикулНаименование + "%");
		Запрос.УстановитьПараметр("Наименование", "%" + ФильтрАртикулНаименование + "%");
		
		СписокСсылокДляОтбора.ЗагрузитьЗначения(Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка"));
		ОтборСсылка.ПравоеЗначение = СписокСсылокДляОтбора;	
	Иначе
		ОтборСсылка =  Список.КомпоновщикНастроек.Настройки.Отбор.Элементы[1];
		ОтборСсылка.Использование = Ложь;		
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ФильтрАртикулНаименованиеПриИзменении(Элемент)
	ФильтрАртикулНаименованиеПриИзмененииНаСервере();
КонецПроцедуры



