
&НаКлиенте
Процедура КомандаДобавить(Команда)
		СтруктураВозврата = Новый Структура;
		СтруктураВозврата.Вставить("Номенклатура",ТекНоменклатура);
		СтруктураВозврата.Вставить("ХарактеристикаНоменклатуры",ТекХарактеристикаНом);
		СтруктураВозврата.Вставить("ЕдиницаИзмерения",ТекЕдиницаИзмерения);
		СтруктураВозврата.Вставить("Количество",Количество);
		СтруктураВозврата.Вставить("Штрихкод",ТекШтрихкод);
		
		//ОповеститьОВыборе(СтруктураВозврата);
		ВладелецФормы.ВладелецФормы.ВладелецФормы.ОбработкаВыбора(СтруктураВозврата,ЭтаФорма);
		Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура КомандаЗакрыть(Команда)
	Закрыть();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ТекНоменклатура = Параметры.Номенклатура;
	ТекХарактеристикаНом = Параметры.Характеристика;
	ТекЕдиницаИзмерения = Параметры.ЕдиницаИзмерения;
	ТекКоличество = Параметры.Остаток;
	Количество = 1;
	ТекШтрихкод = Параметры.Штрихкод;
КонецПроцедуры
