Перем мЭтоОбмен Экспорт;

Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр Продажи 
	Движения.Продажи.Записывать = Истина;
	Для Каждого ТекСтрокаТовары Из Товары Цикл
		Движение = Движения.Продажи.Добавить();
		Движение.Период = Дата;
		Движение.Номенклатура = ТекСтрокаТовары.Номенклатура;
		Движение.ЕдиницаИзмерения = ТекСтрокаТовары.ЕдиницаИзмерения;
		Движение.ХарактеристикаНоменклатуры = ТекСтрокаТовары.ХарактеристикаНоменклатуры;
		Движение.Количество = - ТекСтрокаТовары.Количество;
		Движение.Цена = ТекСтрокаТовары.Цена;
		Движение.ЦенаПартнера = ТекСтрокаТовары.ЦенаПартнера;
	КонецЦикла;
	
	// регистр ДолгПартнеру 
	
	//ВсегоДолг = 0;
	//Для Каждого ТекСтрокаТовары Из Товары Цикл
	//	ВсегоДолг = ВсегоДолг + (ТекСтрокаТовары.Цена * Движение.Количество) - (ТекСтрокаТовары.ЦенаПартнера * Движение.Количество)
	//КонецЦикла;
	//	Движения.ДолгПартнеру.Записывать = Истина;
	//	Движение = Движения.ДолгПартнеру.Добавить();
	//	Движение.Период = Дата;
	//	//Движение.Номенклатура = ТекСтрокаТовары.Номенклатура;
	//	//Движение.ЕдиницаИзмерения = ТекСтрокаТовары.ЕдиницаИзмерения;
	//	//Движение.ХарактеристикаНоменклатуры = ТекСтрокаТовары.ХарактеристикаНоменклатуры;
	//	//Движение.Количество = ТекСтрокаТовары.Количество;
	//	//Движение.Цена = ТекСтрокаТовары.Цена;
	//	//Движение.ЦенаПартнера = ТекСтрокаТовары.ЦенаПартнера;
	//	Движение.Сумма = - ВсегоДолг;

		
// регистр ОстаткиТоваров 
	Движения.ОстаткиТоваров.Записывать = Истина;
	Для Каждого ТекСтрокаТовары Из Товары Цикл
		Движение = Движения.ОстаткиТоваров.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Номенклатура = ТекСтрокаТовары.Номенклатура;
		Движение.ЕдиницаИзмерения = ТекСтрокаТовары.ЕдиницаИзмерения;
		Движение.ХарактеристикаНоменклатуры = ТекСтрокаТовары.ХарактеристикаНоменклатуры;
		Движение.Количество = - ТекСтрокаТовары.Количество;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	Если мЭтоОбмен <> Истина Тогда 
		Общий.ЗарегистрироватьИзменения(ЭтотОбъект.Ссылка);
	КонецЕсли;
КонецПроцедуры
