

&НаКлиенте
Перем УИДФормы;
&НаКлиенте
Перем мЗакрытиеСПараметром;

&НаКлиенте
перем СписокКлиентов;

&НаКлиенте
Процедура ТоварыНоменклатураПриИзменении(Элемент)
	Если Элементы.Товары.ТекущиеДанные.Количество = 0 Тогда 
		Элементы.Товары.ТекущиеДанные.Количество = 1;
	КонецЕсли;	
	
КонецПроцедуры



&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора) Экспорт
	Если ТипЗнч(ВыбранноеЗначение) = Тип("СправочникСсылка.Номенклатура") Тогда 
		ШКТовара = Общий.ПолучитьШтрихкодТовара(ВыбранноеЗначение);
		
		СтруктураТовара = Общий.ПолучитьДанныеТовараПоШК(Строка(ШКТовара));		
		ДобавитьТовар(ВыбранноеЗначение,ВыбранноеЗначение.ХарактеристикаНоменклатуры,СтруктураТовара.ЕдиницаИзмерения,1,СтруктураТовара.Штрихкод);
		ФормаДобавления = ПолучитьФорму("Справочник.Номенклатура.ФормаСписка",Новый Структура("РежимВыбора",Истина),ЭтаФорма);
		ФормаДобавления.Открыть();
		
	ИначеЕсли ТипЗнч(ВыбранноеЗначение) = Тип("Строка") Тогда
		Объект.Коментар = ВыбранноеЗначение;
	Иначе
		Если ВыбранноеЗначение.УИД <> УИДФормы Тогда 
			Возврат;
		КонецЕсли;
		
		Если ВыбранноеЗначение.Количество = 0 Тогда 
			Сообщить("Не хватает остатка: "+ВыбранноеЗначение.Номенклатура+", "+ВыбранноеЗначение.ХарактеристикаНоменклатуры);
			Возврат;
		КонецЕсли;
		ДобавитьТовар(ВыбранноеЗначение.Номенклатура,ВыбранноеЗначение.ХарактеристикаНоменклатуры,ВыбранноеЗначение.ЕдиницаИзмерения,ВыбранноеЗначение.Количество,ВыбранноеЗначение.Штрихкод);
		ФормаДобавления = ПолучитьФорму("Справочник.Номенклатура.ФормаСписка",Новый Структура("РежимВыбора",Истина),ЭтаФорма);
		ФормаДобавления.Открыть();
		
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)

	Если ИмяСобытия = "Подбор" Тогда 
		Если Параметр.УИД <> УИДФормы Тогда 
			Возврат;
		КонецЕсли;
		
		ВыбранноеЗначение =  Параметр;
		Если ТипЗнч(ВыбранноеЗначение) = Тип("СправочникСсылка.Номенклатура") Тогда 
			ШКТовара = Общий.ПолучитьШтрихкодТовара(ВыбранноеЗначение);
			
			СтруктураТовара = Общий.ПолучитьДанныеТовараПоШК(Строка(ШКТовара));		
			ДобавитьТовар(ВыбранноеЗначение,,СтруктураТовара.ЕдиницаИзмерения,1,СтруктураТовара.Штрихкод);
			//Сообщить("Товар додано");
			
		ИначеЕсли ТипЗнч(ВыбранноеЗначение) = Тип("Строка") Тогда
			Объект.Коментар = ВыбранноеЗначение;
		Иначе		
			Если ВыбранноеЗначение.Количество = 0 Тогда 
				Сообщить("Не хватает остатка: "+ВыбранноеЗначение.Номенклатура+", "+ВыбранноеЗначение.ХарактеристикаНоменклатуры);
				Возврат;
			КонецЕсли;
			ДобавитьТовар(ВыбранноеЗначение.Номенклатура,ВыбранноеЗначение.ХарактеристикаНоменклатуры,ВыбранноеЗначение.ЕдиницаИзмерения,ВыбранноеЗначение.Количество,ВыбранноеЗначение.Штрихкод);
			//ДобавитьТовар(ВыбранноеЗначение.Номенклатура,,ВыбранноеЗначение.ЕдиницаИзмерения,ВыбранноеЗначение.Количество,ВыбранноеЗначение.Штрихкод);
			
			//Сообщить("Товар додано");
		КонецЕсли;	
	КонецЕсли;
	
	ЗаписатьПриИзменении(); //intrata_wald_02072021
	
КонецПроцедуры



&НаКлиенте
Процедура ИзменитьТовары(Команда)
	Если Не ЗначениеЗаполнено(Объект.Контрагент) Тогда 
		Предупреждение("Виберіть спочатку контрагента",30,"Доступ до підбору заборонений");
		Возврат;
	КонецЕсли;
	
	ФормаДобавления = ПолучитьФорму("Справочник.Номенклатура.ФормаСписка",Новый Структура("РежимВыбора,Товары,УИД",Истина,ПолучитьТоварыДокумента(),УИДФормы),ЭтаФорма);
	
	//Для Каждого Строка Из Объект.Товары Цикл
	//	НовСтрока = ФормаДобавления.ТаблицаВыбора.Добавить();
	//	ЗаполнитьЗначенияСвойств(НовСтрока,Строка);
	//КонецЦикла;
	
	ФормаДобавления.Открыть();
	ЗаписатьПриИзменении(); //intrata_wald_02072021
	
КонецПроцедуры

&НаСервере
Функция ПолучитьТоварыДокумента()
	сз = Новый СписокЗначений;
	Для Каждого Строка Из Объект.Товары Цикл
		сз.Добавить(Строка.Номенклатура);
	КонецЦикла;
	Возврат сз;
КонецФункции



&НаКлиенте
Процедура УдалитьСтроку(Команда)
	Если Объект.Товары.Количество() Тогда 
		Объект.Товары.Удалить(Объект.Товары.Индекс(Элементы.Товары.ТекущиеДанные));
	КонецЕсли;
	ЗаписатьПриИзменении(); //intrata_wald_02072021
КонецПроцедуры

&НаКлиенте
Процедура КомандаЗакрыть(Команда)
	ЗаписатьПриИзменении(); //intrata_wald_02072021
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура СканироватьШК(Команда)
	#Если МобильноеПриложениеКлиент Тогда
		
		ОбработчикСканирования = Новый ОписаниеОповещения("ОбработкаСканирования", ЭтаФорма);	
		СредстваМультимедиа.ПоказатьСканированиеШтрихКодов("Сканируйте штрихкоды",ОбработчикСканирования);
		
	#Иначе
		СтрокаШК = "";
		Если ВвестиСтроку(СтрокаШК, "Введите ШК вручную") Тогда 
			ОбработкаСканирования(СтрокаШК, Истина, "",);	
		КонецЕсли;
		
	#КонецЕсли
	
	ЗаписатьПриИзменении(Истина); //intrata_wald_02072021
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаСканирования(Штрихкод, Результат, Сообщение, ДополнительныеПараметры) Экспорт
	Перем ТекстСообщения;
	
	#Если МобильноеПриложениеКлиент Тогда
		СредстваМультимедиа.ЗакрытьСканированиеШтрихКодов();
	#КонецЕсли
	
	//СтруктураТовара = Общий.ПолучитьДанныеТовараПоШК(СокрЛП(Штрихкод), Объект.ТипЦен);
	СтруктураТовара = Общий.ПолучитьДанныеТовараПоШК(СокрЛП(Штрихкод), Неопределено);
	Если СтруктураТовара = "" Тогда 
		Сообщить("Не найден товар " + Штрихкод);
		Возврат;
	КонецЕсли;
	
	//Если АктивнаБроньМішка(СтруктураТовара.Характеристика,  ТекстСообщения) Тогда 
	//	Сообщить(ТекстСообщения);
	//	Возврат;
	//КонецЕсли;
	
	//#Если НЕ МобильноеПриложениеКлиент Тогда
	//	Если Не ПеревіритиЗалишокТовару(СтруктураТовара.Номенклатура, СтруктураТовара.Характеристика) Тогда
	//		Возврат;
	//	КонецЕсли;	
	//#КонецЕсли	
		
	
	ДобавитьТовар(СтруктураТовара.Номенклатура, СтруктураТовара.Характеристика, СтруктураТовара.ЕдиницаИзмерения, 1, СокрЛП(Штрихкод));
	
	
	
КонецПроцедуры

&НаСервере
Функция АктивнаБроньМішка(Мішок, Текст)
	Если ПустаяСтрока(Мішок.ВерсияДанных) Тогда 
		Возврат Ложь;
	КонецЕсли;
	
	Текст = "Активна бронь мішка до " + Формат(Мішок.ПериодБрони,  "ДФ=dd.MM.yyyy /")  + Мішок.Бронь; 
	Возврат Мішок.ПериодБрони > ТекущаяДата() И Не Мішок.МояБронь 
	
КонецФункции

&НаКлиенте
Процедура ТоварыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ=Истина;
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьШКБыстро(Команда)
	ДобавитьШКБыстроКод = Формат(ДобавитьШКБыстро,"ЧДЦ=; ЧГ=0");
	СтруктураТовара = Общий.ПолучитьДанныеТовараПоШК(Строка(ДобавитьШКБыстроКод));
	Если СтруктураТовара = "" Тогда 
		Сообщить("Не найден товар "+ДобавитьШКБыстроКод);
		Возврат;
	КонецЕсли;
	
	УжеВТаблице = 0;
	СтрокиТовара = Объект.Товары.НайтиСтроки(Новый Структура("Номенклатура,ХарактеристикаНоменклатуры,ЕдиницаИзмерения",СтруктураТовара.Номенклатура,СтруктураТовара.Характеристика,СтруктураТовара.ЕдиницаИзмерения));
	Для Каждого Строка Из СтрокиТовара Цикл
		УжеВТаблице = УжеВТаблице + Строка.Количество;
	КонецЦикла;
	СтруктураТовара.Вставить("УжеВТаблице",УжеВТаблице);
	
	
	ФормаПодтверждения = ПолучитьФорму("Документ.Презентація.Форма.ФормаПодтверждения",СтруктураТовара,ЭтаФорма);	
	ФормаПодтверждения.Открыть();
	//ДобавитьТовар(СтруктураТовара.Номенклатура,СтруктураТовара.Характеристика,СтруктураТовара.ЕдиницаИзмерения,1,ДобавитьШКБыстроКод);
	ДобавитьШКБыстро = 0;
	
	ЗаписатьПриИзменении(Истина); //intrata_wald_02072021
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьТовар(Номенклатура,ХарактеристикаНоменклатуры,ЕдиницаИзмерения,Количество,Штрихкод)
	СтрокиТовара = Объект.Товары.НайтиСтроки(Новый Структура("Номенклатура",Номенклатура));
	НовСтр = Неопределено;
	//Если СтрокиТовара.Количество() Тогда 
	//	Сообщить("Товар уже добавлен!");
	//	Возврат;
	//	НовСтр = СтрокиТовара[0];
	//	//НовСтр.Количество = НовСтр.Количество + Количество;
	//	//НовСтр.Сума = НовСтр.Количество * НовСтр.Цена;
	//Иначе
		НовСтр = Объект.Товары.Добавить();
		НовСтр.Номенклатура = Номенклатура;  
		
		Если Не ЗначениеЗаполнено(ХарактеристикаНоменклатуры) Тогда

			СтруктураТовара = Общий.ПолучитьДанныеТовараПоШК(СокрЛП(Штрихкод), Неопределено);
			Если СтруктураТовара = "" Тогда 
				Сообщить("Не найден товар " + Штрихкод);
				Возврат;
			КонецЕсли;
			
			НовСтр.ХарактеристикаНоменклатуры = СтруктураТовара.Характеристика;			
		Иначе	
			НовСтр.ХарактеристикаНоменклатуры = ХарактеристикаНоменклатуры;
		КонецЕсли;	
		//НовСтр.ЕдиницаИзмерения = ЕдиницаИзмерения;
		
		//Вага = 20;
		//Попытка
		//	Вага = Число(Строка(ХарактеристикаНоменклатуры));
		//Исключение
		//КонецПопытки;
		//НовСтр.Количество = Количество;
		
		//НовСтр.Штрихкод = Штрихкод;
		
		//Если Цена > 0 Тогда 
		//	НовСтр.ЦенаПродажиВес = Цена;
		//	НовСтр.Цена = Цена * Вага;
		//Иначе
		//	НовСтр.ЦенаПродажиВес = Общий.ПолучитьЦенуНоменклатуры(Номенклатура,ХарактеристикаНоменклатуры,ТипЦен);
		//	НовСтр.Цена = НовСтр.ЦенаПродажиВес * Вага;
		//КонецЕсли;
		//НовСтр.Сума = Количество * НовСтр.Цена;
	//КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	//Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
	//	Элементы.ГруппаДоступа.Доступность = Ложь;
	//	Элементы.Товары.ТолькоПросмотр = Истина;
	//	Элементы.Дата.Доступность = Ложь;
	//КонецЕсли;
	//Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда 
	//	ВивантажуватиВ1С = Ложь;
	////#Если МобильноеПриложениеКлиент Тогда
	////    ПодключитьОпросКоординат();
	////#КонецЕсли		
	//КонецЕсли;
	
	УИДФормы = Новый УникальныйИдентификатор();
	
	//Элементы.ПодборИзЗагрузки.Доступность = ЗначениеЗаполнено(Объект.МаршрутныйЛист);
	//Элементы.ВивантажуватиВ1С.Доступность = Объект.ВідправленоВВайбер;
	//Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
	//	Объект.ВивантажуватиВ1С = Ложь;
	//	Объект.ПризначитиПродажТорговомуКонтрагента = Истина
	//КонецЕсли;
	мЗакрытиеСПараметром = Ложь;
	
	Для Каждого стрТовар Из Объект.Товары Цикл
		
	КонецЦикла;	
КонецПроцедуры

#Если МобильноеПриложениеКлиент Тогда
	
	&НаКлиенте
	Процедура ПодключитьОпросКоординат(Провайдер = "network")  
		//Попытка
		//    СекундыНаОбновление = 1; // По умолчанию 30 минут, задается в константах
		//    МассивПровайдеров = СредстваГеопозиционирования.ПолучитьПровайдеров();
		//    Инд = 0;
		//    Для Каждого ТекущийПровайдер Из МассивПровайдеров Цикл
		//        Если ТекущийПровайдер.Имя = "passive" Тогда
		//            Продолжить;
		//        КонецЕсли;
		//        ЧастотаОбновления = СекундыНаОбновление + Инд;
		//       // ОписаниеОповещения = Новый ОписаниеОповещения("ОпросКоординат");
		//		ОпсианиеОповещения = Новый ОписаниеОповещения("ОпросКоординат", ЭтаФорма); 
		//        СредстваГеопозиционирования.ПодключитьОбработчикИзмененияМестоположения(ОпсианиеОповещения, ТекущийПровайдер.Имя, , ЧастотаОбновления);
		//        Инд = Инд + 1;
		//    КонецЦикла;
		//    
		//Исключение
		//    Сообщить("Ошибка получения координат. Причина: " + ОписаниеОшибки());
		//КонецПопытки;
	КонецПроцедуры // ПодключитьОпросКоординат
	
	
	&НаКлиенте
	Процедура ОпросКоординат(ИмяПровайдера, ДанныеМестоположения, ДополнительныеДанные) Экспорт 
		////РаботаСГеоданнымиСервер.ЗафиксироватьКоординаты(ИмяПровайдера, ДанныеМестоположения); // Тут запись в регистр сведений
		
		//Если Объект.Широта > 0 Тогда 
		//	ОпсианиеОповещения = Новый ОписаниеОповещения("ОпросКоординат", ЭтаФорма);
		//	СредстваГеопозиционирования.ОтключитьОбработчикИзмененияМестоположения(ОпсианиеОповещения, ИмяПровайдера);
		//	Возврат;
		//КонецЕсли;
		//
		//Если ДанныеМестоположения.Координаты.Широта > 0 Тогда 
		//	Объект.Широта = ДанныеМестоположения.Координаты.Широта;
		//	Объект.Долгота = ДанныеМестоположения.Координаты.Долгота;
		//	//Сообщить(Объект.Широта);
		//	//Сообщить(Объект.Долгота);
		
		//КонецЕсли;
	КонецПроцедуры // ОпросКоординат
	
#КонецЕсли

&НаКлиенте
Процедура ДодатиКоментар(Команда)
	ФормаДобавления = ПолучитьФорму("Документ.Презентація.Форма.ФормаВводаКоментаря",Новый Структура("Коментар",Объект.Коментар),ЭтаФорма);
	ФормаДобавления.Открыть();
	ЗаписатьПриИзменении(Истина); //intrata_wald_02072021
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	//ТипЦенКонтрагента = ПолучитьТипЦенКонтрагента(Объект.Контрагент);
	//Если ЗначениеЗаполнено(ТипЦенКонтрагента) Тогда 
	//	Объект.ТипЦен = ТипЦенКонтрагента;
	//КонецЕсли;
	//Объект.СкладКонтрагента = ПолучитьСкладКонтрагента(Объект.Контрагент);
	//Объект.ПершаФорма = Ложь;
	//Объект.НомерВідділенняНП = ПолучитьНомерОтделенияКонтрагента(Объект.Контрагент);
	//ИнфоБорг();
	//ЗаписатьПриИзменении(); //intrata_wald_02072021
	
КонецПроцедуры

Процедура  ИнфоБорг()
	если Не Объект.ПершаФорма  тогда
		Борг = Объект.Контрагент.Борг;
		ПростроченийБорг =Объект.Контрагент.ПросроченийБорг; 
	иначе
		Борг = Объект.Контрагент.БоргТзОВ;
		ПростроченийБорг =Объект.Контрагент.ПросроченийБоргТзОВ;
	КонецЕсли;
	
	если Борг > 0 Тогда
		//+wald_intrata_19112021
		//Текст = "Борг: " +Борг+" EUR";
		Текст = ?(Объект.Наложка, "Наложка: ", "Борг: ") +Борг+" EUR";
		//-wald_intrata_19112021
	иначе 
		текст= "";
	КонецЕсли;
	если  ПростроченийБорг >0 Тогда
		если текст = "" тогда 
			ТекстПР =  "Прострочений борг: " + ПростроченийБорг+" EUR."; 
		иначе
			
			ТекстПР =  ", прострочений борг: " + ПростроченийБорг+" EUR.";
		КонецЕсли;
	иначе 
		текстПр= "";
	КонецЕсли;
	Элементы.Борги.Заголовок = Текст +ТекстПР;
КонецПроцедуры


&НаСервереБезКонтекста
Функция ПолучитьТипЦенКонтрагента(Контрагент)
	Возврат Контрагент.ТипЦен;
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьСкладКонтрагента(Контрагент)
	з = Новый Запрос;
	з.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	|	СкладыКонтрагентов.Ссылка КАК Склад
	|ИЗ
	|	Справочник.СкладыКонтрагентов КАК СкладыКонтрагентов
	|ГДЕ
	|	СкладыКонтрагентов.Контрагент = &Контрагент";
	з.УстановитьПараметр("Контрагент",Контрагент);
	Выборка = З.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Склад;
	Иначе 
		Возврат Справочники.СкладыКонтрагентов.ПустаяСсылка();
	КонецЕсли;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьНомерОтделенияКонтрагента(Контрагент)
	Возврат Контрагент.НомерВідділенняНП
КонецФункции


&НаКлиенте
Процедура ПершаФормаПриИзменении(Элемент)
	Если НЕ Общий.Можно1Форму(Объект.Контрагент,Объект.СкладКонтрагента) Тогда 
		Сообщить("Не можна встановлювати 1 форму. Прострочена ліцензія!");
		Объект.ПершаФорма = Ложь;
	КонецЕсли;
	ИнфоБорг();	
	ЗаписатьПриИзменении(); //intrata_wald_02072021
КонецПроцедуры

&НаКлиенте
Процедура СкладКонтрагентаПриИзменении(Элемент)
	СкладКонтрагентаПриИзмененииНаСервере();
	Объект.ПершаФорма = Ложь;
КонецПроцедуры

&НаСервере
Процедура СкладКонтрагентаПриИзмененииНаСервере()
	Объект.ПершаФорма = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Перем ОтветПроверкиТЧ;
	//Список = ПроверитьРекомендации();	
	//Если НЕ Список.Количество() = 0 Тогда
	//	Если Вопрос("Ви не додали всі рекомендовані позиції. Записати?",РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Нет Тогда
	//		Отказ = Истина;
	//		Возврат;
	//	КонецЕсли; 	
	//КонецЕсли;
	
	//СообщениеОтклонений = ПроверитьОтклонениеПоЦенам();
	//Если СообщениеОтклонений <> "" Тогда 
	//	
	//	
	//	Если Вопрос("Дійсно зберегти продаж? " + Символы.ПС + СообщениеОтклонений, РежимДиалогаВопрос.ДаНет,60, КодВозвратаДиалога.Нет, "Контроль цен накладной") = КодВозвратаДиалога.Нет Тогда 
	//		
	//		
	//		
	//		Отказ = Истина;
	//		Возврат;
	//	КонецЕсли;
	//КонецЕсли;
	
	//ПроверкаТЧТовары(ОтветПроверкиТЧ);
	//
	//Если ОтветПроверкиТЧ.Отказ Тогда 
	//	Отказ = Истина;
	//	ПоказатьПредупреждение(,СокрЛП(ОтветПроверкиТЧ.Ошибка));
	//КонецЕсли;
	
	
	Объект.Архив = Ложь;
	
КонецПроцедуры

&НаСервере
Процедура ПроверкаТЧТовары(Параметры)
	Товары =Объект.Товары;
	Параметры = Новый  Структура("Отказ, Ошибка", Ложь, "");
	УдалитьСтроки = Новый Массив;
	ВыдатьОшибку = Новый Массив;
	
	ДЛя Каждого Стр Из Товары Цикл
		
		Если НЕ (ЗначениеЗаполнено(Стр.Номенклатура)
			И ЗначениеЗаполнено(Стр.ХарактеристикаНоменклатуры)
			И ЗначениеЗаполнено(Стр.Количество)
			И ЗначениеЗаполнено(Стр.Цена)) Тогда 
			
			Если ЗначениеЗаполнено(Стр.Номенклатура)
				Или ЗначениеЗаполнено(Стр.ХарактеристикаНоменклатуры)
				Или ЗначениеЗаполнено(Стр.Количество)
				Или ЗначениеЗаполнено(Стр.Цена) Тогда 
				
				Колонки = "";
				Если Не ЗначениеЗаполнено(Стр.Номенклатура) Тогда 
					Колонки = "номенклатура"
				КонецЕсли;
				
				Если Не ЗначениеЗаполнено(Стр.ХарактеристикаНоменклатуры) Тогда 
					Колонки = Колонки + ?(ЗначениеЗаполнено(Колонки), ", ", "") + "вага";
				КонецЕсли;
				
				Если Не ЗначениеЗаполнено(Стр.Количество) Тогда 
					Колонки = Колонки + ?(ЗначениеЗаполнено(Колонки), ", ", "") + "кількість"
				КонецЕсли;
				
				Если Не ЗначениеЗаполнено(Стр.Цена) Тогда 
					Колонки = Колонки + ?(ЗначениеЗаполнено(Колонки), ", ", "") + "ціна"
				КонецЕсли;
				мСтруктура = Новый  Структура("Стр, Колонки", Стр, Колонки);
				ВыдатьОшибку.Добавить(мСтруктура);
			Иначе
				УдалитьСтроки.Добавить(Стр);
			КонецЕсли;
		КонецЕсли;	
	КонецЦикла;
	
	ДЛя Каждого Стр Из УдалитьСтроки Цикл
		Товары.Удалить(Стр);
	КонецЦикла;
	
	ДЛя Каждого элемент Из ВыдатьОшибку Цикл
		Параметры.Отказ  = Истина;
		Параметры.Ошибка = Параметры.Ошибка + Символы.ПС + "В рядку №" + (Товары.Индекс(элемент.Стр) + 1)  + " не заповнено колонки: " + элемент.Колонки;	
	КонецЦикла;
	

	
КонецПроцедуры


&НаСервере
Функция ПроверитьРекомендации() Экспорт 
	
	СписокРекомендаций = Новый СписокЗначений;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	Номенклатура.Ссылка
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	Номенклатура.Рекомендация";
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Если Объект.Товары.НайтиСтроки(Новый Структура("Номенклатура",Выборка.Ссылка)).Количество() = 0 Тогда
			СписокРекомендаций.Добавить(Выборка.Ссылка);
		КонецЕсли;	
	КонецЦикла;
	
	Возврат СписокРекомендаций;
	
КонецФункции

//&НаСервере
//Функция ПроверитьОтклонениеПоЦенам() Экспорт 
//	
//	з = Новый Запрос;
//	з.Текст = "ВЫБРАТЬ
//	|	ЦеныНоменклатуры.Номенклатура КАК Номенклатура,
//	|	МИНИМУМ(ЦеныНоменклатуры.Цена) КАК Цена
//	|ИЗ
//	|	РегистрСведений.ЦеныНоменклатуры КАК ЦеныНоменклатуры
//	|ГДЕ
//	|	ЦеныНоменклатуры.ТипЦен = &ТипЦен
//	|	И ЦеныНоменклатуры.Номенклатура В(&СписокНоменклатуры)
//	|
//	|СГРУППИРОВАТЬ ПО
//	|	ЦеныНоменклатуры.Номенклатура";
//	з.УстановитьПараметр("ТипЦен", Объект.ТипЦен);
//	з.УстановитьПараметр("СписокНоменклатуры", Объект.Товары.Выгрузить().ВыгрузитьКолонку("Номенклатура"));
//	//з.УстановитьПараметр("СписокХарактеристик", Объект.Товары.Выгрузить().ВыгрузитьКолонку("ХарактеристикаНоменклатуры"));
//	ТЗ = з.Выполнить().Выгрузить();
//	ТекстСообщения = "";
//	Для Каждого Стр Из Объект.Товары Цикл
//		СтрокиТЗ = Тз.НайтиСтроки(Новый Структура("Номенклатура", Стр.Номенклатура)); 
//		Если НЕ СтрокиТЗ.Количество() Тогда 
//			Продолжить;
//		КонецЕсли;
//		ЦенаЭталон = СтрокиТЗ[0].Цена;
//		Если ЦенаЭталон = 0 Тогда 
//			Продолжить;
//		КонецЕсли;
//		
//		Разница = ЦенаЭталон - Стр.ЦенаПродажиВес;
//		Если Разница < 0 Тогда 
//			Разница = -1 * Разница;
//		КонецЕсли;
//		
//		Если Разница > 0.20 Тогда 
//			ТекстСообщения = ТекстСообщения + "Товар "+ Стр.Номенклатура + " вага: " + Стр.ХарактеристикаНоменклатуры + "кг ціна має бути " + ЦенаЭталон + ", є: " + Стр.ЦенаПродажиВес + Символы.ПС;
//		КонецЕсли;
//		
//		
//		
//	КонецЦикла;
//	
//	
//	
//	Возврат ТекстСообщения;
//	
//КонецФункции

&НаСервере
Процедура ТипЦенПриИзмененииНаСервере()
	Для Каждого Строка ИЗ Объект.Товары Цикл
		Строка.ЦенаПродажиВес = Общий.ПолучитьЦенуНоменклатуры(Строка.Номенклатура,Строка.ХарактеристикаНоменклатуры,Объект.ТипЦен);
		Вес = Строка.ХарактеристикаНоменклатуры.Вага;
		Если Вес = 0 Тогда 
			Попытка
				Вес = Число(Строка(Строка.ХарактеристикаНоменклатуры));
			Исключение
				Вес = 20;
			КонецПопытки;
		КонецЕсли;
		Строка.Цена = Строка.ЦенаПродажиВес * Вес;
		Строка.Сума = Строка.Цена * Строка.Количество;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ТипЦенПриИзменении(Элемент)
	ТипЦенПриИзмененииНаСервере();
	ЗаписатьПриИзменении(); //intrata_wald_02072021
КонецПроцедуры

&НаСервере
Процедура ТоварыПриИзмененииНаСервере()
	//ПересчитатьСуммы();
КонецПроцедуры

//&НаСервере
//Процедура ПересчитатьСуммы()
//	Для Каждого Строка ИЗ Объект.Товары Цикл
//		Если Строка.Знижка Тогда 
//			Продолжить;
//		КонецЕсли;
//		
//		Вес = Строка.ХарактеристикаНоменклатуры.Вага;
//		Если Вес = 0 Тогда 
//			Попытка
//				Вес = Число(Строка(Строка.ХарактеристикаНоменклатуры));
//			Исключение
//				Вес = 20;
//			КонецПопытки;
//		КонецЕсли;
//		
//		Строка.Цена = Строка.ЦенаПродажиВес * Вес;
//		Строка.Сума = Строка.Цена * Строка.Количество;
//	КонецЦикла;
//	
//	Объект.Сума = Объект.Товары.Итог("Сума");	
//	
//КонецПроцедуры

&НаКлиенте
Процедура ТоварыПриИзменении(Элемент)
	ТоварыПриИзмененииНаСервере();
	ЗаписатьПриИзменении(); //intrata_wald_02072021
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	//ПересчитатьСуммы();
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
	//	Объект.КурсEUR = Константы.КурсEUR.Получить();
	//	Объект.КурсUSD = Константы.КурсUSD.Получить();
	//	
	//	Если Не (ЗначениеЗаполнено(Объект.КурсEUR) 
	//		И ЗначениеЗаполнено(Объект.КурсUSD)) Тогда  
	//		Сообщить("Виконайте обмін, не заповнені курси валют");
	//		Отказ = Истина;
	//	КонецЕсли;
	//КонецЕсли;
	
	//Если Не ЗначениеЗаполнено(Объект.ТипЦен) Тогда 
	//	з = Новый Запрос;
	//	з.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	//	|	ТипыЦенНоменклатуры.Ссылка КАК Ссылка
	//	|ИЗ
	//	|	Справочник.ТипыЦенНоменклатуры КАК ТипыЦенНоменклатуры";
	//	Выборка = з.Выполнить().Выбрать();
	//	Если Выборка.Следующий() Тогда 
	//		Объект.ТипЦен = Выборка.Ссылка;
	//	КонецЕсли;
	//КонецЕсли;
	Если Не ЗначениеЗаполнено(Объект.Доставка) Тогда 
		Объект.Доставка = Перечисления.НаявністьДоставки.Доставка;
	КонецЕсли;
	
	//Если Параметры.Свойство("МаршрутныйЛист") Тогда
	//	Попытка
	//	Объект.Контрагент 		= Параметры.Контрагент;
	//	Объект.Сделка 			= Параметры.Сделка;
	//Исключение
	//	КонецПопытки;
	//	Объект.МаршрутныйЛист 	= Параметры.МаршрутныйЛист;
	//	Объект.Неплановая 		= Параметры.Неплановая;
	//	Объект.Наложка          = Параметры.Наложка;
	//КонецЕсли;	
	
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура КонтрагентАвтоПодборНаСервере(Текст, ДанныеВыбора)
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Контрагенты.Ссылка КАК Ссылка,
	|	Контрагенты.Город КАК Город,
	|	Контрагенты.Наименование КАК Наименование
	|ИЗ
	|	Справочник.Контрагенты КАК Контрагенты
	|ГДЕ
	|	(Контрагенты.Наименование ПОДОБНО &Текст
	|			ИЛИ Контрагенты.НомерТелефона ПОДОБНО &Текст)";
	
	Запрос.УстановитьПараметр("Текст", "%"+ Текст + "%");
	
	Выборка = Запрос.Выполнить().Выгрузить();
	ДанныеВыбора = Новый СписокЗначений;
	Для Каждого Элемент Из Выборка Цикл 
		ДанныеВыбора.Добавить(Элемент.Ссылка, Элемент.Наименование + " (" + Элемент.Город + ")");
	 КонецЦикла;
	 
	ДанныеВыбора.ЗагрузитьЗначения(Выборка.ВыгрузитьКолонку("Ссылка"));
КонецПроцедуры

&НаКлиенте

Процедура КонтрагентАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	//КонтрагентАвтоПодборНаСервере(Текст, ДанныеВыбора);
	
	//ПараметрыПолученияДанных.СпособПоискаСтроки =  СпособПоискаСтрокиПриВводеПоСтроке.ЛюбаяЧасть;
	//ПараметрыПолученияДанных.ПолнотекстовыйПоиск = ПолнотекстовыйПоискПриВводеПоСтроке.Использовать;
	ДанныеВыбора = Новый СписокЗначений;
	Для Каждого Элемент Из СписокКлиентов Цикл 
		Если СтрНайти(НРег(Элемент.Значение), НРег(Текст)) Тогда 
			ДанныеВыбора.Добавить(Элемент.Значение, Элемент.Представление);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ТЕСТшк(Команда)
	
	СтрокаШК = "";
	Если ВвестиСтроку(СтрокаШК, "Введите ШК вручную") Тогда 
		ОбработкаСканирования(СтрокаШК, Истина, "",);	
	КонецЕсли;
	ЗаписатьПриИзменении(); //intrata_wald_02072021
	
КонецПроцедуры

&НаКлиенте
Процедура ВвестиШК(Команда)
	
	СтрокаШК = "";
	Если ВвестиСтроку(СтрокаШК, "Введите ШК вручную") Тогда 
		ОбработкаСканирования(СтрокаШК, Истина, "",);	
	КонецЕсли;
	
	ЗаписатьПриИзменении(); //intrata_wald_02072021
	
КонецПроцедуры



&НаСервере
Функция  ТелефонКонтрагента() 
	СЗ = Новый СписокЗначений();
	НомерТелефона = Объект.Контрагент.НомерТелефона;
	Если Не ПустаяСтрока(НомерТелефона) Тогда 
		Для Н=1 по СтрЧислоСтрок(НомерТелефона) Цикл
			СЗ.Добавить(СтрПолучитьСтроку(НомерТелефона, Н));
		КонецЦикла;
	КонецЕсли;
	
	Возврат СЗ;	
КонецФункции                   

&НаСервере
Функция ПолучитьСтатусОплаты()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЕСТЬNULL(ВложенныйЗапрос.СуммаОборот, 0) КАК СуммаОборот
	|ИЗ
	|	(ВЫБРАТЬ
	|		СУММА(ДенежныеСредстваОбороты.СуммаОборот) КАК СуммаОборот
	|	ИЗ
	|		Документ.КассовыйОрдер КАК КассовыйОрдер
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ДенежныеСредства.Обороты(, , Регистратор, ) КАК ДенежныеСредстваОбороты
	|			ПО КассовыйОрдер.Ссылка = ДенежныеСредстваОбороты.Регистратор
	|	ГДЕ
	|		КассовыйОрдер.Основание = &Основание) КАК ВложенныйЗапрос";
	
	Запрос.УстановитьПараметр("Основание", Объект.Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Статус = "в борг";
	
	Если Выборка.Следующий() Тогда 
		Если Выборка.СуммаОборот >= Объект.Сума Тогда 
			Статус = " по передплаті"
		КонецЕсли;
	КонецЕсли;
	Возврат Статус;
	
КонецФункции


#Если МобильноеПриложениеКлиент Тогда
	
	&НаКлиенте
	Процедура ВідправитиКонтрагенту(Команда)
		
		//ПересчитатьСуммы();
		ЗаписатьПриИзменении(Истина); //intrata_wald_02072021

			НомераТелефонов = ТелефонКонтрагента();
		Если НомераТелефонов.Количество() > 1 Тогда 
			ВыбрЗнач = НомераТелефонов.ВыбратьЭлемент("Номер телефона клієнта");
			Если ВыбрЗнач = Неопределено Тогда 
				Возврат;
			КонецЕсли;
			Телефон = ВыбрЗнач.Значение;
		ИначеЕсли  НомераТелефонов.Количество() = 1 Тогда 
			Телефон = НомераТелефонов[0].Значение;
		КонецЕсли;

		
		НовВз = Новый ЗапускПриложенияМобильногоУстройства();
		
		НовВз.Действие = "android.intent.action.SEND";
		НовВз.Приложение = "com.viber.voip"; 
		НовВз.ИмяКласса = "com.viber.voip.WelcomeShareActivity"; 
		НовВз.Тип = "text/plain";
		НовВз.ДополнительныеДанные.Добавить("android.intent.extra.TEXT", Общий.ПолучитьТекстСообщенияВайберДляПрезентации(Объект, Истина, Телефон));
		
		НовВз.Запустить(Истина);
				
	КонецПроцедуры
	
	&НаКлиенте
	Процедура ВідправитиВГрупу(Команда)
		//ПересчитатьСуммы();
		НомераТелефонов = ТелефонКонтрагента();
		Если НомераТелефонов.Количество() > 1 Тогда 
			ВыбрЗнач = НомераТелефонов.ВыбратьЭлемент("Номер телефона клієнта");
			Если ВыбрЗнач = Неопределено Тогда 
				Возврат;
			КонецЕсли;
			Телефон = ВыбрЗнач.Значение;
		ИначеЕсли  НомераТелефонов.Количество() = 1 Тогда 
			Телефон = НомераТелефонов[0].Значение;
		КонецЕсли;
		
		//НовВз.ДополнительныеДанныеЦикл
		Объект.ВідправленоВВайбер = Истина;
		//Объект.ВивантажуватиВ1С = Истина;
		//Элементы.ВивантажуватиВ1С.Доступность = Истина;
		
		Записать(); //intrata_wald_02072021

		
		НовВз = Новый ЗапускПриложенияМобильногоУстройства();
		
		НовВз.Действие = "android.intent.action.SEND";
		НовВз.Приложение = "com.viber.voip"; 
		НовВз.ИмяКласса = "com.viber.voip.WelcomeShareActivity"; 
		НовВз.Тип = "text/plain";
		НовВз.ДополнительныеДанные.Добавить("android.intent.extra.TEXT", Общий.ПолучитьТекстСообщенияВайберДляПрезентации(Объект, Ложь, Телефон));
		
		НовВз.Запустить(Истина);
		
	КонецПроцедуры
	
#Иначе
	&НаКлиенте
	Процедура ВідправитиКонтрагенту(Команда)
		НомераТелефонов = ТелефонКонтрагента();
		Если НомераТелефонов.Количество() > 1 Тогда 
			ВыбрЗнач = НомераТелефонов.ВыбратьЭлемент("Номер телефона клієнта");
			Если ВыбрЗнач = Неопределено Тогда 
				Возврат;
			КонецЕсли;
			Телефон = ВыбрЗнач.Значение;
		ИначеЕсли  НомераТелефонов.Количество() = 1 Тогда 
			Телефон = НомераТелефонов[0].Значение;
		КонецЕсли;
		
		Сообщить(Общий.ПолучитьТекстСообщенияВайберДляПрезентации(Объект, Истина, Телефон));
		
		
	КонецПроцедуры
	
	&НаКлиенте
	Процедура ВідправитиВГрупу(Команда)
		НомераТелефонов = ТелефонКонтрагента();
		
		Если НомераТелефонов.Количество() > 1 Тогда 
			ВыбрЗнач = НомераТелефонов.ВыбратьЭлемент("Номер телефона клієнта");
			Если ВыбрЗнач = Неопределено Тогда 
				Возврат;
			КонецЕсли;
			Телефон = ВыбрЗнач.Значение;
		ИначеЕсли  НомераТелефонов.Количество() = 1 Тогда 
			Телефон = НомераТелефонов[0].Значение;
		КонецЕсли;
		      	Объект.ВідправленоВВайбер = Истина;
		//Объект.ВивантажуватиВ1С = Истина;
		//Элементы.ВивантажуватиВ1С.Доступность = Истина;

		Сообщить( Общий.ПолучитьТекстСообщенияВайберДляПрезентации(Объект, Ложь, Телефон));
		 ЗаписатьПриИзменении(Истина); //intrata_wald_02072021

	КонецПроцедуры
	
#КонецЕсли

&НаСервере
Функция  СтворитиОплатуНаСервере()
	ПКО = Документы.КассовыйОрдер.СоздатьДокумент();
	ПКО.Основание = Объект.Ссылка; 
	ПКО.Контрагент = Объект.Ссылка.Контрагент;
	ПКО.КурсEUR = Объект.КурсEUR;
	ПКО.КурсUSD = Объект.КурсUSD;
	
	ПКО.Дата = ТекущаяДата();
	ПКО.Записать();
	Возврат ПКО.Ссылка;
КонецФункции

&НаКлиенте
Процедура СтворитиОплату(Команда)
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ЗаписатьНаСервере();	
	КонецЕсли;
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда 
		
		Если КонтрольОплати(Объект.Сделка) Тогда 
			ПоказатьПредупреждение(,"По даній реалізації вже є оплата!");
			Возврат;
		КонецЕсли;
		
		ОповещениеСоздания 	= Новый ОписаниеОповещения("ОбработатьСозданиеОплаты", ЭтотОбъект);
		ПараметрыЗаполнения = Новый Структура;
		Если ЗначениеЗаполнено(Объект.МаршрутныйЛист) Тогда 
			ПараметрыЗаполнения.Вставить("МаршрутныйЛист", Объект.МаршрутныйЛист);
		Иначе
			ПараметрыЗаполнения.Вставить("МаршрутныйЛист", Неопределено);
		КонецЕсли;
		ПараметрыЗаполнения.Вставить("ЗаказПокупателя",  Объект.Сделка);
		ПараметрыЗаполнения.Вставить("Реализация", Объект.Ссылка);
		ПараметрыЗаполнения.Вставить("Контрагент", Объект.Контрагент);
		ПараметрыЗаполнения.Вставить("СуммаКОплате", Объект.Сума);
		ОткрытьФорму("Обработка.Оплата.Форма", ПараметрыЗаполнения, ВладелецФормы, , , , ОповещениеСоздания);		
		
		//ОткрытьЗначение(СтворитиОплатуНаСервере());
	Иначе 
		Сообщить("Збережіть документ");
	КонецЕсли;
	ЗаписатьПриИзменении(); //intrata_wald_02072021
КонецПроцедуры


&НаСервере
Процедура ЗаписатьНаСервере() 
	ПараметрыЗаписи = Новый Структура("РежимЗаписи",РежимЗаписиДокумента.Проведение);
	Записать(ПараметрыЗаписи);
КонецПроцедуры


&НаКлиенте
Процедура ОбработатьСозданиеОплаты(МассивДокументов, Параметры) Экспорт 
	Прочитать();
	Если МассивДокументов <> Неопределено Тогда 
		Попытка
			Если ВладелецФормы.ИмяФормы = "Документ.МаршрутныйЛист.Форма.ФормаДокумента" Тогда    
				ВладелецФормы.ЗаполнитьСозданнуюОплату(МассивДокументов);
			КонецЕсли;
		Исключение
		КонецПопытки;
		
	КонецЕсли;
	
	ЗаписатьПриИзменении();
	
КонецПроцедуры



&НаКлиенте
Процедура ОткритьОплаты(Команда)
	Форма = ПолучитьФорму("Документ.КассовыйОрдер.Форма.ФормаСписка");
	ОтборНастройки = Форма.Список.Отбор;
	Отбор = Форма.Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Отбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Основание");
	Отбор.Использование = Истина;
	Отбор.ВидСравнения  = ВидСравненияКомпоновкиДанных.Равно;
	Отбор.ПравоеЗначение = Объект.Ссылка;
	Форма.Открыть();
	ЗаписатьПриИзменении(); //intrata_wald_02072021
КонецПроцедуры


&НаСервере
Функция СсылкаНеПустая()
	Возврат НЕ Объект.Ссылка.Пустая();
КонецФункции


&НаКлиенте
Процедура ЗаписатьПриИзменении(ЗаписыватьНовый = Истина) //intrata_wald_02072021
	
	Если СсылкаНеПустая() ИЛИ ЗаписыватьНовый Тогда
		
		Записать();
	КонецЕсли;
	
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	ЗаписатьПриИзменении(); //intrata_wald_02072021
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентОбластьПриИзменении(Элемент)
	ЗаписатьПриИзменении(); //intrata_wald_02072021
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентГородПриИзменении(Элемент)
	ЗаписатьПриИзменении(); //intrata_wald_02072021
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентНомерТелефонаПриИзменении(Элемент)
	ЗаписатьПриИзменении(); //intrata_wald_02072021
КонецПроцедуры

&НаКлиенте
Процедура ДоставкаПриИзменении(Элемент)
	ЗаписатьПриИзменении(); //intrata_wald_02072021
КонецПроцедуры

&НаКлиенте
Процедура СтатусОплатиПриИзменении(Элемент)
	ЗаписатьПриИзменении(); //intrata_wald_02072021
КонецПроцедуры

&НаКлиенте
Процедура НомерВідділенняНППриИзменении(Элемент)
	ЗаписатьПриИзменении(); //intrata_wald_02072021
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьШКБыстроПриИзменении(Элемент)
	ЗаписатьПриИзменении(); //intrata_wald_02072021
КонецПроцедуры


&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	//Попытка
	//	//Если ВладелецФормы.Имя = "РеализацииРеализация" Тогда 
	//	//	
	//	ТаблицаРеализаций = ВладелецФормы.Элементы.Реализации.ПодчиненныеЭлементы.РеализацииРеализация;
	//	
	//	ТаблицаРеализаций.Родитель.ТекущиеДанные.Реализация = Объект.Ссылка;
	//	ТаблицаРеализаций.Родитель.ТекущиеДанные.Контрагент = Объект.Контрагент;
	//	ТаблицаРеализаций.Родитель.ТекущиеДанные.Сумма 		= Объект.Сума;
	//	//ИначеЕсли ВладелецФормы.Имя = "РеализацииСумма" Тогда 	
	//	//	ВладелецФормы.Родитель.ТекущиеДанные.Сумма 		= Объект.Сума;
	//	//КонецЕсли;	
	//Исключение
	//КонецПопытки;
КонецПроцедуры

&НаКлиенте
Процедура ПовторитьЦену(Команда)
	
	ТекущаяНоменклатура = Элементы.Товары.ТекущиеДанные.Номенклатура;
	ТекущаяЦена 		= Элементы.Товары.ТекущиеДанные.ЦенаПродажиВес;
	
	Для Каждого СтрТовар Из Объект.Товары Цикл 
		Если СтрТовар.Номенклатура = ТекущаяНоменклатура Тогда 
			СтрТовар.ЦенаПродажиВес = ТекущаяЦена;
		КонецЕсли;	
	КонецЦикла;	
	
	ТоварыПриИзмененииНаСервере();
	ЗаписатьПриИзменении();
	
КонецПроцедуры

//&НаСервере
//Функция ПодборИзЗагрузкиНаСервере()
//	
//	МассивТоваров = Новый Массив;
//	
//	Запрос = Новый Запрос;
//	Запрос.Текст = 
//	"ВЫБРАТЬ
//	|	МаршрутныйЛистЗагрузкаМашины.Контрагент КАК Контрагент,
//	|	МаршрутныйЛистЗагрузкаМашины.Штрихкод КАК Штрихкод,
//	|	МаршрутныйЛистЗагрузкаМашины.Номенклатура КАК Номенклатура,
//	|	МаршрутныйЛистЗагрузкаМашины.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
//	|	МаршрутныйЛистЗагрузкаМашины.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
//	|	МаршрутныйЛистЗагрузкаМашины.Цена КАК Цена,
//	|	МаршрутныйЛистЗагрузкаМашины.Количество КАК Количество,
//	|	МаршрутныйЛистЗагрузкаМашины.Сумма КАК Сумма,
//	|	ВЫБОР
//	|		КОГДА МаршрутныйЛистЗагрузкаМашины.ЦенаПродажиВес > 0
//	|			ТОГДА МаршрутныйЛистЗагрузкаМашины.ЦенаПродажиВес
//	|		ИНАЧЕ МаршрутныйЛистЗагрузкаМашины.Цена / МаршрутныйЛистЗагрузкаМашины.ХарактеристикаНоменклатуры.Вага
//	|	КОНЕЦ КАК ЦенаПродажиВес
//	|ИЗ
//	|	Документ.МаршрутныйЛист.ЗагрузкаМашины КАК МаршрутныйЛистЗагрузкаМашины
//	|ГДЕ
//	|	МаршрутныйЛистЗагрузкаМашины.Ссылка = &ТекущийДокумент";
//	Запрос.УстановитьПараметр("ТекущийДокумент", Объект.МаршрутныйЛист);
//	
//	РезультатЗапроса = Запрос.Выполнить();
//	Если НЕ РезультатЗапроса.Пустой() Тогда 
//		ТабТоваров = РезультатЗапроса.Выгрузить();
//		МассивТоваров = Общий.ТаблицаЗначенийВМассив(ТабТоваров);
//	КонецЕсли;	
//	
//	Возврат МассивТоваров;
//	
//КонецФункции

//&НаКлиенте
//Процедура ПодборИзЗагрузки(Команда)
//	
//	ЭтаФорма.ТаблицаПодбора.Очистить();
//	МассивТоваров = ПодборИзЗагрузкиНаСервере();
//	Для Каждого ЭлементМассива Из МассивТоваров Цикл 
//		НоваяСтрока 							= ЭтаФорма.ТаблицаПодбора.Добавить();
//		НоваяСтрока.Штрихкод 					= ЭлементМассива.Штрихкод;
//		НоваяСтрока.Контрагент 					= ЭлементМассива.Контрагент;
//		НоваяСтрока.Номенклатура 				= ЭлементМассива.Номенклатура;
//		НоваяСтрока.ХарактеристикаНоменклатуры 	= ЭлементМассива.ХарактеристикаНоменклатуры;
//		НоваяСтрока.ЕдиницаИзмерения 			= ЭлементМассива.ЕдиницаИзмерения;
//		НоваяСтрока.Цена 						= ЭлементМассива.Цена;
//		НоваяСтрока.Количество 					= ЭлементМассива.Количество;
//		НоваяСтрока.Сумма 						= ЭлементМассива.Сумма;
//		НоваяСтрока.ЦенаПродажиВес              = ЭлементМассива.ЦенаПродажиВес;
//		
//	КонецЦикла;	
//	
//	Элементы.ТаблицаПодбора.Видимость = Истина;
//	
//КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьПодбор(Команда)
	
	Элементы.ТаблицаПодбора.Видимость = Ложь;	
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьПодбор(Команда)
	
	ВыборСтроки();
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаПодбораВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ВыборСтроки();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыборСтроки()
	
	НоваяСтрока = Объект.Товары.Добавить();
	НоваяСтрока.Сума = Элементы.ТаблицаПодбора.ТекущиеДанные.Сумма;
	ЗаполнитьЗначенияСвойств(НоваяСтрока, Элементы.ТаблицаПодбора.ТекущиеДанные);
	
	ЭтаФорма.ТаблицаПодбора.Удалить(Элементы.ТаблицаПодбора.ТекущиеДанные);
	
КонецПроцедуры


&НаКлиенте
Процедура ТЕСТ(Команда)
	Сообщить(Общий.ПолучитьТекстСообщенияВайберДляПрезентации(Объект, Истина));
КонецПроцедуры

&НаСервереБезКонтекста
Функция КонтрольОплати(ЗаказПокупателя)
	
	Если Не ЗначениеЗаполнено(ЗаказПокупателя) Тогда 
		Возврат Ложь;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КассовыйОрдер.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.КассовыйОрдер КАК КассовыйОрдер
		|ГДЕ
		|	КассовыйОрдер.ЗаказПокупателя = &ЗаказПокупателя";
	
	Запрос.УстановитьПараметр("ЗаказПокупателя", ЗаказПокупателя);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Возврат Выборка.Следующий();

КонецФункции

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	//123!"№
	Если Объект.Доставка = ПредопределенноеЗначение("Перечисление.НаявністьДоставки.Почта") и Объект.Наложка = Ложь  Тогда
		
		Оплаты = Общий.ПолучитьДанныеПоОплате(Объект.Ссылка);
		Если (Объект.Сума - Оплаты.СуммаУчета)> 0 Тогда		
			
			Режим = РежимДиалогаВопрос.ДаНет;
			Ответ = Вопрос("Ви дійсно хочете створити реалізацію без повної оплати?", Режим);
			Если Ответ = КодВозвратаДиалога.Нет Тогда
				Отказ = Истина;
				Возврат;
			КонецЕсли;	
			
		КонецЕсли;
		
	КонецЕсли;
	
		//////////////////////////////////////////////////////
	Если НЕ мЗакрытиеСПараметром Тогда 
		//Отказ = Истина;
		//СтандартнаяОбработка = Ложь;
		мЗакрытиеСПараметром = Истина;
		Закрыть(Объект.Ссылка);
		Возврат;
	КонецЕсли;
	Если Отказ Тогда 
		мЗакрытиеСПараметром = Ложь;
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Функция ПолучитьКонтрагентаПоЗначению()
	СЗ = Новый СписокЗначений;	
	Элементы.Контрагент.СписокВыбора.Очистить();
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Контрагенты.Ссылка КАК Ссылка,
		|	Контрагенты.Город КАК Город,
		|	Контрагенты.Наименование КАК Наименование
		|ИЗ
		|	Справочник.Контрагенты КАК Контрагенты";
	
	ВыборкаДетальныеЗаписи = Запрос.Выполнить().Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СЗ.Добавить(ВыборкаДетальныеЗаписи.Ссылка, ВыборкаДетальныеЗаписи.Наименование + " (" + ВыборкаДетальныеЗаписи.Город + ")");
		//Элементы.Контрагент.СписокВыбора.Добавить(ВыборкаДетальныеЗаписи.Ссылка, ВыборкаДетальныеЗаписи.Наименование + " (" + ВыборкаДетальныеЗаписи.Город + ")");

	КонецЦикла;
	
	Возврат СЗ;
КонецФункции

&НаКлиенте
Процедура ОтправитьУЧат(Команда)
	
		
	
	Записать(); 	
	сз_Чаты = ПолучитьАктуалныеЧаты();
	Чат = сз_Чаты.ВыбратьЭлемент("Відправити у чат");
	Если Чат = Неопределено Тогда 
		Возврат;
	КонецЕсли;

	НомераТелефонов = ТелефонКонтрагента();
	Если НомераТелефонов.Количество() > 1 Тогда 
		ВыбрЗнач = НомераТелефонов.ВыбратьЭлемент("Номер телефона клієнта");
		Если ВыбрЗнач = Неопределено Тогда 
			Возврат;
		КонецЕсли;
		Телефон = ВыбрЗнач.Значение;
	ИначеЕсли  НомераТелефонов.Количество() = 1 Тогда 
		Телефон = НомераТелефонов[0].Значение;
	КонецЕсли;

	
	ОтправитьУЧатНаСервере(Чат.Значение, Телефон);
	Объект.ВідправленоВВайбер = Истина;
	//Объект.ВивантажуватиВ1С = Истина;
	//Элементы.ВивантажуватиВ1С.Доступность = Истина;

КонецПроцедуры

&НаСервереБезКонтекста
Функция  ПолучитьАктуалныеЧаты();
	сз_Чаты = Новый СписокЗначений;
	Чаты = Справочники.ГруппыЧата.Выбрать();
	Пока  Чаты.Следующий() Цикл 
		Если Чаты.ПометкаУдаления Тогда 
			Продолжить;
		КонецЕсли;
		
		сз_Чаты.Добавить(Чаты.Ссылка);
	КонецЦикла;
	Возврат сз_Чаты;
КонецФункции

&НаСервере
Процедура ОтправитьУЧатНаСервере(Чат, Телефон)
	
	Текст = Общий.ПолучитьТекстСообщенияВайберДляПрезентации(Объект, Ложь, Телефон);
	
	Менеджер = РегистрыСведений.ИсходящиеСообщения.СоздатьМенеджерЗаписи();
	Менеджер.Получатель = Чат; 
	Менеджер.Дата = ТекущаяДата();
	Менеджер.Уид_Сообщения = Новый УникальныйИдентификатор();
	Менеджер.Повідомлення = Текст;
	Менеджер.Записать();

КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаПродажиВесПриИзменении(Элемент)
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	//ТекущиеДанные.ЦенаПродажиВес = Цена;
	ТекущиеДанные.Цена = ТекущиеДанные.ЦенаПродажиВес * ВесХарактеристики(ТекущиеДанные.ХарактеристикаНоменклатуры);
	ТекущиеДанные.Сума = ТекущиеДанные.Цена * ТекущиеДанные.Количество
КонецПроцедуры

&НаСервереБезКонтекста
Функция ВесХарактеристики(Характеристика)
	Возврат Характеристика.Вага;
КонецФункции

&НаСервере
Функция ПеревіритиЗалишокТовару(Номенклатура, Характеристика)
	
	Если Характеристика.Залишок > 0 Тогда
		Возврат Истина;
	Иначе
		 Сообщить("Товару " + Строка(Номенклатура) + " немає на залишку !");	
		Возврат Ложь;
	КонецЕсли;	
	
КонецФункции	

СписокКлиентов = ПолучитьКонтрагентаПоЗначению();

