Перем мВалютаРегламентированногоУчета Экспорт;

Перем мСтруктураПараметровДляПолученияДоговора Экспорт; 


Процедура СформироватьЗаказыПоставщикам() Экспорт 
	
	ЗапросТовара = Новый Запрос;
	ЗапросТовара.Текст = 
	"ВЫБРАТЬ
	|	Товары.Контрагент,
	|	Товары.Номенклатура,
	|	Товары.ХарактеристикаНоменклатуры,
	|	Товары.Количество
	|ПОМЕСТИТЬ ВТТовары
	|ИЗ
	|	&Товары КАК Товары
	|ГДЕ
	|	Товары.Количество > 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТТовары.Контрагент КАК Контрагент,
	|	ВТТовары.Номенклатура,
	|	ВТТовары.ХарактеристикаНоменклатуры,
	|	ВТТовары.Количество КАК Количество
	|ИЗ
	|	ВТТовары КАК ВТТовары
	|ИТОГИ
	|	СУММА(Количество)
	|ПО
	|	Контрагент";
	ЗапросТовара.УстановитьПараметр("Товары", Товары.Выгрузить());
	РезультатЗапроса = ЗапросТовара.Выполнить();
	ВыборкаКонтрагента = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Контрагент");
	Пока ВыборкаКонтрагента.Следующий() Цикл 
		СсылкаНаНовыйЗаказ 		= НайтиЗаказПоставщику(ВыборкаКонтрагента.Контрагент);
		Если СсылкаНаНовыйЗаказ <> Документы.ЗаказПоставщику.ПустаяСсылка() Тогда 
			НовыйЗаказПоставщику 	= СсылкаНаНовыйЗаказ.ПолучитьОбъект();
			НовыйЗаказПоставщику.Товары.Очистить();
			ВыборкаНоменклатуры 	= ВыборкаКонтрагента.Выбрать();
			Пока ВыборкаНоменклатуры.Следующий() Цикл 
				СтрокаТабличнойЧасти = НовыйЗаказПоставщику.Товары.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаТабличнойЧасти, ВыборкаНоменклатуры);
				ОбработкаТабличныхЧастей.ПриИзмененииНоменклатурыТабЧасти(СтрокаТабличнойЧасти, НовыйЗаказПоставщику);
				ОбработкаТабличныхЧастей.ЗаполнитьСтавкуНДСТабЧасти(СтрокаТабличнойЧасти, НовыйЗаказПоставщику, "Приобретение");
				СтруктураШапкиДокумента = Новый Структура("Контрагент, ТипЦен, ДоговорКонтрагента, ДатаДокумента, ВалютаДокумента, УчитыватьНДС, СуммаВключаетНДС",
				                                         ВыборкаКонтрагента.Контрагент, НовыйЗаказПоставщику.ТипЦен, НовыйЗаказПоставщику.ДоговорКонтрагента, НовыйЗаказПоставщику.Дата, НовыйЗаказПоставщику.ВалютаДокумента, НовыйЗаказПоставщику.УчитыватьНДС, НовыйЗаказПоставщику.СуммаВключаетНДС);
				ОбработкаТабличныхЧастей.ЗаполнитьЕдиницуЦенуПокупкиТабЧасти(СтрокаТабличнойЧасти, НовыйЗаказПоставщику, СтруктураШапкиДокумента, мВалютаРегламентированногоУчета, Истина);
				//ЦенаЗаВес = ВесовойУчет.ПолучитьЦенуЗаВес(Дата, ВыборкаНоменклатуры.Номенклатура);
				//СтрокаТабличнойЧасти.Цена = ЦенаЗаВес * СтрокаТабличнойЧасти.ХарактеристикаНоменклатуры.Вага;
				//ОбработкаТабличныхЧастей.РассчитатьСуммуТабЧасти(СтрокаТабличнойЧасти, НовыйЗаказПоставщику);
				//ОбработкаТабличныхЧастей.РассчитатьСуммуНДСТабЧасти(СтрокаТабличнойЧасти, НовыйЗаказПоставщику);
			КонецЦикла;	
			НовыйЗаказПоставщику.Записать(РежимЗаписиДокумента.Запись);
		КонецЕсли;
	КонецЦикла;	
	
КонецПроцедуры	
	

Функция НайтиЗаказПоставщику(Поставщик) Экспорт 
	
	Результат = Документы.ЗаказПоставщику.ПустаяСсылка();
	
	ЗапросЗаказа = Новый Запрос;
	ЗапросЗаказа.Текст = 
	"ВЫБРАТЬ
	|	ЗаказПоставщику.Ссылка
	|ИЗ
	|	Документ.ЗаказПоставщику КАК ЗаказПоставщику
	|ГДЕ
	|	ЗаказПоставщику.Контрагент = &Контрагент
	|	И ЗаказПоставщику.ДокументОснование = &ДокументОснование
	|	И НЕ ЗаказПоставщику.ПометкаУдаления";
	
	ЗапросЗаказа.УстановитьПараметр("ДокументОснование", Ссылка);
	ЗапросЗаказа.УстановитьПараметр("Контрагент", Поставщик);
	РезультатЗапроса = ЗапросЗаказа.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда 
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		Результат = Выборка.Ссылка;
	Иначе 
		НовыйЗаказ = Документы.ЗаказПоставщику.СоздатьДокумент();
		ЗаполнениеДокументов.ЗаполнитьШапкуДокумента(НовыйЗаказ, глЗначениеПеременной("глТекущийПользователь"), мВалютаРегламентированногоУчета, "Покупка", Неопределено, Неопределено, мСтруктураПараметровДляПолученияДоговора);
		УправлениеЗаказами.УстановитьДатуОплатыПоДоговору(НовыйЗаказ);		
		НовыйЗаказ.Дата 				= Дата;
		НовыйЗаказ.Организация 			= Организация;
		НовыйЗаказ.ДокументОснование 	= Ссылка;
		НовыйЗаказ.Контрагент 			= Поставщик;
		НовыйЗаказ.ДоговорКонтрагента 	= Поставщик.ОсновнойДоговорКонтрагента;
		НовыйЗаказ.Записать(РежимЗаписиДокумента.Запись);
		Результат 						= НовыйЗаказ.Ссылка;
	КонецЕсли;	
	
	Возврат Результат;
	
КонецФункции	

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	ТорговыеАгенты = "";
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОбщаяПотребностьЗаказыПокупателей.ЗаказПокупателя.ТорговийАгент КАК ТорговыйАгент
		|ИЗ
		|	Документ.ОбщаяПотребность.ЗаказыПокупателей КАК ОбщаяПотребностьЗаказыПокупателей
		|ГДЕ
		|	ОбщаяПотребностьЗаказыПокупателей.ЗаказПокупателя.Ссылка В(&Заказы)
		|
		|СГРУППИРОВАТЬ ПО
		|	ОбщаяПотребностьЗаказыПокупателей.ЗаказПокупателя.ТорговийАгент
		|
		|УПОРЯДОЧИТЬ ПО
		|	ТорговыйАгент
		|АВТОУПОРЯДОЧИВАНИЕ";	
	Запрос.УстановитьПараметр("Заказы", ЗаказыПокупателей.ВыгрузитьКолонку("ЗаказПокупателя"));
	Выборка = Запрос.Выполнить().Выбрать();
	КоличествоАгентов = Выборка.Количество();
	ПорядокАгента = 0;
	Пока Выборка.Следующий() Цикл 
		ПорядокАгента = ПорядокАгента + 1;
		ТорговыеАгенты = ТорговыеАгенты + Выборка.ТорговыйАгент + ?(ПорядокАгента = КоличествоАгентов, ".", "; ");
	КонецЦикла;	
	
КонецПроцедуры

мВалютаРегламентированногоУчета 			= глЗначениеПеременной("ВалютаРегламентированногоУчета");
мСтруктураПараметровДляПолученияДоговора 	= ЗаполнениеДокументов.ПолучитьСтруктуруПараметровДляПолученияДоговораПокупки();