
&НаКлиенте
Процедура КомандаДобавить(Команда)
		Если ТекКоличество < Количество Тогда 
			Количество = ТекКоличество;
		КонецЕсли;
		СтруктураВозврата = Новый Структура;
		СтруктураВозврата.Вставить("Номенклатура",ТекНоменклатура);
		СтруктураВозврата.Вставить("ХарактеристикаНоменклатуры",ТекХарактеристикаНом);
		СтруктураВозврата.Вставить("ЕдиницаИзмерения",ТекЕдиницаИзмерения);
		СтруктураВозврата.Вставить("Количество",Количество);
		СтруктураВозврата.Вставить("Штрихкод",ТекШтрихкод);
		СтруктураВозврата.Вставить("Цена",ЦенаВыбор);
		
		ОповеститьОВыборе(СтруктураВозврата);

КонецПроцедуры

&НаКлиенте
Процедура КомандаЗакрыть(Команда)
	Закрыть();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ТекНоменклатура = Параметры.Номенклатура;
	ТекХарактеристикаНом = Параметры.Характеристика;
	ТекЕдиницаИзмерения = Параметры.ЕдиницаИзмерения;
	ЦенаВыбор = Параметры.Цена;
	ТекКоличество = Параметры.Остаток - Параметры.УжеВТаблице;
	Количество = 1;
	ТекШтрихкод = Параметры.Штрихкод;
КонецПроцедуры
