

&НаКлиенте
Процедура РезультатПоискаВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Количество = 1;
	Элементы.ГруппаКоличество.Видимость = Истина;
	Элементы.ГруппаВыбор.Видимость = Истина;
	Элементы.Добавить.Видимость = Истина;
	
	ТекКоличество = Элементы.РезультатПоиска.ТекущиеДанные.Остаток;
	ТекНоменклатура = Элементы.РезультатПоиска.ТекущиеДанные.Номенклатура;
	ТекХарактеристикаНом = Элементы.РезультатПоиска.ТекущиеДанные.Характеристика;
	ТекЕдиницаИзмерения = Элементы.РезультатПоиска.ТекущиеДанные.ЕдиницаИзмерения;
	ТекШтрихкод = Элементы.РезультатПоиска.ТекущиеДанные.Штрихкод;
	Цена = Элементы.РезультатПоиска.ТекущиеДанные.Цена;

КонецПроцедуры

&НаКлиенте
Процедура Добавить(Команда)
	//	Кол = 1;
	//Если ВвестиЗначение(Кол,"Количество") Тогда 
		Если ТекКоличество < Количество Тогда 
			Количество = ТекКоличество;
		КонецЕсли;
		СтруктураВозврата = Новый Структура;
		СтруктураВозврата.Вставить("Номенклатура",ТекНоменклатура);
		СтруктураВозврата.Вставить("ХарактеристикаНоменклатуры",ТекХарактеристикаНом);
		СтруктураВозврата.Вставить("ЕдиницаИзмерения",ТекЕдиницаИзмерения);
		СтруктураВозврата.Вставить("Количество",Количество);
		СтруктураВозврата.Вставить("Штрихкод",ТекШтрихкод);
		СтруктураВозврата.Вставить("Цена",Цена);
		
		ОповеститьОВыборе(СтруктураВозврата);
		//Закрыть();
	//КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура КомандаЗакрыть(Команда)
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура Отбор(Команда)
	РезультатПоиска.Отбор.Элементы.Очистить();
	ЕлОтб = РезультатПоиска.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЕлОтб.ВидСравнения = ВидСравненияКомпоновкиДанных.Содержит;
	ЕлОтб.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Штрихкод");
	ЕлОтб.ПравоеЗначение = "800";
	ЕлОтб.Использование = Истина;
	
	//ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Список.Отбор, "Статус", перечисления.ПЛ_СтатусыЗаявокНаКомиссионные.Закрыт, ВидСравненияКомпоновкиДанных.НеРавно,, ЗначениеЗаполнено(перечисления.ПЛ_СтатусыЗаявокНаКомиссионные.Закрыт));    
КонецПроцедуры





//&НаКлиенте
//Процедура Удалить(Команда)
//	//Если ТаблицаВыбора.Количество() Тогда 
//	//	ТаблицаВыбора.Удалить(ТаблицаВыбора.Индекс(Элементы.ТаблицаВыбора.ТекущиеДанные));
//	//КонецЕсли;
//КонецПроцедуры

//&НаКлиенте
//Процедура ПриОткрытии(Отказ)
//	Количество = 1;
//КонецПроцедуры

//&НаКлиенте
//Процедура Ок(Команда)
//	ОповеститьОВыборе(ТаблицаВыбора);
//	//Закрыть();
//КонецПроцедуры


//&НаКлиенте
//Процедура ВыборНоменклатурыПередНачаломИзменения(Элемент, Отказ)
//	Отказ = Истина;
//КонецПроцедуры


//&НаКлиенте
//Процедура ТаблицаВыбораПередНачаломИзменения(Элемент, Отказ)
//	Отказ = Истина;
//КонецПроцедуры


//&НаСервереБезКонтекста
//Функция ВыполнитьПоискНаСервере(Штрихкод)
//	з = Новый Запрос;
//	з.Текст = "ВЫБРАТЬ
//	          |	Штрихкоды.Владелец,
//	          |	Штрихкоды.ЕдиницаИзмерения,
//	          |	Штрихкоды.ХарактеристикаНоменклатуры
//	          |ИЗ
//	          |	РегистрСведений.Штрихкоды КАК Штрихкоды
//	          |ГДЕ
//	          |	Штрихкоды.Штрихкод = &Штрихкод";
//	з.УстановитьПараметр("Штрихкод",Формат(Штрихкод,"ЧГ=0"));
//	Выборка = з.Выполнить().Выбрать();
//	св = Новый Структура;
//	св.Вставить("Номенклатура",Справочники.Номенклатура.ПустаяСсылка());
//	св.Вставить("ЕдиницаИзмерения",Справочники.ЕдиницыИзмерения.ПустаяСсылка());
//	св.Вставить("ХарактеристикаНоменклатуры",Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка());
//	Если Выборка.Следующий() Тогда 
//		св.Номенклатура = Выборка.Владелец;
//		св.ЕдиницаИзмерения = Выборка.ЕдиницаИзмерения;
//		св.ХарактеристикаНоменклатуры = Выборка.ХарактеристикаНоменклатуры;
//	КонецЕсли;
//	Возврат св;
//	
//КонецФункции


//&НаКлиенте
//Процедура ВыполнитьПоиск(Команда)
//	СтруктураПоиска = ВыполнитьПоискНаСервере(Штрихкод);
//	РезультатНоменклатура = СтруктураПоиска.Номенклатура;
//	РезультатХарактеристикаНоменклатуры = СтруктураПоиска.ХарактеристикаНоменклатуры;
//	РезультатЕдиницаИзмерения = СтруктураПоиска.ЕдиницаИзмерения;
//КонецПроцедуры


//&НаКлиенте
//Процедура Добавить(Команда)
//	
//	СтрокаТаб = ТаблицаВыбора.НайтиСтроки(Новый Структура("Номенклатура,ХарактеристикаНоменклатуры,ЕдиницаИзмерения",РезультатНоменклатура,РезультатХарактеристикаНоменклатуры,РезультатЕдиницаИзмерения));
//	Если СтрокаТаб.Количество() Тогда 
//		НовСтр = СтрокаТаб[0];
//		НовСтр.Количество = НовСтр.Количество + Количество;
//	Иначе 	
//		НовСтр = ТаблицаВыбора.Добавить();
//		НовСтр.Номенклатура = РезультатНоменклатура;
//		НовСтр.ХарактеристикаНоменклатуры = РезультатХарактеристикаНоменклатуры;
//		НовСтр.ЕдиницаИзмерения = РезультатЕдиницаИзмерения;
//		НовСтр.Количество = Количество;
//	КонецЕсли;
//КонецПроцедуры

