#Область Проциддуры_Функции_Входящего_Запроса_SEND

Функция ОбработатьВходящийЗапрос(Запрос, НастройкиВайбер) Экспорт
	
	ДанныеЗапроса = ДанныеЗапроса(Запрос);
	
	Если ДанныеЗапроса.event = "conversation_started" Тогда
		
		Идентификатор = Строка(СокрЛП(ДанныеЗапроса.user.id));
		Если Не КлиентСуществует(Идентификатор) Тогда
			Возврат БизнесЛогикаViber.ЗафиксироватьНовогоОтправителяИОтправитьТекстПриведствия(ДанныеЗапроса.user, НастройкиВайбер);
		Иначе
			Возврат ОбщегоНазначенияHTTPViber.ПростойУспешныйОтвет();
		КонецЕсли;	
	ИначеЕсли ДанныеЗапроса.event = "subscribed" Тогда
		Возврат БизнесЛогикаViber.ЗафиксироватьСтатусРазрешенияДиалога(ДанныеЗапроса, НастройкиВайбер);
	ИначеЕсли ДанныеЗапроса.event = "unsubscribed" Тогда
		Возврат БизнесЛогикаViber.ЗафиксироватьСтатусОтпискиОтБота(ДанныеЗапроса, НастройкиВайбер); 
	ИначеЕсли ДанныеЗапроса.event = "message" Тогда
		Возврат БизнесЛогикаViber.ОбработатьСообщение(ДанныеЗапроса, НастройкиВайбер);
	ИначеЕсли ДанныеЗапроса.event = "seen" Тогда
		Возврат БизнесЛогикаViber.ЗафиксироватьСтатусПрочитано(ДанныеЗапроса, НастройкиВайбер);	
	ИначеЕсли ДанныеЗапроса.event = "delivered" Тогда
		Возврат БизнесЛогикаViber.ЗафиксироватьСтатусДоставлено(ДанныеЗапроса, НастройкиВайбер);	
	КонецЕсли;
	
	
	
	Возврат ОбщегоНазначенияHTTPViber.ПростойУспешныйОтвет();
	
КонецФункции

Функция ДанныеЗапроса(Запрос)
	
	ТелоЗапроса = Запрос.ПолучитьТелоКакСтроку();
	Возврат ОбщегоНазначенияHTTPViber.ОбъектJSON(ТелоЗапроса);	
	
КонецФункции

#КонецОбласти  

#Область Проциддуры_Функции_Входящего_Запроса_SENDSECOND

Функция ОбработатьВходящийЗапросSECOND(Запрос) Экспорт
	
	ДанныеЗапроса = ДанныеЗапроса(Запрос);
	
	Если ДанныеЗапроса.event = "conversation_started" Тогда
		Возврат БизнесЛогикаViber.ЗафиксироватьНовогоОтправителяИОтправитьТекстПриведствия(ДанныеЗапроса.user);
	ИначеЕсли ДанныеЗапроса.event = "subscribed" Тогда
		Возврат БизнесЛогикаViber.ЗафиксироватьСтатусРазрешенияДиалога(ДанныеЗапроса);
	ИначеЕсли ДанныеЗапроса.event = "unsubscribed" Тогда
		Возврат БизнесЛогикаViber.ЗафиксироватьСтатусОтпискиОтБота(ДанныеЗапроса); 
	ИначеЕсли ДанныеЗапроса.event = "message" Тогда
		Возврат БизнесЛогикаViber.ОбработатьСообщение(ДанныеЗапроса);		
	КонецЕсли;
	
	Возврат ОбщегоНазначенияHTTPViber.ПростойУспешныйОтвет();
	
КонецФункции

Функция ДанныеЗапросаSECOND(Запрос)
	
	ТелоЗапроса = Запрос.ПолучитьТелоКакСтроку();
	Возврат ОбщегоНазначенияHTTPViber.ОбъектJSON(ТелоЗапроса);	
	
КонецФункции

#КонецОбласти
 

#Область Общие_Команды_И_Процедуры_Viber

Функция ОтправитьНаРегистрациюWebhook(Настройки)Экспорт 
	
	ИмяМетода = "set_webhook";
	
	СтруктураЗапроса = Новый Структура;
	СтруктураЗапроса.Вставить("url", Настройки.URL);
	СтруктураЗапроса.Вставить("send_name", Строка("true"));
	СтруктураЗапроса.Вставить("send_photo", Строка("true"));
	
	Ответ = ОтправитьЗапросViber(Настройки, ИмяМетода, СтруктураЗапроса);
	
	Возврат Ответ;	
		
КонецФункции   

Функция УдалитьСРегистрацииWebhook(Настройки)Экспорт 
	
	ИмяМетода = "set_webhook";
	
	СтруктураЗапроса = Новый Структура;
	СтруктураЗапроса.Вставить("url", Настройки.URL);
		
	Ответ = ОтправитьЗапросViber(Настройки, ИмяМетода, СтруктураЗапроса);
	
	Возврат Ответ;	
		
КонецФункции

Функция ОтправитьСообщениеПользователю(Настройка, Клиент, Текст)Экспорт
	
	ИмяМетода = "send_message";
	СтруктураЗапроса = Новый Структура;
	СтруктураЗапроса.Вставить("receiver", СокрЛП(Клиент.Идентификатор));
	СтруктураЗапроса.Вставить("sender", Новый Структура("name", Настройка.ИмяОтправителя));
	СтруктураЗапроса.Вставить("type", "text");
    СтруктураЗапроса.Вставить("text", Текст); 
	
	Ответ = ОтправитьЗапросViber(Настройка, ИмяМетода, СтруктураЗапроса); 
	
	Возврат Ответ;
	  
 	
КонецФункции	

Функция ОтправитьСообщениеФайлПользователю(Настройка, Клиент, ДанныеФайла)Экспорт
	
	ИмяМетода = "send_message";
	СтруктураЗапроса = Новый Структура;
	СтруктураЗапроса.Вставить("receiver", СокрЛП(Клиент.Идентификатор));
	СтруктураЗапроса.Вставить("sender", Новый Структура("name", Настройка.ИмяОтправителя));
	Если ДанныеФайла.ТипФайла = Перечисления.ТипФайлаОтправки.Изображение Тогда 
		СтруктураЗапроса.Вставить("type", "picture");
	ИначеЕсли ДанныеФайла.ТипФайла = Перечисления.ТипФайлаОтправки.Видео Тогда
		СтруктураЗапроса.Вставить("type", "video");
		СтруктураЗапроса.Вставить("size", ДанныеФайла.Размер);
		//СтруктураЗапроса.Вставить("file_name", ДанныеФайла.Имя); 

	Иначе
		СтруктураЗапроса.Вставить("type", "file");
		СтруктураЗапроса.Вставить("size", ДанныеФайла.Размер);
		СтруктураЗапроса.Вставить("file_name", ДанныеФайла.Имя); 

	КонецЕсли;	
		
		
    СтруктураЗапроса.Вставить("media", ДанныеФайла.Путь); 

	СтруктураЗапроса.Вставить("tracking_data", "tracking data"); 
	СтруктураЗапроса.Вставить("min_api_version", "1");
	
	Ответ = ОтправитьЗапросViber(Настройка, ИмяМетода, СтруктураЗапроса); 
	
	Возврат Ответ;  
	
КонецФункции	

#КонецОбласти

#Область ОбщийЗапросВайбер

Функция ОтправитьЗапросViber(Настройки, ИмяМетода, СтруктураЗапроса)Экспорт
	
	SSL = Новый ЗащищенноеСоединениеOpenSSL;
	СтрокаJSON = КодироватьСтроку(СтрокаJSON, СпособКодированияСтроки.КодировкаURL);
	
	ХТТПСоединение = Новый HTTPСоединение(СокрЛП(Настройки.UrlViber)+ИмяМетода,,,,,,SSL);
		
	ЗаписьJSON = Новый ЗаписьJSON; 
	ЗаписьJSON.УстановитьСтроку(); 
	ЗаписатьJSON(ЗаписьJSON, СтруктураЗапроса); 
	
	Заголовки = Новый Соответствие;
	Заголовки.Вставить("Content-Type", "application/json");
	Заголовки.Вставить("X-Viber-Auth-Token", СокрЛП(Настройки.Token));
	ХТТПЗапрос = Новый HTTPЗапрос("",Заголовки);
	ХТТПЗапрос.УстановитьТелоИзСтроки(ЗаписьJSON.Закрыть(), КодировкаТекста.UTF8, ИспользованиеByteOrderMark.НеИспользовать); 
	ХТТПЗапрос.Заголовки = Заголовки;
	
	Ответ = ХТТПСоединение.ОтправитьДляОбработки(ХТТПЗапрос);
	ТекстОтвета = Ответ.ПолучитьТелоКакСтроку();
	Если Ответ.КодСостояния=200 Тогда
		Чтение = Новый ЧтениеJSON;
		Чтение.УстановитьСтроку(ТекстОтвета);
		ДеревоОтвета =  ПрочитатьJSON(Чтение,Ложь);
		Возврат ДеревоОтвета;
	Иначе
		Сообщить("Ошибка: "+Ответ.КодСостояния); 
	КонецЕсли; 


	
КонецФункции

#КонецОбласти

#Область Бизнес_Логика_1С

Процедура ЗарегистрироватьСообщениеПользователяИсходящее(Ответ, СтруктураФайла = Неопределено, Контакт, Настройка, Текст, Пользователь)Экспорт
	
	Если СтруктураФайла <> Неопределено Тогда
		Запись = РегистрыСведений.ViberИсторииСообщений.СоздатьМенеджерЗаписи();
		Запись.Дата                = ТекущаяДатаСеанса();
		Запись.Контакт             = Контакт;
		Запись.Напрвление          = Перечисления.Viber_Направление.Исходящее;
		Запись.ЧатID               = Ответ.chat_hostname;
		Запись.ТокенСообщния       = СтрЗаменить(Ответ.message_token, Символ(160), "");
		Запись.ИсточникПривличения = Настройка;
		Если СтруктураФайла.ТипФайла = Перечисления.ТипФайлаОтправки.Видео Тогда
			Запись.Видео = Истина;
		ИначеЕсли СтруктураФайла.ТипФайла = Перечисления.ТипФайлаОтправки.Изображение Тогда
			Запись.Картинка = истина;
		Иначе			
			Запись.Файл                = Истина;
		КонецЕсли;
		
		Запись.Текст               = Текст;
		Запись.ПутьКФайлу          = СтруктураФайла.Путь;
		Запись.Размер              = СтруктураФайла.Размер;
		Запись.Наименование        = СтруктураФайла.Имя; 
		Запись.ФайлВБазе           = СтруктураФайла.ФайлТам;
		Запись.Менеджер            = Справочники.Пользователи.НайтиПоНаименованию(Пользователь.Имя).ТорговыйАгент;
		Запись.Записать();
	Иначе
		Запись = РегистрыСведений.ViberИсторииСообщений.СоздатьМенеджерЗаписи();
		Запись.Дата                = ТекущаяДатаСеанса();
		Запись.Контакт             = Контакт;
		Запись.Напрвление          = Перечисления.Viber_Направление.Исходящее;
		Запись.ЧатID               = Ответ.chat_hostname;
		Запись.ТокенСообщния       = СтрЗаменить(Ответ.message_token, Символ(160), "");
		Запись.ИсточникПривличения = Настройка;
		Запись.Текст               = Текст;
		Запись.Менеджер            = Справочники.Пользователи.НайтиПоНаименованию(Пользователь.Имя).ТорговыйАгент;
		Запись.Записать();
	КонецЕсли; 	
	
	
КонецПроцедуры

////// клиент существует /////////////////////////
Функция КлиентСуществует(ИД);
	
	Контакт = Ложь;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КонтактыViber.Ссылка
		|ИЗ
		|	Справочник.КонтактыViber КАК КонтактыViber
		|ГДЕ
		|	КонтактыViber.Идентификатор = &Идентификатор";
	
	Запрос.УстановитьПараметр("Идентификатор", СокрЛ(ИД));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Контакт= Истина;	
	КонецЦикла;
	
	Возврат Контакт;
	
КонецФункции


#КонецОбласти



