
&НаСервере	
Функция ВідкритиФормуКілометражНаСервере(Статус, Заголовок, Повідомлення)Экспорт
	//СтатусПроверки = Статус;
	если Заголовок = "Просроченное" тогда 
		Повідомлення = "Немає кінцевого кілометражу за попередню зміну!
		|Введіть кілометраж на кінець попереднього робочого дня! 
		|Пізніше відредагувати дане значення буде неможливо,
		|тому перевірте правельність введення!" 
	ИначеЕсли Статус = Перечисления.СтатусДня.КінецьДня тогда 
		Повідомлення = "Введіть кілометраж на кінець робочого дня! Пізніше 
		|відредагувати дане значення буде неможливо, тому перевірте
		|правельність введення!";
	ИначеЕсли Статус = Перечисления.СтатусДня.ПочатокДня Тогда
		Повідомлення = "Введіть кілометраж на початок робочого дня! Пізніше 
		|відредагувати дане значення буде неможливо, тому перевірте
		|правельність введення!"
	КонецЕсли;
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	КілометражСрезПоследних.Период КАК Период,
	|	КілометражСрезПоследних.СтатусДня КАК Статус
	|ИЗ
	|	РегистрСведений.Кілометраж.СрезПоследних КАК КілометражСрезПоследних
	|
	|УПОРЯДОЧИТЬ ПО
	|	Период УБЫВ";
		
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда 
		Если Выборка.Статус = Перечисления.СтатусДня.ПочатокДня И 
			Выборка.Период < НачалоДня(ТекущаяДата())
			И Заголовок = "Просроченное" Тогда 			
			Возврат Истина;
		ИначеЕсли Выборка.Статус = Перечисления.СтатусДня.КінецьДня И НеБулоВжеСьогодніНачалоДня() И  Заголовок = "НачалоДня" Тогда 
			Возврат Истина;
		ИначеЕсли Выборка.Период >= НачалоДня(ТекущаяДата()) 
			И Выборка.Статус = Перечисления.СтатусДня.ПочатокДня 
			И Заголовок = "КонецДня" Тогда 
			Возврат Истина;			
		КонецЕсли;	
	ИначеЕсли Статус = Перечисления.СтатусДня.ПочатокДня   Тогда 
		Возврат Истина;
	КонецЕсли;	
	Возврат Ложь;
КонецФункции    

&НаСервере
Функция НеБулоВжеСьогодніНачалоДня()
	з = Новый Запрос;
	з.Текст = "ВЫБРАТЬ
	|	ДаніКілометражу.СтатусДня
	|ИЗ
	|	РегистрСведений.Кілометраж КАК ДаніКілометражу
	|ГДЕ
	|	ДаніКілометражу.Период >= &ДатаНАч
	|	И ДаніКілометражу.СтатусДня = &СтатусДня";
	з.УстановитьПараметр("ДатаНАч",НачалоДня(ТекущаяДата()));
	з.УстановитьПараметр("СтатусДня",Перечисления.СтатусДня.ПочатокДня);
	Выборка = з.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда 
		Возврат Ложь;
	Иначе 
		Возврат Истина;
	КонецЕсли;	
КонецФункции


