
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("Валюта", Справочники.Валюты.НайтиПоКоду("978"));
	КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ТипЦін", Справочники.ТипыЦенНоменклатуры.НайтиПоКоду("000000002"));
	КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ТипЦін1", Справочники.ТипыЦенНоменклатуры.НайтиПоКоду("000000004"));
	
КонецПроцедуры
