// Обработчик регламентного задания ЗаданиеАвтономноеРешение.
Процедура ВыполнитьОбменДаннымиДляНастройкиОбмена(КодНастройки) Экспорт
	
	// Оставлен для совместимости с версиями ранее 10.3.5.
			
КонецПроцедуры

// Обработчик регламентного задания ЗаданиеОтложенныеДвижения.
Процедура ВыполнитьОтложенныеДвиженияДляНастройкиОбмена(КодНастройки) Экспорт
	
	// Оставлен для совместимости с версиями ранее 10.3.5.
			
КонецПроцедуры

Процедура ВыполнитьОбменДаннымиДляНастройкиАвтоматическогоОбменаДанными(КодНастройки) Экспорт
	
	Если НЕ ЗначениеЗаполнено(КодНастройки) Тогда
		Возврат;
	КонецЕсли;
	
	НастройкаОбмена = Справочники.НастройкиВыполненияОбмена.НайтиПоКоду(КодНастройки);
	
	Если НЕ ЗначениеЗаполнено(НастройкаОбмена)
		ИЛИ НастройкаОбмена.ПометкаУдаления Тогда
		Возврат;
	КонецЕсли;
	
	ПроцедурыОбменаДанными.ВыполнитьОбменПоНастройкеАвтоматическогоВыполненияОбменаДанными(НастройкаОбмена, Ложь);
	
КонецПроцедуры


// Процедура выполняет пересчет регистров накопления, для удаления нулевых записей
Процедура ПересчетИтоговРегистровНакопления() Экспорт

	НаДату = НачалоМесяца(ТекущаяДата())-1;	
	ПересчетРегистров(РегистрыНакопления, НаДату, Метаданные.СвойстваОбъектов.ВидРегистраНакопления.Остатки);
	
КонецПроцедуры

Процедура ПересчетРегистров(МенеджерРегистров, НаДату, ОграничениеПоВидуРегистра = Неопределено)
	
	Для Каждого МенеджерРегистра ИЗ МенеджерРегистров Цикл
		МетаданныеРегистра = Метаданные.НайтиПоТипу(ТипЗнч(МенеджерРегистра));
		
		Если ОграничениеПоВидуРегистра <> Неопределено И МетаданныеРегистра.ВидРегистра <> ОграничениеПоВидуРегистра Тогда
			Продолжить;
		КонецЕсли;
		ПересчитатьРегистрПоДате(МенеджерРегистра, НаДату);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ПересчитатьРегистрПоДате(МенеджерРегистра, НаДату)
	
	Если МенеджерРегистра.ПолучитьПериодРассчитанныхИтогов()<НаДату Тогда
		МенеджерРегистра.УстановитьПериодРассчитанныхИтогов(НаДату);
	Иначе
		МенеджерРегистра.ПересчитатьИтоги();
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбновлениеИндексаПолнотекстовогоПоиска() Экспорт
	
	Если ПолнотекстовыйПоиск.ПолучитьРежимПолнотекстовогоПоиска() = РежимПолнотекстовогоПоиска.Разрешить Тогда
		
		Если НЕ ПолнотекстовыйПоиск.ИндексАктуален() Тогда
			Попытка	
				ЗаписьЖурналаРегистрации("Полнотекстовое индексирование", 
				УровеньЖурналаРегистрации.Информация, , ,
				"Начато регламентное индексирование порции");
				
				ПолнотекстовыйПоиск.ОбновитьИндекс(Ложь, Истина);
				
				ЗаписьЖурналаРегистрации("Полнотекстовое индексирование", 
				УровеньЖурналаРегистрации.Информация, , ,
				"Закончено регламентное  индексирование порции");
			Исключение
				ЗаписьЖурналаРегистрации("Полнотекстовое индексирование", 
				УровеньЖурналаРегистрации.Ошибка, , ,
				"Во время регламентного обновления индекса произошла неизвестная ошибка: " + ОписаниеОшибки());
			КонецПопытки;
		КонецЕсли;
		
	КонецЕсли;
	
Конецпроцедуры

Процедура СлияниеИндексаПолнотекстовогоПоиска() Экспорт
	
	Если ПолнотекстовыйПоиск.ПолучитьРежимПолнотекстовогоПоиска() = РежимПолнотекстовогоПоиска.Разрешить Тогда
		
		Попытка	
			ЗаписьЖурналаРегистрации("Полнотекстовое индексирование", 
			УровеньЖурналаРегистрации.Информация, , ,
			"Начато регламентное слияние индексов");
				
			ПолнотекстовыйПоиск.ОбновитьИндекс(Истина);
				
			ЗаписьЖурналаРегистрации("Полнотекстовое индексирование", 
			УровеньЖурналаРегистрации.Информация, , ,
			"Закончено регламентное слияние индексов");
		Исключение
			ЗаписьЖурналаРегистрации("Полнотекстовое индексирование", 
			УровеньЖурналаРегистрации.Ошибка, , ,
			"Во время регламентного слияния индекса произошла неизвестная ошибка: " + ОписаниеОшибки());
		КонецПопытки;
		
	КонецЕсли;
	
Конецпроцедуры

// Процедура формирует задачи о необходимости поздравить с днем рождения
//
Процедура СоздатьЗадачиПоздравленияСДнемРождения() Экспорт
	
	УсловиеЗадачи = УправлениеКонтактами.ПолучитьСтрокуУсловияДР();
	
	Запрос = Новый Запрос;

	Запрос.Текст = "
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Контакты.КонтактноеЛицо                             КАК КонтактноеЛицо,
	|	Контакты.Владелец.ОсновнойМенеджерПокупателя        КАК Исполнитель,
	|	Контакты.КонтактноеЛицо.КоличествоДнейДоНапоминания КАК ИнтервалДней,
	|	Контакты.КонтактноеЛицо.ДатаРождения                КАК ДатаРождения,
	|	Задачи.СрокИсполнения                               КАК Срок
	|ИЗ
	|	Справочник.КонтактныеЛицаКонтрагентов КАК Контакты
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	Задача.ЗадачиПользователя КАК Задачи
	|ПО
	|	Задачи.Объект = Контакты.КонтактноеЛицо
	|	И Задачи.Оповещение = ИСТИНА
	|	И Задачи.СрокИсполнения > ДОБАВИТЬКДАТЕ(Контакты.КонтактноеЛицо.ДатаРождения, ГОД, РАЗНОСТЬДАТ(Контакты.КонтактноеЛицо.ДатаРождения, ДОБАВИТЬКДАТЕ(&ТекДата, ДЕНЬ, Контакты.КонтактноеЛицо.КоличествоДнейДоНапоминания), МЕСЯЦ)/12 - 1)
	|	И Задачи.ПамятнаяДата = ИСТИНА
	|ГДЕ
	|	Контакты.КонтактноеЛицо.НапоминатьОДнеРождения = ИСТИНА
	|	И Контакты.КонтактноеЛицо.ДатаРождения <> ДАТАВРЕМЯ(1, 1, 1)
	|	И Контакты.Владелец ССЫЛКА Справочник.Контрагенты
	|	И Контакты.Владелец <> ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|	И Контакты.Владелец.ОсновнойМенеджерПокупателя <> ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)
	|	И ((ДОБАВИТЬКДАТЕ(Контакты.КонтактноеЛицо.ДатаРождения, ГОД, (ГОД(&ТекДата) - ГОД (Контакты.КонтактноеЛицо.ДатаРождения))) >= &ТекДата
	|	И ДОБАВИТЬКДАТЕ(ДОБАВИТЬКДАТЕ(Контакты.КонтактноеЛицо.ДатаРождения, ДЕНЬ, -(Контакты.КонтактноеЛицо.КоличествоДнейДоНапоминания)), ГОД, (ГОД(&ТекДата) - ГОД (Контакты.КонтактноеЛицо.ДатаРождения))) <= &ТекДата)
	|	ИЛИ (ДОБАВИТЬКДАТЕ(Контакты.КонтактноеЛицо.ДатаРождения, ГОД, (ГОД(&ТекДата) - ГОД (Контакты.КонтактноеЛицо.ДатаРождения))) >= ДОБАВИТЬКДАТЕ(&ТекДата, ГОД, -1)
	|	И ДОБАВИТЬКДАТЕ(ДОБАВИТЬКДАТЕ(Контакты.КонтактноеЛицо.ДатаРождения, ДЕНЬ, -(Контакты.КонтактноеЛицо.КоличествоДнейДоНапоминания)), ГОД, (ГОД(&ТекДата) - ГОД (Контакты.КонтактноеЛицо.ДатаРождения))) <= ДОБАВИТЬКДАТЕ(&ТекДата, ГОД, -1)))
	|	И Задачи.СрокИсполнения ЕСТЬ NULL
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ЛичныеКонтакты.Ссылка,
	|	ЛичныеКонтакты.ПользовательДляОграниченияПравДоступа,
	|	ЛичныеКонтакты.КоличествоДнейДоНапоминания,
	|	ЛичныеКонтакты.ДатаРождения,
	|	Задачи.СрокИсполнения
	|ИЗ
	|	Справочник.ЛичныеКонтакты КАК ЛичныеКонтакты
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	Задача.ЗадачиПользователя КАК Задачи
	|ПО
	|	Задачи.Объект = ЛичныеКонтакты.Ссылка
	|	И Задачи.Оповещение = ИСТИНА
	|	И Задачи.СрокИсполнения > ДОБАВИТЬКДАТЕ(ЛичныеКонтакты.ДатаРождения, ГОД, РАЗНОСТЬДАТ(ЛичныеКонтакты.ДатаРождения, ДОБАВИТЬКДАТЕ(&ТекДата, ДЕНЬ, ЛичныеКонтакты.КоличествоДнейДоНапоминания), МЕСЯЦ)/12 - 1)
	|	И Задачи.ПамятнаяДата = ИСТИНА
	|ГДЕ
	|	ЛичныеКонтакты.НапоминатьОДнеРождения = ИСТИНА
	|	И ЛичныеКонтакты.ДатаРождения <> ДАТАВРЕМЯ(1, 1, 1)
	|	И ЛичныеКонтакты.ПользовательДляОграниченияПравДоступа <> ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)
	|	И ((ДОБАВИТЬКДАТЕ(ЛичныеКонтакты.ДатаРождения, ГОД, (ГОД(&ТекДата) - ГОД (ЛичныеКонтакты.ДатаРождения))) >= &ТекДата
	|	И ДОБАВИТЬКДАТЕ(ДОБАВИТЬКДАТЕ(ЛичныеКонтакты.ДатаРождения, ДЕНЬ, -(ЛичныеКонтакты.КоличествоДнейДоНапоминания)), ГОД, (ГОД(&ТекДата) - ГОД (ЛичныеКонтакты.ДатаРождения))) <= &ТекДата)
	|	ИЛИ (ДОБАВИТЬКДАТЕ(ЛичныеКонтакты.ДатаРождения, ГОД, (ГОД(&ТекДата) - ГОД (ЛичныеКонтакты.ДатаРождения))) >= ДОБАВИТЬКДАТЕ(&ТекДата, ГОД, -1)
	|	И ДОБАВИТЬКДАТЕ(ДОБАВИТЬКДАТЕ(ЛичныеКонтакты.ДатаРождения, ДЕНЬ, -(ЛичныеКонтакты.КоличествоДнейДоНапоминания)), ГОД, (ГОД(&ТекДата) - ГОД (ЛичныеКонтакты.ДатаРождения))) <= ДОБАВИТЬКДАТЕ(&ТекДата, ГОД, -1)))
	|	И Задачи.СрокИсполнения ЕСТЬ NULL
	|";
	
	Запрос.УстановитьПараметр("ТекДата"      , ТекущаяДата());
	
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	Пока РезультатЗапроса.Следующий()Цикл
		
		НоваяЗадача = Задачи.ЗадачиПользователя.СоздатьЗадачу();
		НоваяЗадача.Дата           =ТекущаяДата();
		НоваяЗадача.Наименование   = Строка(РезультатЗапроса.КонтактноеЛицо) + ". " + УсловиеЗадачи;
		НоваяЗадача.ПамятнаяДата   = Истина;
		НоваяЗадача.Исполнитель    = РезультатЗапроса.Исполнитель;
		НоваяЗадача.Инициатор      = РезультатЗапроса.Исполнитель;
		НоваяЗадача.СрокИсполнения = Дата(Год(ТекущаяДата() + (РезультатЗапроса.ИнтервалДней * 24 * 60 * 60)), Месяц(РезультатЗапроса.ДатаРождения), День(РезультатЗапроса.ДатаРождения), 00, 00, 00);
		НоваяЗадача.Оповещение     = Истина;
		НоваяЗадача.СрокОповещения = НоваяЗадача.СрокИсполнения - (РезультатЗапроса.ИнтервалДней * 24 * 60 * 60);
		НоваяЗадача.Объект         = РезультатЗапроса.КонтактноеЛицо;
		
		Попытка
			НоваяЗадача.Записать();
		Исключение
		КонецПопытки;
		
	КонецЦикла;
		
КонецПроцедуры // СоздатьЗадачиПоздравленияСДнемРождения()

///////////////////////////////////////////
// Процедуры получения электронных сообщений
//

Процедура ПолучениеЭлектронныхСообщений() Экспорт
	
	Если НЕ Константы.ИспользованиеВстроенногоПочтовогоКлиента.Получить() Тогда
		Возврат;
	КонецЕсли;
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	УчетныеЗаписиЭлектроннойПочты.Ссылка
	|ИЗ
	|	Справочник.УчетныеЗаписиЭлектроннойПочты КАК УчетныеЗаписиЭлектроннойПочты
	|ГДЕ
	|	УчетныеЗаписиЭлектроннойПочты.АвтоПолучениеОтправкаСообщений";
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	Выборка = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.Прямой);
	УчетныеЗаписиДляПроверки = Новый Массив;
	Пока Выборка.Следующий() Цикл
		УчетныеЗаписиДляПроверки.Добавить(Выборка.Ссылка);
	КонецЦикла;
	
	ТекстОшибок = "";
	УправлениеЭлектроннойПочтой.ПолучениеОтправкаПисем(Неопределено, Справочники.Пользователи.ПустаяСсылка(),УчетныеЗаписиДляПроверки,,, Истина, Ложь, ТекстОшибок);
	
	Если ПустаяСтрока(ТекстОшибок) Тогда
		ЗаписьЖурналаРегистрации("Получение электронных сообщений", 
			УровеньЖурналаРегистрации.Информация, Метаданные.Документы.ЭлектронноеПисьмо, ,
			"Получение электронных сообщений выполнено успешно");
	Иначе
		ЗаписьЖурналаРегистрации("Получение электронных сообщений", 
			УровеньЖурналаРегистрации.Ошибка, Метаданные.Документы.ЭлектронноеПисьмо, ,
			"Получение электронных сообщений выполнено с ошибками:" + Символы.ПС + ТекстОшибок);
	КонецЕсли; 
	
КонецПроцедуры

Процедура СообщениеВЧатОБрони() Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ХарактеристикиНоменклатуры.Владелец.Артикул КАК Артикул,
	|	ХарактеристикиНоменклатуры.Бронь,
	|	ХарактеристикиНоменклатуры.ПериодБрони,
	|	Штрихкоды.Штрихкод
	|ИЗ
	|	Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Штрихкоды КАК Штрихкоды
	|		ПО ХарактеристикиНоменклатуры.Владелец = Штрихкоды.Владелец
	|			И ХарактеристикиНоменклатуры.Ссылка = Штрихкоды.ХарактеристикаНоменклатуры
	|ГДЕ
	|	ХарактеристикиНоменклатуры.ПериодБрони > &ПериодБрони
	|	И ХарактеристикиНоменклатуры.Бронь <> &Бронь";
	Запрос.УстановитьПараметр("ПериодБрони", ТекущаяДата());
	Запрос.УстановитьПараметр("Бронь", Справочники.Пользователи.ПустаяСсылка());
	
	ТЗ = Запрос.Выполнить().Выгрузить();
	
	Текст = "";
	Для Каждого Строка Из ТЗ Цикл 
		Текст = Текст + Строка.Артикул + " / " + Строка.Штрихкод + " - " + Строка.Бронь + " до " + Строка.ПериодБрони + Символы.ПС;
	КонецЦикла;
	
	Общий.ОтправитьИнформациюВЧат(Текст);
	
КонецПроцедуры


Процедура ИзменениеСтатусовКонтрагентов() Экспорт
Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Контрагенты.Ссылка КАК Контрагент
		|ИЗ
		|	Справочник.Контрагенты КАК Контрагенты
		|ГДЕ
		|	(Контрагенты.ЭтоГруппа = ЛОЖЬ
		|				И Контрагенты.ПометкаУдаления = ЛОЖЬ
		|				И Контрагенты.ДатаСоздания < &ДатаСоздания
		|				И Контрагенты.СтатусКонтрагента = ЗНАЧЕНИЕ(Справочник.СтатусыКонтрагентов.Новий)
		|			ИЛИ Контрагенты.ОперативныйСтатусКонтрагента = ЗНАЧЕНИЕ(Справочник.СтатусыКонтрагентов.Новий))";
	
	Запрос.УстановитьПараметр("ДатаСоздания", ТекущаяДата() - 30 * 60 * 60 * 24);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		КонтрагентОбъект = ВыборкаДетальныеЗаписи.Контрагент.ПолучитьОбъект();
		КонтрагентОбъект.СтатусКонтрагента = Справочники.СтатусыКонтрагентов.Потенційний;
		КонтрагентОбъект.ОперативныйСтатусКонтрагента = Справочники.СтатусыКонтрагентов.Потенційний;
		Попытка
			КонтрагентОбъект.Записать();
			//ЗаписатьИсториюСтатусовКонтрагента(КонтрагентОбъект.Ссылка, НачалоДня(ТекущаяДата() - 60 * 60 * 24));
			ЗаписатьИсториюСтатусовКонтрагента(КонтрагентОбъект.Ссылка, НачалоДня(ТекущаяДата()));
		Исключение
		КонецПопытки;
		//Сообщить("Установлен статус Потенційний  у контрагента " + Строка(КонтрагентОбъект.Наименование));
		//Сообщить("Установлен оперативний статус Потенційний  у контрагента " + Строка(КонтрагентОбъект.Наименование));
	КонецЦикла;
	
	
	
	//Встановим СтатусКонтрагента
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Контрагенты.Ссылка КАК Контрагент
		|ПОМЕСТИТЬ ТабКонтрагентовДляИзмененияСтатусов
		|ИЗ
		|	Справочник.Контрагенты КАК Контрагенты
		|ГДЕ
		|	Контрагенты.ЭтоГруппа = ЛОЖЬ
		|	И Контрагенты.ПометкаУдаления = ЛОЖЬ
		|	И (Контрагенты.СтатусКонтрагента = ЗНАЧЕНИЕ(Справочник.СтатусыКонтрагентов.Потенційний)
		|			ИЛИ Контрагенты.СтатусКонтрагента = ЗНАЧЕНИЕ(Справочник.СтатусыКонтрагентов.Активний)
		|			ИЛИ Контрагенты.СтатусКонтрагента = ЗНАЧЕНИЕ(Справочник.СтатусыКонтрагентов.Малоактивний)
		|			ИЛИ Контрагенты.СтатусКонтрагента = ЗНАЧЕНИЕ(Справочник.СтатусыКонтрагентов.Неактивний)
		|			ИЛИ Контрагенты.СтатусКонтрагента = ЗНАЧЕНИЕ(Справочник.СтатусыКонтрагентов.ПустаяСсылка))
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПродажиОбороты.Контрагент,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ПродажиОбороты.Регистратор) КАК КоличествоПродаж
		|ПОМЕСТИТЬ ТабПродаж
		|ИЗ
		|	РегистрНакопления.Продажи.Обороты(
		|			&НачПериода,
		|			&КонПериода,
		|			Регистратор,
		|			Контрагент В
		|				(ВЫБРАТЬ
		|					ТабКонтрагентовДляИзмененияСтатусов.Контрагент
		|				ИЗ
		|					ТабКонтрагентовДляИзмененияСтатусов КАК ТабКонтрагентовДляИзмененияСтатусов)) КАК ПродажиОбороты
		|
		|СГРУППИРОВАТЬ ПО
		|	ПродажиОбороты.Контрагент
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТабКонтрагентовДляИзмененияСтатусов.Контрагент,
		|	ЕСТЬNULL(ТабПродаж.КоличествоПродаж, 0) КАК КоличествоПродаж
		|ИЗ
		|	ТабКонтрагентовДляИзмененияСтатусов КАК ТабКонтрагентовДляИзмененияСтатусов
		|		ЛЕВОЕ СОЕДИНЕНИЕ ТабПродаж КАК ТабПродаж
		|		ПО ТабКонтрагентовДляИзмененияСтатусов.Контрагент = ТабПродаж.Контрагент";
	
	Запрос.УстановитьПараметр("НачПериода", НачалоМесяца(ДобавитьМесяц(ТекущаяДата(), -1)));
	Запрос.УстановитьПараметр("КонПериода", КонецМесяца(ДобавитьМесяц(ТекущаяДата(), -1)));	
	
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если ВыборкаДетальныеЗаписи.КоличествоПродаж >= 2 И ВыборкаДетальныеЗаписи.Контрагент.СтатусКонтрагента <> Справочники.СтатусыКонтрагентов.Активний Тогда  
			КонтрагентОбъект = ВыборкаДетальныеЗаписи.Контрагент.ПолучитьОбъект();
			КонтрагентОбъект.СтатусКонтрагента = Справочники.СтатусыКонтрагентов.Активний;
			
			Попытка
				КонтрагентОбъект.Записать();
				//ЗаписатьИсториюСтатусовКонтрагента(КонтрагентОбъект.Ссылка, НачалоДня(ТекущаяДата() - 60 * 60 * 24));
				ЗаписатьИсториюСтатусовКонтрагента(КонтрагентОбъект.Ссылка, НачалоДня(ТекущаяДата()));
			Исключение
			КонецПопытки;

			//Сообщить("Установлен статус Активний  у контрагента " + Строка(КонтрагентОбъект.Наименование));
			
		ИначеЕсли ВыборкаДетальныеЗаписи.КоличествоПродаж = 1 И ВыборкаДетальныеЗаписи.Контрагент.СтатусКонтрагента <> Справочники.СтатусыКонтрагентов.Малоактивний Тогда  
			КонтрагентОбъект = ВыборкаДетальныеЗаписи.Контрагент.ПолучитьОбъект();
			КонтрагентОбъект.СтатусКонтрагента = Справочники.СтатусыКонтрагентов.Малоактивний;

			Попытка
				КонтрагентОбъект.Записать();
				//ЗаписатьИсториюСтатусовКонтрагента(КонтрагентОбъект.Ссылка, НачалоДня(ТекущаяДата() - 60 * 60 * 24));
				ЗаписатьИсториюСтатусовКонтрагента(КонтрагентОбъект.Ссылка, НачалоДня(ТекущаяДата()));
			Исключение
			КонецПопытки;
			
			//Сообщить("Установлен статус Малоактивний  у контрагента " + Строка(КонтрагентОбъект.Наименование));
			
		ИначеЕсли ВыборкаДетальныеЗаписи.КоличествоПродаж = 0 И ВыборкаДетальныеЗаписи.Контрагент.СтатусКонтрагента <> Справочники.СтатусыКонтрагентов.Неактивний И ВыборкаДетальныеЗаписи.Контрагент.СтатусКонтрагента <> Справочники.СтатусыКонтрагентов.Потенційний Тогда  
			КонтрагентОбъект = ВыборкаДетальныеЗаписи.Контрагент.ПолучитьОбъект();
			КонтрагентОбъект.СтатусКонтрагента = Справочники.СтатусыКонтрагентов.Неактивний;
			
			Попытка
				КонтрагентОбъект.Записать();
				//ЗаписатьИсториюСтатусовКонтрагента(КонтрагентОбъект.Ссылка, НачалоДня(ТекущаяДата() - 60 * 60 * 24));
				ЗаписатьИсториюСтатусовКонтрагента(КонтрагентОбъект.Ссылка, НачалоДня(ТекущаяДата()));
			Исключение
			КонецПопытки;
			
			
			//Сообщить("Установлен статус Неактивний  у контрагента " + Строка(КонтрагентОбъект.Наименование));
		КонецЕсли;		

	КонецЦикла;
	
	
	
	//Встановим ОперативныйСтатусКонтрагента
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Контрагенты.Ссылка КАК Контрагент
		|ПОМЕСТИТЬ ТабКонтрагентовДляИзмененияСтатусов
		|ИЗ
		|	Справочник.Контрагенты КАК Контрагенты
		|ГДЕ
		|	Контрагенты.ЭтоГруппа = ЛОЖЬ
		|	И Контрагенты.ПометкаУдаления = ЛОЖЬ
		|	И (Контрагенты.ОперативныйСтатусКонтрагента = ЗНАЧЕНИЕ(Справочник.СтатусыКонтрагентов.Потенційний)
		|			ИЛИ Контрагенты.ОперативныйСтатусКонтрагента = ЗНАЧЕНИЕ(Справочник.СтатусыКонтрагентов.Активний)
		|			ИЛИ Контрагенты.ОперативныйСтатусКонтрагента = ЗНАЧЕНИЕ(Справочник.СтатусыКонтрагентов.Малоактивний)
		|			ИЛИ Контрагенты.ОперативныйСтатусКонтрагента = ЗНАЧЕНИЕ(Справочник.СтатусыКонтрагентов.Неактивний)
		|			ИЛИ Контрагенты.ОперативныйСтатусКонтрагента = ЗНАЧЕНИЕ(Справочник.СтатусыКонтрагентов.ПустаяСсылка))
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПродажиОбороты.Контрагент,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ПродажиОбороты.Регистратор) КАК КоличествоПродаж
		|ПОМЕСТИТЬ ТабПродаж
		|ИЗ
		|	РегистрНакопления.Продажи.Обороты(
		|			&НачПериода,
		|			&КонПериода,
		|			Регистратор,
		|			Контрагент В
		|				(ВЫБРАТЬ
		|					ТабКонтрагентовДляИзмененияСтатусов.Контрагент
		|				ИЗ
		|					ТабКонтрагентовДляИзмененияСтатусов КАК ТабКонтрагентовДляИзмененияСтатусов)) КАК ПродажиОбороты
		|
		|СГРУППИРОВАТЬ ПО
		|	ПродажиОбороты.Контрагент
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТабКонтрагентовДляИзмененияСтатусов.Контрагент,
		|	ЕСТЬNULL(ТабПродаж.КоличествоПродаж, 0) КАК КоличествоПродаж
		|ИЗ
		|	ТабКонтрагентовДляИзмененияСтатусов КАК ТабКонтрагентовДляИзмененияСтатусов
		|		ЛЕВОЕ СОЕДИНЕНИЕ ТабПродаж КАК ТабПродаж
		|		ПО ТабКонтрагентовДляИзмененияСтатусов.Контрагент = ТабПродаж.Контрагент";
	
	Запрос.УстановитьПараметр("НачПериода", НачалоМесяца(ТекущаяДата()));
	Запрос.УстановитьПараметр("КонПериода", КонецМесяца(ТекущаяДата()));	
	
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если ВыборкаДетальныеЗаписи.КоличествоПродаж >= 2 И ВыборкаДетальныеЗаписи.Контрагент.ОперативныйСтатусКонтрагента <> Справочники.СтатусыКонтрагентов.Активний Тогда  
			КонтрагентОбъект = ВыборкаДетальныеЗаписи.Контрагент.ПолучитьОбъект();
			КонтрагентОбъект.ОперативныйСтатусКонтрагента = Справочники.СтатусыКонтрагентов.Активний;

			Попытка
				КонтрагентОбъект.Записать();
				//ЗаписатьИсториюСтатусовКонтрагента(КонтрагентОбъект.Ссылка, НачалоДня(ТекущаяДата() - 60 * 60 * 24));
				ЗаписатьИсториюСтатусовКонтрагента(КонтрагентОбъект.Ссылка, НачалоДня(ТекущаяДата()));
			Исключение
			КонецПопытки;
			
			
			//Сообщить("Установлен оперативный статус Активний  у контрагента " + Строка(КонтрагентОбъект.Наименование));
			
		ИначеЕсли ВыборкаДетальныеЗаписи.КоличествоПродаж = 1 И ВыборкаДетальныеЗаписи.Контрагент.ОперативныйСтатусКонтрагента <> Справочники.СтатусыКонтрагентов.Малоактивний  Тогда  
			КонтрагентОбъект = ВыборкаДетальныеЗаписи.Контрагент.ПолучитьОбъект();
			КонтрагентОбъект.ОперативныйСтатусКонтрагента = Справочники.СтатусыКонтрагентов.Малоактивний;

			Попытка
				КонтрагентОбъект.Записать();
				//ЗаписатьИсториюСтатусовКонтрагента(КонтрагентОбъект.Ссылка, НачалоДня(ТекущаяДата() - 60 * 60 * 24));
				ЗаписатьИсториюСтатусовКонтрагента(КонтрагентОбъект.Ссылка, НачалоДня(ТекущаяДата()));
			Исключение
			КонецПопытки;
			
			
			//Сообщить("Установлен оперативный статус Малоактивний  у контрагента " + Строка(КонтрагентОбъект.Наименование));
			
		ИначеЕсли ВыборкаДетальныеЗаписи.КоличествоПродаж = 0 И ВыборкаДетальныеЗаписи.Контрагент.ОперативныйСтатусКонтрагента <> Справочники.СтатусыКонтрагентов.Неактивний Тогда  
			КонтрагентОбъект = ВыборкаДетальныеЗаписи.Контрагент.ПолучитьОбъект();
			КонтрагентОбъект.ОперативныйСтатусКонтрагента = Справочники.СтатусыКонтрагентов.Неактивний;

			Попытка
				КонтрагентОбъект.Записать();
				//ЗаписатьИсториюСтатусовКонтрагента(КонтрагентОбъект.Ссылка, НачалоДня(ТекущаяДата() - 60 * 60 * 24));
				ЗаписатьИсториюСтатусовКонтрагента(КонтрагентОбъект.Ссылка, НачалоДня(ТекущаяДата()));
			Исключение
			КонецПопытки;
			
			
			//Сообщить("Установлен оперативный статус Неактивний  у контрагента " + Строка(КонтрагентОбъект.Наименование));
		КонецЕсли;		

	КонецЦикла;	


	//Зареєструємо чергу повідомлення про завершення броні
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ХарактеристикиНоменклатуры.Ссылка КАК Характеристика
		|ПОМЕСТИТЬ ТабХарактеристик
		|ИЗ
		|	Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
		|ГДЕ
		|	ХарактеристикиНоменклатуры.ПериодБрони = &ПериодБрони
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТоварыНаСкладахОстатки.ХарактеристикаНоменклатуры КАК Характеристика
		|ИЗ
		|	РегистрНакопления.ТоварыНаСкладах.Остатки(
		|			,
		|			ХарактеристикаНоменклатуры В
		|				(ВЫБРАТЬ
		|					ТабХарактеристик.Характеристика
		|				ИЗ
		|					ТабХарактеристик КАК ТабХарактеристик)) КАК ТоварыНаСкладахОстатки
		|ГДЕ
		|	ТоварыНаСкладахОстатки.КоличествоОстаток > 0";
	
	Запрос.УстановитьПараметр("ПериодБрони", НачалоДня(ТекущаяДата()) - 1);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.Характеристика.Бронь) И ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.Характеристика.Контрагент) Тогда
			ЗаписьОчереди = РегистрыСведений.ОчередьНапоминанийСДействием.СоздатьМенеджерЗаписи();
			ЗаписьОчереди.ТорговыйАгент = ВыборкаДетальныеЗаписи.Характеристика.Бронь;
			ЗаписьОчереди.КонтрагентДляДействий	= ВыборкаДетальныеЗаписи.Характеристика.Контрагент;
			ЗаписьОчереди.ХарактеристикаДляДействий = ВыборкаДетальныеЗаписи.Характеристика;
			ЗаписьОчереди.ТипДействяПриНапоминании = Перечисления.ТипыДействийПриНапоминании.ПродолжениеБрониТовара;
			ЗаписьОчереди.ПериодДобавления = ТекущаяДата();
			ЗаписьОчереди.Записать(); 
			ТекстСообщения = "Додано нагадування про продовження бробні для " + Строка(ВыборкаДетальныеЗаписи.Характеристика.Бронь) + " артикулу " + Строка(ВыборкаДетальныеЗаписи.Характеристика.Владелец.Артикул) + " мішку " + Строка(ВыборкаДетальныеЗаписи.Характеристика) + " на контрагента " + Строка(ВыборкаДетальныеЗаписи.Характеристика.Контрагент);
			ЗаписьЖурналаРегистрации("Добавлено нагадування", УровеньЖурналаРегистрации.Информация,,,ТекстСообщения, РежимТранзакцииЗаписиЖурналаРегистрации.Транзакционная);										
		КонецЕсли;	
	КонецЦикла;
	
	
	//Заповнимо КоличествоДнейОтПоследнейПокупки
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КоличествоДнейПоправить.Контрагент,
		|	КоличествоДнейПоправить.Период,
		|	КоличествоДнейПоправить.КоличествоДнейОтПоследнейПокупки,
		|	ВЫБОР
		|		КОГДА КоличествоДнейПоправить.Период = ДАТАВРЕМЯ(1, 1, 1)
		|			ТОГДА 0
		|		ИНАЧЕ КоличествоДнейПоправить.РеальноеКоличествоДнейОтПоследнейПокупки
		|	КОНЕЦ КАК РеальноеКоличествоДнейОтПоследнейПокупки
		|ИЗ
		|	(ВЫБРАТЬ
		|		ПродажиКлиентов.Контрагент КАК Контрагент,
		|		ПродажиКлиентов.Период КАК Период,
		|		ПродажиКлиентов.КоличествоДнейОтПоследнейПокупки КАК КоличествоДнейОтПоследнейПокупки,
		|		РАЗНОСТЬДАТ(ПродажиКлиентов.Период, &ТекДата, ДЕНЬ) КАК РеальноеКоличествоДнейОтПоследнейПокупки
		|	ИЗ
		|		(ВЫБРАТЬ
		|			Контрагенты.Ссылка КАК Контрагент,
		|			МАКСИМУМ(ЕСТЬNULL(Продажи.Период, ДАТАВРЕМЯ(1, 1, 1))) КАК Период,
		|			Контрагенты.КоличествоДнейОтПоследнейПокупки КАК КоличествоДнейОтПоследнейПокупки
		|		ИЗ
		|			Справочник.Контрагенты КАК Контрагенты
		|				ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.Продажи КАК Продажи
		|				ПО (Продажи.Контрагент = Контрагенты.Ссылка)
		|		
		|		СГРУППИРОВАТЬ ПО
		|			Контрагенты.Ссылка,
		|			Контрагенты.КоличествоДнейОтПоследнейПокупки) КАК ПродажиКлиентов
		|	ГДЕ
		|		(ПродажиКлиентов.Период = ДАТАВРЕМЯ(1, 1, 1)
		|					И ПродажиКлиентов.КоличествоДнейОтПоследнейПокупки > 0
		|				ИЛИ ПродажиКлиентов.Период > ДАТАВРЕМЯ(1, 1, 1))) КАК КоличествоДнейПоправить
		|ГДЕ
		|	(КоличествоДнейПоправить.КоличествоДнейОтПоследнейПокупки <> КоличествоДнейПоправить.РеальноеКоличествоДнейОтПоследнейПокупки
		|			ИЛИ КоличествоДнейПоправить.Период = ДАТАВРЕМЯ(1, 1, 1))";
	
	Запрос.УстановитьПараметр("ТекДата", ТекущаяДата());
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		//РазницаВДнях = (НачалоДня(ТекущаяДата()) - НачалоДня(ВыборкаДетальныеЗаписи.Период)) / (60 * 60 * 24);
		//РазницаВДнях = Окр(РазницаВДнях);
		//Если ВыборкаДетальныеЗаписи.КоличествоДнейОтПоследнейПокупки <> РазницаВДнях Тогда
			Попытка
			 	КонтрагентОбъект = ВыборкаДетальныеЗаписи.Контрагент.ПолучитьОбъект();
			 	КонтрагентОбъект.КоличествоДнейОтПоследнейПокупки = ВыборкаДетальныеЗаписи.РеальноеКоличествоДнейОтПоследнейПокупки;
			 	КонтрагентОбъект.Записать();
			Исключение
				ЗаписьЖурналаРегистрации("ОбновлениеКоличестваДнейОтПоследнейПокупкиКонтрагента", УровеньЖурналаРегистрации.Ошибка,,,"Не вдалось записати контрагента " + ВыборкаДетальныеЗаписи.Контрагент);
			 КонецПопытки;
		//КонецЕсли;	 
		
	КонецЦикла;
	
	//Заповнимо КоличествоДнейОтПоследнейПокупки  ОЧИСТКА
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Контрагенты.Ссылка
		|ИЗ
		|	(ВЫБРАТЬ
		|		Контрагенты.Ссылка КАК Ссылка
		|	ИЗ
		|		Справочник.Контрагенты КАК Контрагенты
		|	ГДЕ
		|		Контрагенты.КоличествоДнейОтПоследнейПокупки > 0) КАК Контрагенты
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.Продажи КАК Продажи
		|		ПО Контрагенты.Ссылка = Продажи.Контрагент
		|ГДЕ
		|	Продажи.Регистратор ЕСТЬ NULL";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Попытка
			КонтрагентОбъект = ВыборкаДетальныеЗаписи.Контрагент.ПолучитьОбъект();
			КонтрагентОбъект.КоличествоДнейОтПоследнейПокупки = 0;
			КонтрагентОбъект.Записать();	
		Исключение
		КонецПопытки;
	КонецЦикла;

	
	

КонецПроцедуры

Процедура ЗаписатьИсториюСтатусовКонтрагента(Контрагент, ДатаЗаписи)
	 ЗаписьИсторииСтатусов = РегистрыСведений.ИсторияСтатусовКонтрагентов.СоздатьМенеджерЗаписи();
	 ЗаписьИсторииСтатусов.Период = ДатаЗаписи;
	 ЗаписьИсторииСтатусов.Контрагент = Контрагент;
	 ЗаписьИсторииСтатусов.СтатусКонтрагента = Контрагент.СтатусКонтрагента;
	 ЗаписьИсторииСтатусов.ОперативныйСтатусКонтрагента = Контрагент.ОперативныйСтатусКонтрагента;
	 ЗаписьИсторииСтатусов.Записать(); 	
КонецПроцедуры	