

&НаКлиенте
Перем мСообщение; 

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если Элементы.Страници.ТекущаяСтраница = Элементы.СтраницаИстория
		И ЭтаФорма.ТекущийЭлемент.Имя = "ТекстИстории"
		И Не ПустаяСтрока(ТекстИстории) Тогда 
		 Отказ = Истина;
		 Если ЗначениеЗаполнено(УИД_РедагуванняЗапису) Тогда 
			 ИсторияРаботиСКлиентом_РедагуванняЗапису();
			 Элементы.СкасуватиРедагування.Видимость = Ложь;	
		 Иначе
			 ИсторияРаботиСКлиентом_ЗаписатьИсторию();
		 КонецЕсли;

		 Возврат;
	КонецЕсли;

	
	ПоискДублейНомеровТелефона(, Отказ);
	
	
КонецПроцедуры

&НаСервере
Процедура  ПоискДублейНомеровТелефона(НомерТелефона = "", Отказ)
	
	
	Если  ЗначениеЗаполнено(НомерТелефона) Тогда 
		Условие = " И Контрагенты.НомерТелефона ПОДОБНО ""%" + Прав(НомерТелефона, 10)+ "%""";
	Иначе 
		Условие = "И (";
		Для Каждого Телефон Из Объект.Телефоны Цикл
			Если ЗначениеЗаполнено(Телефон.НомерТелефона) Тогда 
				Условие = Условие + "Контрагенты.НомерТелефона ПОДОБНО ""%" + Прав(Телефон.НомерТелефона, 10) + "%""" + " Или ";   
			КонецЕсли;
		КонецЦикла;
		
		Если НЕ СтрДлина(Условие) > 4 Тогда 
			Условие = "";
			Возврат;
		Иначе 
			Условие = Условие + "Ложь)";
		КонецЕсли;

	КонецЕсли;
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Контрагенты.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Контрагенты КАК Контрагенты
		|ГДЕ
		|	Контрагенты.Ссылка <> &Ссылка
		|	" + Условие;
	
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если  Выборка.Следующий() Тогда 
		Отказ = истина;
		Сообщить("Контрагент " + Выборка.Ссылка + " має співпадіння по номеру телефону"); 
	КонецЕсли;	
	
	
	Если Отказ = истина 
		Или НомерТелефона = "" Тогда 
		Возврат;
	КонецЕсли;
	
	Ответ = Общий.ПоискДублейНомеровТелефона_НаСервере1С(Прав(НомерТелефона, 10), Объект.Ссылка);
	Если Ответ.Успешно Тогда 
		Если Ответ.Данные.ЕстьДубли Тогда 
			Отказ = истина;
			Сообщить(Ответ.Данные.ТекстОшибки);
		КонецЕсли;
		
		
		Возврат; 
	Иначе
		Сообщить("Контроль унікальності контрагента виконано лише в додатку. Не має підключення до 1С!");
	КонецЕсли;
	
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	КонтрагентОбъект = РеквизитФормыВЗначение("Объект");
	КонтрагентОбъект.Заблокировать();
	ЗначениеВРеквизитФормы(КонтрагентОбъект, "Объект");

	
	ИсторияРаботиСКлиентом();
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавлениеНовогоНомераТелефона(Команда)
	Месенджеры = ПолучитьМесенджеры();
	СЗМесенджер = Новый СписокЗначений;
	СЗМесенджер.Добавить(ПредопределенноеЗначение("Перечисление.ВидыМесендеров.Telegram"), "Telegram",,Месенджеры[0]); 
	СЗМесенджер.Добавить(ПредопределенноеЗначение("Перечисление.ВидыМесендеров.Viber"), "Viber",,Месенджеры[1]);
	НовыйТелефон = "";
	ВвестиСтроку(НовыйТелефон, "Номер телефону");
	мМесенджер = Вопрос("Месенджер для зв'язку", СЗМесенджер);
	Если ЗначениеЗаполнено(НовыйТелефон) Тогда 
		ЕстьДубли =Ложь;
		ПоискДублейНомеровТелефона(НовыйТелефон, ЕстьДубли);
		Если ЕстьДубли Тогда 
			Возврат
		КонецЕсли;
		
		ДобавитьТелефон(НовыйТелефон, мМесенджер);
		Если ПустаяСтрока(СокрЛП(Объект.НомерТелефона)) Тогда 
			Объект.НомерТелефона = НовыйТелефон;
		Иначе
			Объект.НомерТелефона = СокрЛП(Объект.НомерТелефона)+ Символы.ПС + НовыйТелефон;
		КонецЕсли;
		ДобавлениеЭлементаНомераТелефонаНаФорму(СтрЧислоСтрок(Объект.НомерТелефона), НовыйТелефон, Месенджеры);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ДобавлениеЭлементаНомераТелефонаНаФорму(Индекс, НомерТелефона, Месенджеры);
	ТипСтрока = Новый ОписаниеТипов("Строка");
	МассивДобавляемыхРеквизитов = Новый Массив;
	ЭлементСтраницы = Элементы.Добавить("НомерТелефона"+Индекс, Тип("ГруппаФормы"), Элементы.ГруппаДопТелефонны);
	ЭлементСтраницы.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	//ЭлементСтраницы.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяЕслиВозможно;
	//
	//ЭлементПодгруппа = Элементы.Добавить("ЭлементПодгруппа"+ Индекс, Тип("ГруппаФормы"), ЭлементСтраницы);
	//ЭлементПодгруппа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	//ЭлементПодгруппа.Отображение = ОтображениеОбычнойГруппы.Нет;
	//ЭлементПодгруппа.РастягиватьПоГоризонтали = Истина;
	//ЭлементПодгруппа.РастягиватьПоВертикали = Ложь;
	
	НомерТелефону = Новый РеквизитФормы("НомерТелефона"+Индекс, ТипСтрока, "", "Номер телефону");		
	МассивДобавляемыхРеквизитов.Добавить(НомерТелефону);
	
	МассивУдаляемыхРеквизитов = Новый Массив;
	ИзменитьРеквизиты(МассивДобавляемыхРеквизитов, МассивУдаляемыхРеквизитов);
	
		ТЗТелефоны = Объект.Телефоны.Выгрузить();
	Строка = ТЗТелефоны.Найти(НомерТелефона);	
	Если Строка <> Неопределено  
		И Месенджеры.Получить(Строка.Месенджер) <> Неопределено Тогда 
		ЭлементФорми = Элементы.Добавить("ИзображениеНТ"+Индекс,Тип("ДекорацияФормы"), ЭлементСтраницы);
		ЭлементФорми.Вид = ВидДекорацииФормы.Картинка;
		ЭлементФорми.РазмерКартинки = РазмерКартинки.Пропорционально;
		ЭлементФорми.Высота = 1;
		ЭлементФорми.Ширина = 2;
		
		ЭлементФорми.Картинка =  Месенджеры.Получить(Строка.Месенджер);
	КонецЕсли;

	
	ЭлементФорми = Элементы.Добавить("ЭлементНТ"+Индекс,Тип("ПолеФормы"), ЭлементСтраницы);
	ЭлементФорми.ПутьКДанным = "НомерТелефона"+ Индекс;
	ЭлементФорми.Заголовок = "";
	ЭлементФорми.Вид = ВидПоляФормы.ПолеНадписи;
	ЭлементФорми.Гиперссылка = Истина;
	ЭлементФорми.УстановитьДействие("Нажатие", "НабратьНомер");
	ЭтаФорма["НомерТелефона" + Индекс] = НомерТелефона; 


КонецПроцедуры

&НаКлиенте
Процедура НабратьНомер(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	СЗ = Новый СписокЗначений;
	СЗ.Добавить(1, "Зателефонувати");
	СЗ.Добавить(2, "Змінити");
	Сз.Добавить(3, "Вилучити");
	Сз.Добавить(4, "Скасувати");
	Сз.Добавить(5, "Viber");

	Действие = СЗ.ВыбратьЭлемент();
	Номер = ПолучитьДанныеТелефона(Элемент.Имя);

	Если Действие = Неопределено 
		Или Действие.Значение = 4 Тогда 
		Возврат;
		
	ИначеЕсли  Действие.Значение = 1 Тогда 
		#Если МобильноеПриложениеКлиент Тогда 
			Если СредстваТелефонии.ПоддерживаетсяНаборНомера() Тогда
				СредстваТелефонии.НабратьНомер(Номер, Ложь);
			КонецЕсли;
		#КонецЕсли
	ИначеЕсли Действие.Значение = 2 Тогда 
		мНовыйНомер = Номер;
		ВвестиСтроку(мНовыйНомер, "Номер телефону");
		Если ПустаяСтрока(мНовыйНомер) Тогда 
			Возврат;
		КонецЕсли;
		
		Объект.НомерТелефона = СтрЗаменить(Объект.НомерТелефона, Номер, мНовыйНомер);
		ИзменитьНомерТелефону(Номер, мНовыйНомер, Ложь);
		
		Индекс = ПолучитьИндекс(Элемент.Имя);
		ЭтаФорма["НомерТелефона" + Индекс] = мНовыйНомер;
	ИначеЕсли  Действие.Значение = 3 Тогда  
		ИзменитьНомерТелефону(Номер, , Истина);
		Объект.НомерТелефона = СтрЗаменить(Объект.НомерТелефона, Номер, "");
		Объект.НомерТелефона = СтрЗаменить(Объект.НомерТелефона, Символы.ПС + Символы.ПС, Символы.ПС);


		Индекс = ПолучитьИндекс(Элемент.Имя);
		ЭтаФорма["НомерТелефона" + Индекс] = "";
	ИначеЕсли  Действие.Значение = 5 Тогда	
		ОбработатьПереходКВайберу(Номер);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОбработатьПереходКВайберу(Номер)
	
	ЗапуститьПриложение("viber://chat?number=" + Номер);	
	
КонецПроцедуры	

&НаСервере
Функция ПолучитьДанныеТелефона(ИмяЭлемента)
	Возврат ЭтаФорма[Элементы[ИмяЭлемента].ПутьКДанным];
КонецФункции

&НаСервере
Процедура ИсторияРаботиСКлиентом()
	Перем мДата;
	
	ИсторияЗаписи.Очистить();
	Для Каждого стрСписокСозданыхЭлементов Из СписокСозданыхЭлементов Цикл
		ИмяЭлемента = стрСписокСозданыхЭлементов.Значение;
		Элемент = Элементы.Найти(ИмяЭлемента);
		Если Элемент <> Неопределено Тогда 
			Элементы.Удалить(Элемент);
		КонецЕсли; 		
	КонецЦикла;	
	СписокСозданыхЭлементов.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ " + (ИсторияЗаписи.Количество() + 50) + "
		|	РаботаСКлиентом.Период КАК Период,
		|	РаботаСКлиентом.Запись КАК Запись,
		|	РаботаСКлиентом.УИД_Записи КАК УИД_Записи
		|ПОМЕСТИТЬ ПакетИстория
		|ИЗ
		|	РегистрСведений.РаботаСКлиентом КАК РаботаСКлиентом
		|ГДЕ
		|	РаботаСКлиентом.Клиент = &Клиент
		|" + ?(ЗначениеЗаполнено(ТекстПоиска), " И РаботаСКлиентом.Запись ПОДОБНО &ТекстПоиска ", "") + " 
		|
		|УПОРЯДОЧИТЬ ПО
		|	Период УБЫВ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ ПЕРВЫЕ 50
		|	ПакетИстория.Период КАК Период,
		|	ПакетИстория.Запись КАК Запись,
		|	ПакетИстория.УИД_Записи КАК УИД_Записи
		|ИЗ
		|	ПакетИстория КАК ПакетИстория
		|
		|УПОРЯДОЧИТЬ ПО
		|	Период УБЫВ";
	Запрос.УстановитьПараметр("Клиент", Объект.Ссылка);
	Запрос.УстановитьПараметр("ТекстПоиска", "%" + ТекстПоиска + "%");
	Выборка = Запрос.Выполнить().Выбрать();
	
	НомерПоПорядку = 1;
	
	Пока Выборка.Следующий() Цикл
		
		Если мДата <> НачалоДня(Выборка.Период) Тогда 
		    ИсторияРаботиСКлиентом_ДобавитьДатуНаФорму(Выборка.Период);
			мДата = НачалоДня(Выборка.Период);
		КонецЕсли;
		
		ИсторияРаботиСКлиентом_ДобавитьЗаписьНаФорму(Выборка, ,НомерПоПорядку);
		
		НомерПоПорядку =  НомерПоПорядку + 1;
		
		ИсторияЗаписи.Добавить().УИД =  Выборка.УИД_Записи
		
	КонецЦикла;
	ТЗ_История = ИсторияЗаписи.Выгрузить();
	ТЗ_История.Свернуть("УИД");
	ЗначениеВДанныеФормы(ТЗ_История, ИсторияЗаписи);
КонецПроцедуры

&НаСервере
Процедура ИсторияРаботиСКлиентом_ДобавитьЗаписьНаФорму(Данные, ПередЭлементомФормы = Неопределено, НомерПоПорядку = 1)
	перем ПередЭлементом;
	
	
	
	
	Имя = ПолучитьИмяЭлементаФормы("История", Данные.УИД_Записи);
	
	Если Не Элементы.Найти(Имя) = Неопределено Тогда 
		Возврат;
	КонецЕсли;
		
	Если ЗначениеЗаполнено(ПередЭлементомФормы) Тогда
		ПередЭлементом = Элементы.Найти(ПолучитьИмяЭлементаФормы("История", ПередЭлементомФормы));
	КонецЕсли;

	
	
	Группа = Элементы.Вставить(Имя, Тип("ГруппаФормы"), Элементы.СторінкаІсторія, ПередЭлементом);
	Группа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	Группа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;	
	Группа.РастягиватьПоВертикали			= Ложь;
	Группа.ОтображатьЗаголовок 				= Ложь;
	Группа.ГоризонтальноеПоложениеВГруппе 	= ГоризонтальноеПоложениеЭлемента.Лево;
	Если НомерПоПорядку%2 = 0 Тогда
		Группа.ЦветФона = Новый Цвет(240,255,255);
	Иначе		
		Группа.ЦветФона = Новый Цвет(255,255,240);
	КонецЕсли;	
	Группа.РастягиватьПоГоризонтали 		= Истина;
	
	СписокСозданыхЭлементов.Добавить(Группа.Имя);
	
	Элемент = Элементы.Добавить(Имя + "Отступ", Тип("ДекорацияФормы"), Группа);
	Элемент.Вид 	= ВидДекорацииФормы.Надпись;
	Элемент.Ширина 	= 1;
	
	СписокСозданыхЭлементов.Добавить(Элемент.Имя);
	
	
	//мГруппа = Элементы.Добавить(Имя + "ТелоСообщенияГоризонт", Тип("ГруппаФормы"), Группа);
	//мГруппа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	//мГруппа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;	
	//мГруппа.ОтображатьЗаголовок = Ложь;

	
	//Группа = Элементы.Добавить(Имя + "ТелоСообщения", Тип("ГруппаФормы"), Группа);
	//Группа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	//Группа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;	
	//Группа.ОтображатьЗаголовок = Ложь;
	//
	//Группа = Элементы.Добавить(Имя + "ТекстСообщения", Тип("ГруппаФормы"), Группа);
	//Группа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	//Группа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;	
	//Группа.ОтображатьЗаголовок = Ложь;

	Элемент = Элементы.Добавить(Имя + "Текст", Тип("ДекорацияФормы"), Группа);
	Элемент.Вид 					= ВидДекорацииФормы.Надпись;
	Элемент.Заголовок	 			= СокрЛП(Данные.Запись);
	Элемент.АвтоМаксимальнаяШирина 	= Ложь;
	//Элемент.МаксимальнаяШирина 		= 32;
	Элемент.ГоризонтальноеПоложение = ГоризонтальноеПоложениеЭлемента.Лево;
	
	СписокСозданыхЭлементов.Добавить(Элемент.Имя);
	
	Группа = Элементы.Вставить(Имя + "ДопМеню", Тип("ГруппаФормы"), Группа);
	Группа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	Группа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	Группа.ГоризонтальноеПоложениеВГруппе = ГоризонтальноеПоложениеЭлемента.Право;
	Группа.ОтображатьЗаголовок = Ложь;
	Группа.РастягиватьПоВертикали  = Истина;
	Группа.РастягиватьПоГоризонтали  = Истина;
	//Группа.ЦветФона = Новый Цвет(255,255,255);
	Если НомерПоПорядку%2 = 0 Тогда
		Группа.ЦветФона = Новый Цвет(240,255,255);
	Иначе		
		Группа.ЦветФона = Новый Цвет(255,255,240);
	КонецЕсли;	
	
	СписокСозданыхЭлементов.Добавить(Группа.Имя);
	
	Элемент = Элементы.Добавить(Имя + "Меню", Тип("ДекорацияФормы"), Группа);
	Элемент.Вид = ВидДекорацииФормы.Картинка;
	Элемент.Ширина = 1;
	Элемент.Высота = 1;
	Элемент.ГоризонтальноеПоложениеВГруппе = ГоризонтальноеПоложениеЭлемента.Право;
	Элемент.ВертикальноеПоложениеВГруппе = ВертикальноеПоложениеЭлемента.Верх;
	Элемент.Картинка = БиблиотекаКартинок.Меню;
	Элемент.Гиперссылка = Истина;
	Элемент.УстановитьДействие("Нажатие", "МенюСообщенияНажатие");
	Элемент.Подсказка = Данные.УИД_Записи; 
	Элемент.РазмерКартинки = РазмерКартинки.АвтоРазмер;
	
	СписокСозданыхЭлементов.Добавить(Элемент.Имя);

	Элемент = Элементы.Добавить(Имя + "Время", Тип("ДекорацияФормы"), Группа);
	Элемент.Вид = ВидДекорацииФормы.Надпись;
	Элемент.Заголовок = Формат(Данные.Период, "ДФ=ЧЧ:мм");;
	Элемент.Шрифт = Новый Шрифт(,5);
	Элемент.ГоризонтальноеПоложениеВГруппе  = ГоризонтальноеПоложениеЭлемента.Право;
	Элемент.ВертикальноеПоложениеВГруппе = ВертикальноеПоложениеЭлемента.Низ;
	
	СписокСозданыхЭлементов.Добавить(Элемент.Имя);
	
	Создано = Истина;
КонецПроцедуры

&НаСервере
Процедура ИсторияРаботиСКлиентом_ДобавитьДатуНаФорму(Дата, ПередЭлементомФормы = Неопределено)
	
	ИмяЭлемента = "_" + Формат(Дата, "ДФ=ddMMyy");
	
	Элемент = Элементы.Найти(ИмяЭлемента);
	Если Элемент <> Неопределено Тогда 
		Элементы.Удалить(Элемент);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ПередЭлементомФормы) Тогда
		ПередЭлементом = Элементы.Найти(ПолучитьИмяЭлементаФормы("ВходящееСообщение", ПередЭлементомФормы));
		Если ПередЭлементом = Неопределено Тогда 	
			ПередЭлементом = Элементы.Найти(ПолучитьИмяЭлементаФормы("ИсходящееСообщение", ПередЭлементомФормы));
		КонецЕсли;
	КонецЕсли;

	
	Элемент = Элементы.Вставить(ИмяЭлемента, Тип("ДекорацияФормы"), Элементы.СторінкаІсторія, ПередЭлементом);
	Элемент.Вид = ВидДекорацииФормы.Надпись;
	Элемент.Заголовок = Формат(Дата, "ДФ='dd MMMM'");
	Элемент.ГоризонтальноеПоложениеВГруппе = ГоризонтальноеПоложениеЭлемента.Центр;
	Элемент.РастягиватьПоГоризонтали = Истина;
	Элемент.ГоризонтальноеПоложение = ГоризонтальноеПоложениеЭлемента.Центр;
	Элемент.ЦветФона = Новый Цвет(240,240,235);


	СписокСозданыхЭлементов.Добавить(Элемент.Имя);
КонецПроцедуры

&НаСервере
Процедура ИсторияРаботиСКлиентом_ЗаписатьИсторию()

	Менеджер = РегистрыСведений.РаботаСКлиентом.СоздатьМенеджерЗаписи();
	Менеджер.Период = ТекущаяДата();
	Менеджер.Клиент = Объект.Ссылка;
	Менеджер.Запись = ТекстИстории;
	Менеджер.УИД_Записи = Новый УникальныйИдентификатор;
	Менеджер.Записать();
	Общий.ОбновитьПоследнююРаботуСКлиентом(Объект.Ссылка);

	ТекстИстории = "";
	мСообщение = "";
	ИсторияРаботиСКлиентом_ДобавитьЗаписьНаФорму(Менеджер);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьИмяЭлементаФормы(Префикс, УИД)
	Возврат Префикс + СтрЗаменить(УИД, "-", "");	
КонецФункции



&НаКлиенте
Процедура ЗаписатьИсториюНажатие(Элемент)
	
	Записать();
	
	Если мСообщение = "" Тогда 
		Возврат;
	КонецЕсли;
	
	ТекстИстории = мСообщение;
	
	Если ЗначениеЗаполнено(УИД_РедагуванняЗапису) Тогда 
		ИсторияРаботиСКлиентом_РедагуванняЗапису();
		Элементы.СкасуватиРедагування.Видимость = Ложь;	
	Иначе
		ИсторияРаботиСКлиентом_ЗаписатьИсторию();
	КонецЕсли;
	мСообщение = "";
	Прочитать();
	
	
КонецПроцедуры

&НаКлиенте
Процедура ИсторияИзменениеТекстаРедактирования(Элемент, Текст, СтандартнаяОбработка)
	мСообщение = Текст;
	Если Прав(Текст, 2) = Символ(10) + Символ(10) ИЛИ Прав(Текст, 2) = Символ(13) + Символ(13) Тогда 
		Текст = Лев(Текст, СтрДлина(Текст) -2);
		ЗаписатьИсториюНажатие(Элемент)
	КонецЕсли;
	
		
КонецПроцедуры

&НаСервере
Процедура ПриОткрытииНаСервере()
	
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Месенджеры = ПолучитьМесенджеры();
	Если Не ПустаяСтрока(Объект.НомерТелефона) Тогда 
		Для Н=1 по СтрЧислоСтрок(Объект.НомерТелефона) Цикл
			ДобавлениеЭлементаНомераТелефонаНаФорму(Н,  СтрПолучитьСтроку(Объект.НомерТелефона, Н), Месенджеры);
		КонецЦикла;
	КонецЕсли;
	
	
	ЗаблокироватьДанныеФормыДляРедактирования();
	
	НачалоПериодаПродаж = НачалоГода(ТекущаяДата());
	КонецПериодаПродаж  = КонецМесяца(ТекущаяДата());
	
	НачалоПериодаПрезентаций = НачалоГода(ТекущаяДата());
	КонецПериодаПрезентаций  = КонецМесяца(ТекущаяДата());	
	
	Закази.КомпоновщикНастроек.Настройки.Отбор.Элементы[1].ПравоеЗначение = Объект.Ссылка;
	
	ПроверитьНаличиеСообщения();
	
	мМассивСозданыхЭлементов = Новый Массив;
	
	

КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьМесенджеры()
	Месенджеры = Новый Соответствие;
	Месенджеры.Вставить(ПредопределенноеЗначение("Перечисление.ВидыМесендеров.Telegram"), БиблиотекаКартинок.Telegram);
	Месенджеры.Вставить(ПредопределенноеЗначение("Перечисление.ВидыМесендеров.Viber"), БиблиотекаКартинок.Viber);
	Возврат Месенджеры;
КонецФункции

&НаСервере
Процедура ДобавитьТелефон(Телефон, ВидМесенджера);
	
	мТелефон = Объект.Телефоны.Добавить();
	мТелефон.НомерТелефона = Телефон;
	мТелефон.Месенджер = ВидМесенджера;
КонецПроцедуры

&НаСервере
Процедура ИзменитьНомерТелефону(Телефон, НовыйТелефон, Удалить)
	мТелефон = Объект.Телефоны.НайтиСтроки(Новый Структура("НомерТелефона", Телефон));
	Если мТелефон.Количество() Тогда 	
		Если Удалить Тогда 
			Объект.Телефоны.Удалить(мТелефон[0]);
		Иначе
			мТелефон[0].НомерТелефона = НовыйТелефон;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПолучитьИндекс(ИмяЭлемента)
	
	Возврат СтрЗаменить(Элементы[ИмяЭлемента].ПутьКДанным, "НомерТелефона", "");
	 
 КонецФункции


&НаКлиенте
 Процедура ЗакрытиеСтарыхЗаказов(Команда)
	форма = ПолучитьФорму("Обработка.ЗакрытиеСтарыхЗаказов.Форма.Форма");
	форма.объект.Контрагент = Объект.Ссылка;
	форма.Открыть(); 
 КонецПроцедуры


&НаКлиенте
Процедура СоздатьЗаказ(Команда)
	 Перем ДанныеПроверки;
	 
	Общий.ПоискАктуальныхЗаказов(Объект.Ссылка, ДанныеПроверки);
	
	Если ДанныеПроверки.Свойство("Предупреждение") Тогда 
		
		Предупреждение(ДанныеПроверки.Предупреждение);
		Если ДанныеПроверки.Свойство("ОткрытьЗакрытиеЗаказа") Тогда 
			форма = ПолучитьФорму("Обработка.ЗакрытиеСтарыхЗаказов.Форма.Форма");
			форма.объект.Контрагент = Объект.Ссылка;
			форма.Открыть();
		ИначеЕсли ДанныеПроверки.Свойство("Заказ") Тогда 
			ОткрытьЗначение(ДанныеПроверки.Заказ);
		КонецЕсли;	
		
	ИначеЕсли ДанныеПроверки.Свойство("Ошибка") Тогда 
		Предупреждение(ДанныеПроверки.Ошибка);
	Иначе
		форма = ПолучитьФорму("Документ.Заказ.Форма.ФормаДокумента");
		форма.объект.Контрагент = Объект.Ссылка;
		форма.Открыть();
		
	КонецЕсли;
	
КонецПроцедуры


&НаСервере
Процедура ОновитиПродажіНаСервере(Ответ)
	Ответ = Новый Структура;
	Ответ.Вставить("Успех", Истина);
	
	Пароль = Константы.ПарольВхода.Получить();
	ПараметрыКоманды = Новый Структура;
	ПараметрыКоманды.Вставить("Контрагент", Объект.Ссылка.УникальныйИдентификатор());
	ПараметрыКоманды.Вставить("НачалоПериодаПродаж", НачалоПериодаПродаж);
	ПараметрыКоманды.Вставить("КонецПериодаПродаж", КонецДня(КонецПериодаПродаж));
	
	
	Данные = Новый Структура;
	Данные.Вставить("Команда", "ПолучитьОтчетПродажиПоКонтрагенту");
	Данные.Вставить("Параметры", ПараметрыКоманды);
	
	Попытка 
		Прокси = СоединениеСБазой.ПолучитьПрокси();
		СтруктураОтветаПоОтчету = Прокси.ВыполнитьКоманду(Пароль, Обмен_УправлениеОбменом.Сериализовать(Данные)).Получить();
	Исключение
		СтруктураОтветаПоОтчету = Новый Структура;
		СтруктураОтветаПоОтчету.Вставить("Успешно", Ложь);
		СтруктураОтветаПоОтчету.Вставить("Ошибка", ОписаниеОшибки());
	КонецПопытки;

	Если Не СтруктураОтветаПоОтчету.Успешно Тогда
		Ответ.Вставить("Успешно",Ложь);
		Ответ.Вставить("Ошибка", СтруктураОтветаПоОтчету.Ошибка);
		Возврат;
	КонецЕсли;
	
	ТЗОтчетПоПродажам = СтруктураОтветаПоОтчету.Данные;	
	
	ТЗОтчетПоПродажам.Колонки.Добавить("Контрагент");
	ТЗОтчетПоПродажам.Колонки.Добавить("Номенклатура");
	
	Для Каждого стрОтчета Из ТЗОтчетПоПродажам Цикл
		стрОтчета.Контрагент = Справочники.Контрагенты.ПолучитьСсылку(стрОтчета.УИДКонтрагент);
		стрОтчета.Номенклатура = Справочники.Номенклатура.ПолучитьСсылку(стрОтчета.УИДНоменклатура);
	КонецЦикла;	
	
	//ОтчетПоПродажам.Очистить(); 
	
	ТЗОтчетПоПродажамПоМесяцам = ТЗОтчетПоПродажам.Скопировать();
	ТЗОтчетПоПродажамПоМесяцам.Свернуть("Период", "Количество");
	
	//Для Каждого стрОтчетаЗаМесяц Из ТЗОтчетПоПродажамПоМесяцам Цикл
	//	НоваяСтрока = ОтчетПоПродажам.Добавить();	
	//	НоваяСтрока.Период = стрОтчетаЗаМесяц.Период;
	//	НоваяСтрока.Количество = стрОтчетаЗаМесяц.Количество;
	//	Для Каждого стрОтчета Из ТЗОтчетПоПродажам Цикл
	//		Если Не стрОтчета.Период = стрОтчетаЗаМесяц.Период Тогда
	//			Продолжить;
	//		КонецЕсли;	
	//		НоваяСтрока = ОтчетПоПродажам.Добавить();
	//        НоваяСтрока.Период = стрОтчета.Период;
	//		НоваяСтрока.Артикул = стрОтчета.Номенклатура.Артикул;
	//		НоваяСтрока.Номенклатура = стрОтчета.Номенклатура;
	//		НоваяСтрока.Количество = стрОтчета.Количество;
	//	КонецЦикла;	
	//КонецЦикла;   	
	//
	//Элементы.ОтчетПоПродажамКоличество.ТекстПодвала = ТЗОтчетПоПродажам.Итог("Количество");

	ОтчетПоПродажамДеревоЗначение = РеквизитФормыВЗначение("ОтчетПоПродажамДерево");
	ОтчетПоПродажамДеревоЗначение.Строки.Очистить();
		
	
	Для Каждого стрОтчетаЗаМесяц Из ТЗОтчетПоПродажамПоМесяцам Цикл
		НоваяСтрокаРодитель = ОтчетПоПродажамДеревоЗначение.Строки.Добавить();	
		НоваяСтрокаРодитель.Период = стрОтчетаЗаМесяц.Период;
		НоваяСтрокаРодитель.Количество = стрОтчетаЗаМесяц.Количество;
		Для Каждого стрОтчета Из ТЗОтчетПоПродажам Цикл
			Если Не стрОтчета.Период = стрОтчетаЗаМесяц.Период Тогда
				Продолжить;
			КонецЕсли;	
			НоваяСтрока = НоваяСтрокаРодитель.Строки.Добавить();
	        //НоваяСтрока.Период = стрОтчета.Период;
			НоваяСтрока.Артикул = стрОтчета.Номенклатура.Артикул;
			НоваяСтрока.Номенклатура = стрОтчета.Номенклатура;
			НоваяСтрока.Количество = стрОтчета.Количество;
		КонецЦикла;	
	КонецЦикла;   	
	
	ЗначениеВРеквизитФормы(ОтчетПоПродажамДеревоЗначение, "ОтчетПоПродажамДерево");	
	Элементы.ОтчетПоПродажамДеревоКоличество.ТекстПодвала = ТЗОтчетПоПродажам.Итог("Количество")	
	
КонецПроцедуры


&НаКлиенте
 Процедура ОновитиПродажі(Команда)
	Перем ДанныеПроверки; 
	
	ОновитиПродажіНаСервере(ДанныеПроверки);
	 
	Если ДанныеПроверки.Свойство("Ошибка") Тогда 
		Предупреждение(ДанныеПроверки.Ошибка);
	КонецЕсли;

 КонецПроцедуры


&НаКлиенте
 Процедура НачалоПериодаПродажПриИзменении(Элемент)
	 НачалоПериодаПродаж = НачалоМесяца(НачалоПериодаПродаж);
 КонецПроцедуры


&НаКлиенте
 Процедура КонецПериодаПродажПриИзменении(Элемент)
	 КонецПериодаПродаж = КонецМесяца(КонецПериодаПродаж );
 КонецПроцедуры
 
 &НаКлиенте
Процедура МенюСообщенияНажатие(Элемент)
	Кнопки = Новый СписокЗначений;
	//Кнопки.Добавить("Скопировать", "Скопіювати повідомлення");//, , БиблиотекаКартинок.СкопироватьТекст);
	//Если СтрНайти(Элемент.имя, "ИсходящееСообщение") Тогда 
	Кнопки.Добавить("Редагувати", "Редагувати");
	//Кнопки.Добавить("Удалить", "Видалити");//, ,БиблиотекаКартинок.Удалить);
		//КонецЕсли;
	
	мОтмена = Кнопки.Добавить("Отмена", "Відміна		");//, , БиблиотекаКартинок.Назад);
	ДопПараметры = Новый Структура("УИД_Сообщения", Новый УникальныйИдентификатор(Элемент.Подсказка));
	
	Оповещение = Новый ОписаниеОповещения("ОбработатьВыборИзМеню", ЭтаФорма, ДопПараметры);
	ВыбранныйЭлемент = Вопрос("Виберіть дію", Кнопки,, "Отмена", "Чат 1с");
	ОбработатьВыборИзМеню(ВыбранныйЭлемент, ДопПараметры);				//ВыбратьИзМеню(
	
	
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьВыборИзМеню(ВыбранныйЭлемент, Параметры) Экспорт 
	Если ВыбранныйЭлемент = "Удалить" Тогда  
		//УдалитьСообщение(Параметры.УИД_Сообщения);
	ИначеЕсли ВыбранныйЭлемент = "Редагувати" Тогда     
		РедагуавтиЗаписІсторії(Параметры.УИД_Сообщения);
	КонецЕсли;
	
КонецПроцедуры

 
&НаСервере
Процедура РедагуавтиЗаписІсторії(УИД_Запису)
	
	    	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	УИД = Новый УникальныйИдентификатор(УИД_Запису);	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РаботаСКлиентом.Запись КАК Запись,
		|	РаботаСКлиентом.УИД_Записи КАК УИД_Записи
		|ИЗ
		|	РегистрСведений.РаботаСКлиентом КАК РаботаСКлиентом
		|ГДЕ
		|	РаботаСКлиентом.УИД_Записи = &УИД_Записи";
	
	Запрос.УстановитьПараметр("УИД_Записи", УИД);
	
	
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда 
		ТекстИстории = Выборка.Запись;
		УИД_РедагуванняЗапису = УИД;
		Элементы.СкасуватиРедагування.Видимость = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ИсторияРаботиСКлиентом_РедагуванняЗапису()
	
	  
	//    	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	//// Данный фрагмент построен конструктором.
	//// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	УИД = Новый УникальныйИдентификатор(УИД_РедагуванняЗапису);	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РаботаСКлиентом.Период КАК Период,
	|	РаботаСКлиентом.Клиент КАК Клиент
	|ИЗ
	|	РегистрСведений.РаботаСКлиентом КАК РаботаСКлиентом
	|ГДЕ
	|	РаботаСКлиентом.УИД_Записи = &УИД_Записи";
	
	Запрос.УстановитьПараметр("УИД_Записи", УИД);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда 
		
		Запись = РегистрыСведений.РаботаСКлиентом.СоздатьМенеджерЗаписи();
		Запись.Период = Выборка.Период;
		Запись.Клиент = Выборка.Клиент;
		Запись.УИД_Записи = УИД_РедагуванняЗапису;
		Запись.Запись = ТекстИстории;
		Запись.Записать(Истина);
		Общий.ОбновитьПоследнююРаботуСКлиентом(Выборка.Клиент);
	КонецЕсли;
	
	
	Имя = ПолучитьИмяЭлементаФормы("История", УИД_РедагуванняЗапису);
	
	Элементы[Имя + "Текст"].Заголовок = ТекстИстории;
	
	ТекстИстории = "";
	мСообщение = "";
	УИД_РедагуванняЗапису = Неопределено;

КонецПроцедуры

&НаКлиенте
Процедура СкасуватиРедагування(Команда)
	УИД_РедагуванняЗапису = Неопределено;
	ТекстИстории = "";
	мСообщение = "";
	Элементы.СкасуватиРедагування.Видимость = Ложь;
КонецПроцедуры


&НаСервере
Функция  ТелефонКонтрагента() 
	СЗ = Новый СписокЗначений();
	НомерТелефона = Объект.НомерТелефона;
	Если Не ПустаяСтрока(НомерТелефона) Тогда 
		Для Н=1 по СтрЧислоСтрок(НомерТелефона) Цикл
			СЗ.Добавить(СтрПолучитьСтроку(НомерТелефона, Н));
		КонецЦикла;
	КонецЕсли;
	
	Возврат СЗ;	
КонецФункции 

#Если МобильноеПриложениеКлиент Тогда
	
	&НаКлиенте
	Процедура ВідпправитиПовідомленняПроБорг(Команда)
		
		//ПересчитатьСуммы();
		//ЗаписатьПриИзменении(Истина); //intrata_wald_02072021

		НомераТелефонов = ТелефонКонтрагента();
		Если НомераТелефонов.Количество() > 1 Тогда 
			ВыбрЗнач = НомераТелефонов.ВыбратьЭлемент("Номер телефона клієнта");
			Если ВыбрЗнач = Неопределено Тогда 
				Возврат;
			КонецЕсли;
			Телефон = ВыбрЗнач.Значение;
		ИначеЕсли  НомераТелефонов.Количество() = 1 Тогда 
			Телефон = НомераТелефонов[0].Значение;
		КонецЕсли;

		
		НовВз = Новый ЗапускПриложенияМобильногоУстройства();
		
		НовВз.Действие = "android.intent.action.SEND";
		НовВз.Приложение = "com.viber.voip"; 
		НовВз.ИмяКласса = "com.viber.voip.WelcomeShareActivity"; 
		НовВз.Тип = "text/plain";
		НовВз.ДополнительныеДанные.Добавить("android.intent.extra.TEXT", ОтриматиТекстПовідомленняПроБорг());
		
		НовВз.Запустить(Истина);
				
	КонецПроцедуры  
	
	#Иначе

&НаКлиенте
Процедура ВідпправитиПовідомленняПроБорг(Команда)
	
	НомераТелефонов = ТелефонКонтрагента();
	Если НомераТелефонов.Количество() > 1 Тогда 
		ВыбрЗнач = НомераТелефонов.ВыбратьЭлемент("Номер телефона клієнта");
		Если ВыбрЗнач = Неопределено Тогда 
			Возврат;
		КонецЕсли;
		Телефон = ВыбрЗнач.Значение;
	ИначеЕсли  НомераТелефонов.Количество() = 1 Тогда 
		Телефон = НомераТелефонов[0].Значение;
	КонецЕсли;
	
	Сообщить(ОтриматиТекстПовідомленняПроБорг());
	
	
КонецПроцедуры  

#КонецЕсли   

&НаСервере
Функция ОтриматиТекстПовідомленняПроБорг()
	
	Текст = "Добрий день! ";
	Если Объект.Борг <> 0 Тогда
		Текст = Текст + "Ваша дебіторська заборгованість на " + Формат(ТекущаяДата(), "ДФ=dd.MM.yyyy") + " становить - " + Объект.Борг + " €" + ". ";
	КонецЕсли;
	Если Объект.ПросроченийБорг <> 0 Тогда 
    	Текст = Текст + "Протермінована заборгованість більше 14 днів становить - " + Объект.ПросроченийБорг + " €" + ".";    
	КонецЕсли;
	Возврат Текст;
	
КонецФункции

&НаСервере
Процедура ОновитиСтатусиЗакаівНаСервере(Ответ)
	КонтрагентОбъект = РеквизитФормыВЗначение("Объект");
	КонтрагентОбъект.ОновитиСтатусиЗакаів(Ответ);
	
	Элементы.Закази.Обновить();	
КонецПроцедуры

&НаКлиенте
Процедура ОновитиСтатусиЗаказів(Команда)
	Перем ДанныеПроверки; 
	
	ОновитиСтатусиЗакаівНаСервере(ДанныеПроверки);
	 
	Если ДанныеПроверки.Свойство("Ошибка") Тогда 
		Предупреждение(ДанныеПроверки.Ошибка);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура СтранициПриСменеСтраницыНаСервере()
	Если Элементы.Страници.ТекущаяСтраница = Элементы.НагадуванняГруппа Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	НагадуванняСпр.Ссылка КАК Нагадування,
		|	НагадуванняСпр.Активне КАК Активне,
		|	НагадуванняСпр.ДатаНапоминания КАК ДатаНапоминания,
		|	НагадуванняСпр.Нагадування КАК ТекстНагадування
		|ИЗ
		|	Справочник.Нагадування КАК НагадуванняСпр
		|ГДЕ
		|	(НагадуванняСпр.Контрагент = &Контрагент
		|			ИЛИ НагадуванняСпр.КонтрагентДляДействий = &Контрагент
		|			ИЛИ НагадуванняСпр.КонтрагентВидео = &Контрагент)
		|
		|УПОРЯДОЧИТЬ ПО
		|	НагадуванняСпр.Код УБЫВ,
		|	ДатаНапоминания УБЫВ";
		
		Запрос.УстановитьПараметр("Контрагент", Объект.Ссылка);
		
		
		ТЗРезультатЗапроса = Запрос.Выполнить().Выгрузить();
		
		Нагадування.Загрузить(ТЗРезультатЗапроса);
		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СтранициПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	СтранициПриСменеСтраницыНаСервере();
	
	Если ТекущаяСтраница.Имя = "ГруппаВайбер" Тогда
		ОбновлениеПоляПерепискиВайбер();
		ПодключитьОбработчикОжидания("ОбновлениеПоляПерепискиВайбер", 10);
		ПодключитьОбработчикОжидания("ПереехатьВниз", 1, Истина);
		
		ПодключитьОбработчикОжидания("ОтправитьСообщениеПрочитано", 1, Ложь);
		
	Иначе		
		ОтключитьОбработчикОжидания("ОбновлениеПоляПерепискиВайбер");
		ОтключитьОбработчикОжидания("ОтправитьСообщениеПрочитано");

	КонецЕсли;	
	

КонецПроцедуры

&НаКлиенте
Процедура НагадуванняВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ПараметрыФормы = Новый Структура("Ключ", Элементы.Нагадування.ТекущиеДанные.Нагадування);
	ОткрытьФорму("Справочник.Нагадування.Форма.ФормаЭлемента", ПараметрыФормы);
КонецПроцедуры




#Область Вайбер

&НаКлиенте
Процедура ОбновлениеПоляПерепискиВайбер()Экспорт
	
	Результат = ViberОбновлениеСервер.ПолучитьПолеПереписки(Объект.Ссылка, КаталогФайлов);
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Переписка = Результат.Переписка;
	
	ПодключитьОбработчикОжидания("ПереехатьВниз", 1, Истина);

	
	
КонецПроцедуры	

&НаКлиенте
Процедура ПереехатьВниз()Экспорт
	
	Элементы.Переписка.Документ.body.scrollTop = Элементы.Переписка.Документ.body.scrollHeight + 9999;
	
	
КонецПроцедуры	

&НаКлиенте
Процедура ПерепискаПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
	
	Если ДанныеСобытия.Element.currentSrc <> Неопределено Тогда	
		ЗапуститьПриложение(ДанныеСобытия.Element.currentSrc);
	Иначе
		Попытка
			ЗапуститьПриложение(ДанныеСобытия.Element.innerHTML);
		Исключение КонецПопытки;	
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьСообщение(Команда)
	
	Если НЕ ЗначениеЗаполнено(НовоеСообщение) И Не ЗначениеЗаполнено(ВыбратьФайл) Тогда
		 #Если МобильноеПриложениеКлиент Тогда
			 Текст = "Вкажіть файл або введіть текст";  
			 СредстваМультимедиа.ВоспроизвестиТекст(Текст,,,,,Истина);
		 #Иначе
			 Текст = "Вкажіть файл або введіть текст";
			 Сообщить(Текст);
		 #КонецЕсли
	Иначе	 
		
		СписокПолучателей = ПолучитьСписокКлиентов();
		ViberОбновлениеКлиент.ОтправитьСообщенияСКлиента(СписокПолучателей, НовоеСообщение, ВыбратьФайл);			
	КонецЕсли;
	
	НовоеСообщение = "";
	ВыбратьФайл    = "";
	
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьФайлНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	
	Если Диалог.Выбрать() Тогда
    	ВыбратьФайл = Диалог.ПолноеИмяФайла;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСписокКлиентов()
	
	МассивКонтрагентов = Новый Массив;
	
	МассивКонтрагентов.Добавить(Объект.Ссылка);		
	
	Возврат МассивКонтрагентов;
	
КонецФункции

&НаКлиенте
Процедура НовоеСообщениеОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	
	Если НЕ ЗначениеЗаполнено(Текст) Тогда
		
	Иначе	 
		
		СписокПолучателей = ПолучитьСписокКлиентов();
		ViberОбновлениеКлиент.ОтправитьСообщенияСКлиента(СписокПолучателей, Текст, ВыбратьФайл);			
	КонецЕсли;
	
	НовоеСообщение = "";
	ВыбратьФайл    = "";
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьФайлОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(ВыбратьФайл) Тогда
		
	Иначе	 
		
		СписокПолучателей = ПолучитьСписокКлиентов();
		ViberОбновлениеКлиент.ОтправитьСообщенияСКлиента(СписокПолучателей, НовоеСообщение, ВыбратьФайл);	
		
	КонецЕсли;
	
	НовоеСообщение = "";
	ВыбратьФайл    = "";

	

	
	
	
КонецПроцедуры

&НаКлиенте
Процедура НовоеСообщениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Оповещение = Новый ОписаниеОповещения("ОткрытьПараметрыЗавершениеПроцент", ЭтотОбъект);
    ОткрытьФорму("Справочник.ШаблоныСообщений.Форма.ФормаВыбора", , , , , , Оповещение, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьПараметрыЗавершениеПроцент(Результат, ДополнительныеПараметры) Экспорт

	Если ЗначениеЗаполнено(Результат) Тогда
		НовоеСообщение = ПолучитьТекст(Результат);
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция ПолучитьТекст(Результат)
	
	Возврат Результат.Текст;
	
КонецФункции	

&НаКлиенте
Процедура ПерейтиУВайбер(Команда)
	
	ОбработатьПереходКВайберу(Объект.НомерТелефона);
	ЭтаФорма.Закрыть();

	
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьСообщениеПрочитано()Экспорт
	
	Объект.НовоеСообщение = ПроверитьНовоеСообщение();
	
	Если Объект.НовоеСообщение Тогда
		ВыполнитьВФонеНаСервереСообщениеПрочитано();
		//Объект.НовоеСообщение = Ложь;
		ЗаписатьСообщениеПрочитано();
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьСообщениеПрочитано()
	
	Запись = РегистрыСведений.НовоеСообщение.СоздатьМенеджерЗаписи();
	Запись.Контакт = Объект.Ссылка;
	Запись.Прочитать();
	Если Запись.Выбран() Тогда
		Запись.Новое = Ложь;
		Запись.Записать();
	КонецЕсли;

	
КонецПроцедуры	

&НаСервере
Функция ПроверитьНовоеСообщение()
	
	Запись = РегистрыСведений.НовоеСообщение.СоздатьМенеджерЗаписи();
	Запись.Контакт = Объект.Ссылка;
	Запись.Прочитать();
	Если Запись.Выбран() Тогда
		Возврат Запись.Новое;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции	

&НаСервере
Процедура ВыполнитьВФонеНаСервереСообщениеПрочитано()
	
	ViberОбновлениеСервер.ОтправитьСообщениеПрочитано(Объект.Ссылка);
	
	
КонецПроцедуры	

&НаКлиенте
Процедура НовоеСообщение1ИзменениеТекстаРедактирования(Элемент, Текст, СтандартнаяОбработка)
	
	ОтключитьОбработчикОжидания("ОбновлениеПоляПерепискиВайбер");
	ОтключитьОбработчикОжидания("ОтправитьСообщениеПрочитано");	
	
КонецПроцедуры

&НаКлиенте
Процедура НовоеСообщение1ОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	
	ПодключитьОбработчикОжидания("ОбновлениеПоляПерепискиВайбер", 10);
	ПодключитьОбработчикОжидания("ОтправитьСообщениеПрочитано", 30);

	
КонецПроцедуры

&НаСервере
Процедура ПроверитьНаличиеСообщения();
	
	Запись = РегистрыСведений.НовоеСообщение.СоздатьМенеджерЗаписи();
	Запись.Контакт = Объект.Ссылка;
	Запись.Прочитать();
	Если Запись.Выбран() Тогда
		Если Объект.НовоеСообщение <> Запись.Новое Тогда
			Объект.НовоеСообщение = Запись.Новое;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры	

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)

	Если ЗначениеЗаполнено(Объект.КонтактВайбер) 
		И Объект.КонтактВайбер.Новый Тогда
		
		Запись = РегистрыСведений.РегистрацияОбмена.СоздатьМенеджерЗаписи();
		ЗАпись.Объект = Объект.Ссылка;
		Запись.ид = Новый УникальныйИдентификатор;
		Запись.Записать();
		
		
		Спр = Объект.КонтактВайбер.ПолучитьОбъект();
		Спр.Новый = Ложь;
		Спр.Контрагент = Объект.Ссылка;
		Спр.Наименование = Объект.Наименование;

		Спр.Записать();
		
		
		ViberОбновлениеСервер.ОтправитьКонтрагентаНаСервере(Объект.КонтактВайбер, Объект.Ссылка);
		
	КонецЕсли;	
	
	
КонецПроцедуры

#КонецОбласти



&НаКлиенте
Процедура ДекорацияПоискНажатие(Элемент)
	мВидимостьПоиска 					= Элемент.Имя = "ДекорацияПоиск";
	Элементы.ТекстПоиска.Видимость 		= мВидимостьПоиска;
	Элементы.ДекорацияПоиск.Видимость 	= Не мВидимостьПоиска;
	Элементы.ОтменаПоиска.Видимость 	= мВидимостьПоиска;
	//
	//Если Не Элементы.ОсновнаяСтарница.ТекущаяСтраница = Элементы.Чаты Тогда 
	//	Элементы.ПерепискаГМНазад.Видимость			= Не мВидимостьПоиска;
	//	Элементы.ПерепискаГМНаименование.Видимость 	= Не мВидимостьПоиска;
	//КонецЕсли;
	//
	
КонецПроцедуры

 &НаКлиенте
Процедура ОтменаПоискаНажатие(Элемент)
	ДекорацияПоискНажатие(Элемент);
	ТекстПоиска = "";
	ИсторияРаботиСКлиентом();
КонецПроцедуры

&НаСервере
Процедура ТекстПоискаПриИзмененииНаСервере()
	ИсторияРаботиСКлиентом();
КонецПроцедуры

&НаКлиенте
Процедура ТекстПоискаПриИзменении(Элемент)
	Если ПустаяСтрока(ТекстПоиска) Тогда 
		Возврат;
	КонецЕсли;
	
	ТекстПоискаПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура НачалоПериодаПрезентацийПриИзменении(Элемент)
	НачалоПериодаПрезентаций = НачалоМесяца(НачалоПериодаПрезентаций);
КонецПроцедуры

&НаКлиенте
Процедура КонецПериодаПрезентацийПриИзменении(Элемент)
	КонецПериодаПрезентаций = КонецМесяца(КонецПериодаПрезентаций);
КонецПроцедуры

&НаСервере
Процедура ОновитиПрезентаціїНаСервере(Ответ)
	Ответ = Новый Структура;
	Ответ.Вставить("Успех", Истина);
	
	Пароль = Константы.ПарольВхода.Получить();
	ПараметрыКоманды = Новый Структура;
	ПараметрыКоманды.Вставить("Контрагент", Объект.Ссылка.УникальныйИдентификатор());
	ПараметрыКоманды.Вставить("НачалоПериодаПродаж", НачалоПериодаПрезентаций);
	ПараметрыКоманды.Вставить("КонецПериодаПродаж", КонецДня(КонецПериодаПрезентаций));
	
	
	Данные = Новый Структура;
	Данные.Вставить("Команда", "ПолучитьОтчетПрезентацииПоКонтрагенту");
	Данные.Вставить("Параметры", ПараметрыКоманды);
	
	Попытка 
		Прокси = СоединениеСБазой.ПолучитьПрокси();
		СтруктураОтветаПоОтчету = Прокси.ВыполнитьКоманду(Пароль, Обмен_УправлениеОбменом.Сериализовать(Данные)).Получить();
	Исключение
		СтруктураОтветаПоОтчету = Новый Структура;
		СтруктураОтветаПоОтчету.Вставить("Успешно", Ложь);
		СтруктураОтветаПоОтчету.Вставить("Ошибка", ОписаниеОшибки());
	КонецПопытки;

	Если Не СтруктураОтветаПоОтчету.Успешно Тогда
		Ответ.Вставить("Успешно",Ложь);
		Ответ.Вставить("Ошибка", СтруктураОтветаПоОтчету.Ошибка);
		Возврат;
	КонецЕсли;
	
	ТЗОтчетПоПрезентациям = СтруктураОтветаПоОтчету.Данные;	
	
	ТЗОтчетПоПрезентациям.Колонки.Добавить("Контрагент");
	ТЗОтчетПоПрезентациям.Колонки.Добавить("Номенклатура");
	
	Для Каждого стрОтчета Из ТЗОтчетПоПрезентациям Цикл
		стрОтчета.Контрагент = Справочники.Контрагенты.ПолучитьСсылку(стрОтчета.УИДКонтрагент);
		стрОтчета.Номенклатура = Справочники.Номенклатура.ПолучитьСсылку(стрОтчета.УИДНоменклатура);
	КонецЦикла;	
	
	//ОтчетПоПродажам.Очистить(); 
	
	ТЗОтчетПоПрезентациямПоМесяцам = ТЗОтчетПоПрезентациям.Скопировать();
	ТЗОтчетПоПрезентациямПоМесяцам.Свернуть("ПериодНачалоМесяца", "Количество");

	ОтчетПоПрезентациямДеревоЗначение = РеквизитФормыВЗначение("ОтчетПоПрезентациямДерево");
	ОтчетПоПрезентациямДеревоЗначение.Строки.Очистить();
		
	
	Для Каждого стрОтчетаЗаМесяц Из ТЗОтчетПоПрезентациямПоМесяцам Цикл
		НоваяСтрокаРодитель = ОтчетПоПрезентациямДеревоЗначение.Строки.Добавить();	
		НоваяСтрокаРодитель.Период = стрОтчетаЗаМесяц.ПериодНачалоМесяца;
		НоваяСтрокаРодитель.Количество = стрОтчетаЗаМесяц.Количество;
		Для Каждого стрОтчета Из ТЗОтчетПоПрезентациям Цикл
			Если Не НачалоМесяца(стрОтчета.Период) = стрОтчетаЗаМесяц.ПериодНачалоМесяца Тогда
				Продолжить;
			КонецЕсли;	
			НоваяСтрока = НоваяСтрокаРодитель.Строки.Добавить();
	        НоваяСтрока.Период = стрОтчета.Период;
			НоваяСтрока.Артикул = стрОтчета.Номенклатура.Артикул;
			НоваяСтрока.Номенклатура = стрОтчета.Номенклатура;
			НоваяСтрока.Коментар = стрОтчета.Коментар;
			НоваяСтрока.КоментарМенеджера = стрОтчета.КоментарМенеджера;
			НоваяСтрока.Количество = стрОтчета.Количество;
		КонецЦикла;	
	КонецЦикла;   	
	
	ЗначениеВРеквизитФормы(ОтчетПоПрезентациямДеревоЗначение, "ОтчетПоПрезентациямДерево");	
	Элементы.ОтчетПоПрезентациямДеревоКоличество.ТекстПодвала = ТЗОтчетПоПрезентациямПоМесяцам.Итог("Количество")	

КонецПроцедуры

&НаКлиенте
Процедура ОновитиПрезентації(Команда)
	
	Перем ДанныеПроверки; 
	
	ОновитиПрезентаціїНаСервере(ДанныеПроверки);
	 
	Если ДанныеПроверки.Свойство("Ошибка") Тогда 
		Предупреждение(ДанныеПроверки.Ошибка);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
		// Вставить содержимое обработчика.
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	// Тут будем виклиати прямий запис в базу
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда 
		Попытка
			Обмен_УправлениеОбменом.ОтправтьДанныеКонтрагентаНапрямую(Объект);
		Исключение
		//		
		КонецПопытки;		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Если НЕ Отказ Тогда 
		Объект.ДатаОновлення = ТекущаяДата();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОновитиПовідомленняВайбер(Команда)
	ViberОбновлениеКлиент.ВыполнитьОбменСообщениями();
КонецПроцедуры

&НаКлиенте
Процедура СоцМережі1МережаПриИзменении(Элемент)
	
		
КонецПроцедуры

&НаКлиенте
Процедура СоцМережі1ПосиланняПриИзменении(Элемент)
	
	ПоточнийРядок = Элементы.СоцМережі1.ТекущиеДанные;
	ПоточнийРядок.ПосиланняВБраузері = ПоточнийРядок.Посилання;
	
КонецПроцедуры

&НаКлиенте
Процедура СоцМережі1Выбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ПоточнийРядок = Элементы.СоцМережі1.ТекущиеДанные;
	Если Поле.Имя = "СоцМережі1ПосиланняВБраузері" И ЗначениеЗаполнено(ПоточнийРядок.ПосиланняВБраузері) Тогда
		ЗапуститьПриложение(ПоточнийРядок.ПосиланняВБраузері);
	КонецЕсли;
	
КонецПроцедуры












