Перем мВалютаУправленческогоУчета Экспорт; 
Перем мВалютаРегламентированногоУчета Экспорт;
Перем мОтражатьВРегламентированномУчете Экспорт;
Перем мПорядокСписанияПартий;
Перем мТекущаяСхемаНалогообложения;
Перем мУдалятьДвижения;

Процедура ИнициализироватьНовыйДокумент(ПараметрОбъектКопирования, ПараметрОснование) Экспорт
	
	#Если Клиент Или ВнешнееСоединение Тогда
		ЗаполнениеДокументов.ЗаполнитьШапкуДокумента(ЭтотОбъект, глЗначениеПеременной("глТекущийПользователь"), ПолучитьВалютуРегламентированногоУчета(), "Продажа", ПараметрОбъектКопирования, ПараметрОснование);
	#КонецЕсли
	
	ПриИзмененииОрганизации();
	
КонецПроцедуры // ИнициализироватьНовыйДокумент()	

Процедура ПриИзмененииОрганизации(ПодменюДействияФормы = Неопределено, ЭлементыФормыНомер = Неопределено) Экспорт
	
	Если Не ПустаяСтрока(Номер) Тогда
		МеханизмНумерацииОбъектов.СброситьУстановленныйКодНомерОбъекта(ЭтотОбъект, "Номер", ПодменюДействияФормы, ЭлементыФормыНомер);
	КонецЕсли;
	
	ОбщегоНазначения.ОбработатьПризнакОтраженияВреглУчете(ЭтотОбъект, ,,мОтражатьВРегламентированномУчете,истина);
	
КонецПроцедуры // ПриИзмененииОрганизации()

// Возвращает значение переменной мВалютаРегламентированногоУчета. Если переменная не проинициализирована,
//	выполняет ее инициализацию.
//
// Возвращаемое значение:
//   СправочникСсылка.Валюты – значение переменной мВалютаРегламентированногоУчета
//
Функция ПолучитьВалютуРегламентированногоУчета() Экспорт
	
	Если мВалютаРегламентированногоУчета = Неопределено Тогда
		мВалютаРегламентированногоУчета = глЗначениеПеременной("ВалютаРегламентированногоУчета");
	КонецЕсли;
	
	Возврат мВалютаРегламентированногоУчета;
	
КонецФункции // ПолучитьВалютуРегламентированногоУчета()

/////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ДЛЯ ОБЕСПЕЧЕНИЯ ПРОВЕДЕНИЯ ДОКУМЕНТА

// Выгружает результат запроса в табличную часть, добавляет ей необходимые колонки для проведения.
//
// Параметры: 
//  РезультатЗапросаПоТоварам - результат запроса по табличной части "Товары",
//  СтруктураШапкиДокумента   - выборка по результату запроса по шапке документа.
//
// Возвращаемое значение:
//  Сформированная таблица значений.
//
Функция ПодготовитьТаблицуТоваров(РезультатЗапросаПоТоварам, СтруктураШапкиДокумента)
	
	ТаблицаТоваров = РезультатЗапросаПоТоварам.Выгрузить();
	
	Возврат ТаблицаТоваров;
	
КонецФункции // ПодготовитьТаблицуТоваров()

// Проверяет правильность заполнения шапки документа.
// Если какой-то из реквизтов шапки, влияющий на проведение не заполнен или
// заполнен не корректно, то выставляется флаг отказа в проведении.
// Проверяется также правильность заполнения реквизитов ссылочных полей документа.
// Проверка выполняется по объекту и по выборке из результата запроса по шапке.
//
// Параметры: 
//  СтруктураШапкиДокумента - выборка из результата запроса по шапке документа,
//  Отказ                   - флаг отказа в проведении,
//  Заголовок               - строка, заголовок сообщения об ошибке проведения.
//
Процедура ПроверитьЗаполнениеШапки(СтруктураШапкиДокумента, Отказ, Заголовок)
	
	// Укажем, что надо проверить:
	СтруктураОбязательныхПолей = 
	Новый Структура("Организация, Склад");
	
	// Документ должен принадлежать хотя бы к одному виду учета (управленческий, бухгалтерский, налоговый)
	ОбщегоНазначения.ПроверитьПринадлежностьКВидамУчета(СтруктураШапкиДокумента, Отказ, Заголовок);
	
	// Вызовем общую процедуру для проверки проверки.
	ЗаполнениеДокументов.ПроверитьЗаполнениеШапкиДокумента(ЭтотОбъект, СтруктураОбязательныхПолей, Отказ, Заголовок);
	
	Если СтатусДокумента = Перечисления.СтатусыМаршрутногоЛиста.Завершен И ДатаПриезда = Дата(1, 1, 1) Тогда 
		Сообщить("Не указаны дата и время приезда автомобиля. Проведение невозможно.");
		Отказ = Истина;
	КонецЕсли;	
	
КонецПроцедуры // ПроверитьЗаполнениеШапки()

// Проверяет правильность заполнения строк табличной части "Товары".
//
// Параметры:
// Параметры: 
//  ТаблицаПоТоварам        - таблица значений, содержащая данные для проведения и проверки ТЧ Товары
//  СтруктураШапкиДокумента - выборка из результата запроса по шапке документа,
//  Отказ                   - флаг отказа в проведении.
//  Заголовок               - строка, заголовок сообщения об ошибке проведения.
//
Процедура ПроверитьЗаполнениеТабличнойЧасти(ТаблицаПоТоварам, СтруктураШапкиДокумента, Отказ, Заголовок, ИмяТабличнойЧасти)
	
	// Укажем, что надо проверить:
	СтруктураОбязательныхПолей = Новый Структура("Номенклатура, Количество");
	СтруктураОбязательныхПолей.Вставить("Качество");
	
	УправлениеЗапасами.КорректировкаСтруктурыОбязательныхПолей(ЭтотОбъект, ИмяТабличнойЧасти, СтруктураШапкиДокумента.ВидСклада, СтруктураОбязательныхПолей);
	
	// Вызовем общую процедуру для проверки проверки.
	ЗаполнениеДокументов.ПроверитьЗаполнениеТабличнойЧасти(ЭтотОбъект, "Продажи",СтруктураОбязательныхПолей, Отказ, Заголовок);
	
	// Здесь услуг быть не должно.
	УправлениеЗапасами.ПроверитьЧтоНетУслуг(ЭтотОбъект, "Продажи", ТаблицаПоТоварам, Отказ, Заголовок);
	
	// Здесь наборов-пакетов быть не должно.
	УправлениеЗапасами.ПроверитьЧтоНетНаборов(ЭтотОбъект, "Продажи", ТаблицаПоТоварам, Отказ, Заголовок);
	
	// Здесь наборов-комплектов быть не должно.
	УправлениеЗапасами.ПроверитьЧтоНетКомплектов(ЭтотОбъект, "Продажи", ТаблицаПоТоварам, Отказ, Заголовок);
	
КонецПроцедуры // ПроверитьЗаполнениеТабличнойЧастиТовары()

Функция  УдалитьСтрокиНеТребующиеСписаниеИзРезерва(ТабТовары)
	
	ТабРезерв = ТабТовары.Скопировать();
	
	// Удалим записи таблицы в которых не надо списывать из резерва или не указан заказ покупателя.
	Сч = 0;
	Пока Сч < ТабРезерв.Количество() Цикл
		СтрокаТаблицы = ТабРезерв.Получить(Сч);
		Если НЕ ЗначениеЗаполнено(СтрокаТаблицы.ДокументРезерва) 
			ИЛИ (ТипЗнч(СтрокаТаблицы.ДокументРезерва) <> Тип("ДокументСсылка.ЗаказПокупателя")
			И ТипЗнч(СтрокаТаблицы.ДокументРезерва) <> Тип("ДокументСсылка.ВнутреннийЗаказ")
			И ТипЗнч(СтрокаТаблицы.ДокументРезерва) <> Тип("ДокументСсылка.ПриходныйОрдерНаТовары"))Тогда
			ТабРезерв.Удалить(СтрокаТаблицы);
		Иначе
			Если ТипЗнч(СтрокаТаблицы.ДокументРезерва) = Тип("ДокументСсылка.ПриходныйОрдерНаТовары")
				И НЕ СтрокаТаблицы.ДокументРезерва.БезПраваПродажи Тогда
				ТабРезерв.Удалить(СтрокаТаблицы);
			Иначе	
				Сч = Сч + 1;
			КонецЕсли;
			
		КонецЕсли;
	КонецЦикла;
	
	Возврат ТабРезерв;
	
КонецФункции
// По результату запроса по шапке документа формируем движения по регистрам.
//
// Параметры: 
//  РежимПроведения           - режим проведения документа (оперативный или неоперативный),
//  СтруктураШапкиДокумента   - выборка из результата запроса по шапке документа,
//  ТаблицаПоТоварам          - таблица значений, содержащая данные для проведения и проверки ТЧ Товары
//  ТаблицаПоТаре             - таблица значений, содержащая данные для проведения и проверки ТЧ "Возвратная тара",
//  Отказ                     - флаг отказа в проведении,
//  Заголовок                 - строка, заголовок сообщения об ошибке проведения.
//
Процедура ДвиженияПоРегистрамСписание(РежимПроведения, СтруктураШапкиДокумента, ТаблицаПоТоварам, ТаблицаПоТаре, Отказ, Заголовок);
	
	Если СтатусДокумента = Перечисления.СтатусыМаршрутногоЛиста.Отправлен ИЛИ СтатусДокумента = Перечисления.СтатусыМаршрутногоЛиста.Завершен Тогда  
		ДвиженияПоРегистрамУпрСписание(РежимПроведения, СтруктураШапкиДокумента, ТаблицаПоТоварам, ТаблицаПоТаре, Отказ, Заголовок);
		ДвиженияПоТоварамОрганизацийСписание(РежимПроведения, СтруктураШапкиДокумента, ТаблицаПоТоварам, ТаблицаПоТаре, Отказ, Заголовок);
		
		// Проводить по партиям сразу нужно если установлен параметр
		// учетной политики СписыватьПартииПриПроведенииДокументов
		ПроводитьПоПартиям = РегистрыСведений.УчетнаяПолитика.ПолучитьПоследнее(Дата).СписыватьПартииПриПроведенииДокументов;
		
		Если ТаблицаПоТоварам.Количество() >0 Тогда
			
			// Зарегистрируем в последовательности УУ
			Если ОтражатьВУправленческомУчете Тогда
				ЗаписьРегистрации = ПринадлежностьПоследовательностям.ПартионныйУчет.Добавить();
				ЗаписьРегистрации.Период      = Дата;
			КонецЕсли;
		КонецЕсли;
		
		Если ПроводитьПоПартиям Тогда
			
			// ТОВАРЫ ПО РЕГИСТРУ ПартииТоваровНаСкладах.
			НаборДвижений = Движения.ПартииТоваровНаСкладах;
			
			// Получим таблицу значений, совпадающую со структурой набора записей регистра.
			ТаблицаДвиженийПартииТоваровНаСкладах = НаборДвижений.ВыгрузитьКолонки();
			ТаблицаДвижений = ТаблицаДвиженийПартииТоваровНаСкладах.Скопировать();
			
			// Заполним таблицу движений.
			ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(ТаблицаПоТоварам, ТаблицаДвижений);
			
			// Недостающие поля.
			Для Каждого СтрокаДвижений Из ТаблицаДвижений Цикл
				СтрокаДвижений.СтатусПартии = Перечисления.СтатусыПартийТоваров.Купленный;
				СтрокаДвижений.ДокументОприходования = Ссылка;		
			КонецЦикла;	
			
			ТаблицаДвижений.ЗаполнитьЗначения(Перечисления.КодыОперацийПартииТоваров.СписаниеПоИнвентаризации, "КодОперации");
			
			НаборДвижений.мПериод          = Дата;
			НаборДвижений.мТаблицаДвижений = ТаблицаДвижений;
			
			Если Не Отказ Тогда
				Движения.ПартииТоваровНаСкладах.ВыполнитьРасход();
			КонецЕсли;		
			
		Иначе
			
			// В неоперативном режиме границы последовательностей сдвигаются назад, если они позже документа.
			Если РежимПроведения = РежимПроведенияДокумента.Неоперативный Тогда
				УправлениеЗапасамиПартионныйУчет.СдвигГраницыПоследовательностиПартионногоУчетаНазад(Дата, Ссылка, Организация);
			КонецЕсли;
			
		КонецЕсли;
		// ТОВАРЫ ПО РЕГИСТРУ ТоварыВДороге приход.
		НаборДвижений = Движения.ТоварыВДороге;
		Если НЕ Отказ Тогда
			СтруктТаблицДокумента = Новый Структура;
			СтруктТаблицДокумента.Вставить("ТаблицаПоТоварам", ТаблицаПоТоварам);
			ТаблицыДанныхДокумента = ОбщегоНазначения.ЗагрузитьТаблицыДокументаВСтруктуру(НаборДвижений, СтруктТаблицДокумента);
			ОбщегоНазначения.УстановитьЗначениеВТаблицыДокумента(ТаблицыДанныхДокумента, "МаршрутныйЛист", Ссылка);
			ОбщегоНазначения.ЗаписатьТаблицыДокументаВРегистр(НаборДвижений, ВидДвиженияНакопления.Приход, ТаблицыДанныхДокумента, Дата);
		КонецЕсли;				
		// ТОВАРЫ ПО РЕГИСТРУ ТовариНаСкладахУВазі списание.
		СтруктТаблицДокумента = Новый Структура;
		ТЗТовары = ТаблицаПоТоварам.Скопировать();
		Для Каждого СтрТовар Из ТЗТовары Цикл 
			Если СтрТовар.ХарактеристикаНоменклатуры <> Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка() Тогда 
				СтрТовар.Количество = СтрТовар.Количество * СтрТовар.ХарактеристикаНоменклатуры.Вага; 
			КонецЕсли;	
		КонецЦикла;						
		СтруктТаблицДокумента.Вставить("ТоварыОпт", ТЗТовары);
		ТаблицыДанныхДокумента = ОбщегоНазначения.ЗагрузитьТаблицыДокументаВСтруктуру(Движения.ТовариНаСкладахУВазі, СтруктТаблицДокумента);
		ОбщегоНазначения.ЗаписатьТаблицыДокументаВРегистр(Движения.ТовариНаСкладахУВазі, ВидДвиженияНакопления.Расход, ТаблицыДанныхДокумента, Дата);							
	КонецЕсли;	
	
	Если СтатусДокумента = Перечисления.СтатусыМаршрутногоЛиста.Завершен Тогда  	
		// ТОВАРЫ ПО РЕГИСТРУ ТоварыВДороге списание.
		НаборДвижений = Движения.ТоварыВДороге;
		Если НЕ Отказ Тогда
			СтруктТаблицДокумента = Новый Структура;
			СтруктТаблицДокумента.Вставить("ТаблицаПоТоварам", ТаблицаПоТоварам);
			ТаблицыДанныхДокумента = ОбщегоНазначения.ЗагрузитьТаблицыДокументаВСтруктуру(НаборДвижений, СтруктТаблицДокумента);
			ОбщегоНазначения.УстановитьЗначениеВТаблицыДокумента(ТаблицыДанныхДокумента, "МаршрутныйЛист", Ссылка);
			ОбщегоНазначения.ЗаписатьТаблицыДокументаВРегистр(НаборДвижений, ВидДвиженияНакопления.Расход, ТаблицыДанныхДокумента, ДатаПриезда);
		КонецЕсли;		
	КонецЕсли;
	
КонецПроцедуры // ДвиженияПоРегистрам()

Процедура ДвиженияПоРегистрамУпрСписание(РежимПроведения, СтруктураШапкиДокумента, ТаблицаПоТоварам, ТаблицаПоТаре, Отказ, Заголовок)
	
	// Движения по документу.
	
	Если ОтражатьВУправленческомУчете Тогда
		
		// ТОВАРЫ ПО РЕГИСТРУ ТоварыНаСкладах.
		НаборДвижений = Движения.ТоварыНаСкладах;
		
		// Проверка остатков при оперативном проведении.
		Если РежимПроведения = РежимПроведенияДокумента.Оперативный Тогда
			НаборДвижений.КонтрольОстатков(ЭтотОбъект, "Товары",         СтруктураШапкиДокумента, Отказ, Заголовок);
		КонецЕсли;
		
		Если НЕ Отказ Тогда
			
			СтруктТаблицДокумента = Новый Структура;
			СтруктТаблицДокумента.Вставить("ТаблицаПоТоварам", ТаблицаПоТоварам);
			
			ТаблицыДанныхДокумента = ОбщегоНазначения.ЗагрузитьТаблицыДокументаВСтруктуру(НаборДвижений, СтруктТаблицДокумента);
			
			ОбщегоНазначения.УстановитьЗначениеВТаблицыДокумента(ТаблицыДанныхДокумента, "Склад", Склад);
			
			ОбщегоНазначения.ЗаписатьТаблицыДокументаВРегистр(НаборДвижений, ВидДвиженияНакопления.Расход, ТаблицыДанныхДокумента, Дата);
			
		КонецЕсли;
		
	КонецЕсли;
	
	// Списание резерва
	ТабРезервТовары = УдалитьСтрокиНеТребующиеСписаниеИзРезерва(ТаблицаПоТоварам);	
	
	Если ТабРезервТовары.Количество() > 0 Тогда
		
		// Проверка остатков при оперативном проведении.
		Если РежимПроведения = РежимПроведенияДокумента.Оперативный Тогда
			Движения.ТоварыВРезервеНаСкладах.КонтрольОстатков(ЭтотОбъект, "Товары",         СтруктураШапкиДокумента, Отказ, Заголовок);
		КонецЕсли;
		
		Если НЕ Отказ Тогда
			
			СтруктТаблицДокумента = Новый Структура;
			СтруктТаблицДокумента.Вставить("ТаблицаПоТоварам", ТабРезервТовары);
			
			ТаблицыДанныхДокумента = ОбщегоНазначения.ЗагрузитьТаблицыДокументаВСтруктуру(Движения.ТоварыВРезервеНаСкладах, СтруктТаблицДокумента);
			ОбщегоНазначения.УстановитьЗначениеВТаблицыДокумента(ТаблицыДанныхДокумента, "Склад", Склад);
			
			ОбщегоНазначения.ЗаписатьТаблицыДокументаВРегистр(Движения.ТоварыВРезервеНаСкладах, ВидДвиженияНакопления.Расход, ТаблицыДанныхДокумента, Дата);
			
		КонецЕсли;
		
	КонецЕсли;		
	
КонецПроцедуры

Процедура ДвиженияПоТоварамОрганизацийСписание(РежимПроведения, СтруктураШапкиДокумента, ТаблицаПоТоварам, ТаблицаПоТаре, Отказ, Заголовок)
	
	Если НЕ СтруктураШапкиДокумента.ОтражатьВРегламентированномУчете 
		Или Отказ Тогда
		Возврат;
	КонецЕсли;
	
	// ТОВАРЫ ПО РЕГИСТРУ ТоварыОрганизаций.
	
	НаборДвижений = Движения.ТоварыОрганизаций;
	
	// Получим таблицу значений, совпадающую со структурой набора записей регистра.
	ТаблицаДвижений = НаборДвижений.ВыгрузитьКолонки();
	
	// Заполним таблицу движений.
	ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(ТаблицаПоТоварам, ТаблицаДвижений);
	
	// Недостающие поля.
	ТаблицаДвижений.ЗаполнитьЗначения(Организация, "Организация");
	ТаблицаДвижений.ЗаполнитьЗначения(Неопределено,"Комиссионер");
	
	Если Не СтруктураШапкиДокумента.ВестиУчетТоваровОрганизацийВРазрезеСкладов Тогда
		ТаблицаДвижений.ЗаполнитьЗначения(Неопределено, "Склад");
	КонецЕсли;
	
	НаборДвижений.мПериод          = Дата;
	НаборДвижений.мТаблицаДвижений = ТаблицаДвижений;
	
	// Проверка остатков при оперативном проведении.
	Если РежимПроведения = РежимПроведенияДокумента.Оперативный Тогда
		НаборДвижений.КонтрольОстатков(ЭтотОбъект, "Товары", СтруктураШапкиДокумента, Отказ, Заголовок);
	КонецЕсли;
	
	Если Не Отказ Тогда
		Движения.ТоварыОрганизаций.ВыполнитьРасход();
	КонецЕсли;
	
КонецПроцедуры

// Проводит табличные части "Товары" по регистрам
//
// Параметры:
//  ТаблицаПоТоварам          - таблица значений, содержащая данные для проведения и проверки ТЧ Товары
//  ТаблицаПоТаре             - таблица значений, содержащая данные для проведения и проверки ТЧ "Возвратная тара",
//  Отказ                     - флаг отказа в проведении,
//  Заголовок                 - строка, заголовок сообщения об ошибке проведения.
//
Процедура ДвиженияПоРегистрамОприходование(РежимПроведения, СтруктураШапкиДокумента, ТаблицаПоТоварам, Отказ, Заголовок)
	
	Если (СтатусДокумента = Перечисления.СтатусыМаршрутногоЛиста.Отправлен) ИЛИ  (СтатусДокумента = Перечисления.СтатусыМаршрутногоЛиста.Завершен) Тогда 
		ДвиженияПоРегиструТоварыОрганизацийОприходование(РежимПроведения, СтруктураШапкиДокумента, ТаблицаПоТоварам, Отказ, Заголовок);
		ДвиженияПоРегистрамУпрОприходование(РежимПроведения, СтруктураШапкиДокумента, ТаблицаПоТоварам, Отказ, Заголовок);
	КонецЕсли;
	
КонецПроцедуры // ТоварыИТараПоРегистрамОстатковИПартий()

Процедура ДвиженияПоРегистрамУпрОприходование(РежимПроведения, СтруктураШапкиДокумента, ТаблицаПоТоварам, Отказ, Заголовок)
	
	Если ОтражатьВУправленческомУчете Тогда
		
		// ТОВАРЫ ПО РЕГИСТРУ ТоварыНаСкладах.
		Если СтруктураШапкиДокумента.ВидСклада = Перечисления.ВидыСкладов.НТТ Тогда
			НаборДвижений = Движения.ТоварыВНТТ;
		ИначеЕсли СтруктураШапкиДокумента.ВидСклада = Перечисления.ВидыСкладов.Розничный Тогда
			НаборДвижений = Движения.ТоварыВРознице;
		Иначе
			НаборДвижений = Движения.ТоварыНаСкладах;
		КонецЕсли;
		
		// Получим таблицу значений, совпадающую со структурой набора записей регистра.
		ТаблицаДвижений = НаборДвижений.ВыгрузитьКолонки();
		
		// Заполним таблицу движений.
		ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(ТаблицаПоТоварам, ТаблицаДвижений);
		
		// Недостающие поля.
		ТаблицаДвижений.ЗаполнитьЗначения(Склад, "Склад");
		НаборДвижений.мПериод          = ?(СтатусДокумента = Перечисления.СтатусыМаршрутногоЛиста.Завершен, Дата + 1, Дата);
		НаборДвижений.мТаблицаДвижений = ТаблицаДвижений;
		
		Если Не Отказ Тогда
			НаборДвижений.ВыполнитьПриход();
		КонецЕсли;
		
		// ТОВАРЫ ПО РЕГИСТРУ ПартииТоваровНаСкладах.
		НаборДвижений = Движения.ПартииТоваровНаСкладах;
		
		// Получим таблицу значений, совпадающую со структурой набора записей регистра.
		ТаблицаДвиженийПартииТоваровНаСкладах = НаборДвижений.ВыгрузитьКолонки();
		ТаблицаДвижений = ТаблицаДвиженийПартииТоваровНаСкладах.Скопировать();
		
		// Заполним таблицу движений.
		ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(ТаблицаПоТоварам, ТаблицаДвижений);
		
		// Недостающие поля.
		ЗаполнитьПоляПартииТоваровНаСкладах(ТаблицаПоТоварам, ТаблицаДвижений, СтруктураШапкиДокумента);
		
		ТаблицаДвижений.ЗаполнитьЗначения(Перечисления.КодыОперацийПартииТоваров.Оприходование, "КодОперации");
		
		НаборДвижений.мПериод          = ?(СтатусДокумента = Перечисления.СтатусыМаршрутногоЛиста.Завершен, Дата + 1, Дата);
		НаборДвижений.мТаблицаДвижений = ТаблицаДвижений;
		
		Если Не Отказ Тогда
			Движения.ПартииТоваровНаСкладах.ВыполнитьПриход();
		КонецЕсли;
		
		// ТовариНаСкладахУВазі
		Для Каждого СтрТовар Из ТаблицаПоТоварам Цикл 
			Если СтрТовар.ХарактеристикаНоменклатуры <> Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка() Тогда 
				СтрТовар.Количество = СтрТовар.Количество * СтрТовар.ХарактеристикаНоменклатуры.Вага; 
			КонецЕсли;	
		КонецЦикла;	
		СтруктТаблицДокументаОпт 	= Новый Структура;
		СтруктТаблицДокументаОпт.Вставить("ТаблицаПоТоварам",      ТаблицаПоТоварам);
		ТаблицыДанныхДокументаОпт   = ОбщегоНазначения.ЗагрузитьТаблицыДокументаВСтруктуру(Движения.ТовариНаСкладахУВазі, СтруктТаблицДокументаОпт);
		ОбщегоНазначения.ЗаписатьТаблицыДокументаВРегистр(Движения.ТовариНаСкладахУВазі, ВидДвиженияНакопления.Приход, ТаблицыДанныхДокументаОпт,     Дата);		
	КонецЕсли; // Если ОтражатьВУправленческомУчете ...
	
КонецПроцедуры

Процедура ДвиженияПоРегиструВозвраты(РежимПроведения, СтруктураШапкиДокумента, ТаблицаПоВозвратам, Отказ, Заголовок)
	
	Если ОтражатьВУправленческомУчете Тогда
		Если (СтатусДокумента = Перечисления.СтатусыМаршрутногоЛиста.Отправлен) ИЛИ (СтатусДокумента = Перечисления.СтатусыМаршрутногоЛиста.Завершен) Тогда  	
			НаборДвижений = Движения.Возвраты;
			Если НЕ Отказ Тогда
				МассивПроданныхТоваров = Новый Массив;
				Для Каждого СтрТовар Из ТаблицаПоВозвратам Цикл 
					Если НЕ СтрТовар.Возврат Тогда 
						МассивПроданныхТоваров.Добавить(СтрТовар);
					КонецЕсли;	
				КонецЦикла;	
				Для Каждого ЭлементМассива Из МассивПроданныхТоваров Цикл 
					ТаблицаПоВозвратам.Удалить(ЭлементМассива);
				КонецЦикла;	
				СтруктТаблицДокумента = Новый Структура;
				СтруктТаблицДокумента.Вставить("ТаблицаПоТоварам", ТаблицаПоВозвратам);
				ТаблицыДанныхДокумента = ОбщегоНазначения.ЗагрузитьТаблицыДокументаВСтруктуру(НаборДвижений, СтруктТаблицДокумента);
				ОбщегоНазначения.ЗаписатьТаблицыДокументаВРегистр(НаборДвижений, , ТаблицыДанныхДокумента, ?(СтатусДокумента = Перечисления.СтатусыМаршрутногоЛиста.Завершен, Дата + 1, Дата));
			КонецЕсли;		
		КонецЕсли;		
	КонецЕсли; 
	
КонецПроцедуры

Процедура ДвиженияПоРегиструТоварыОрганизацийОприходование(РежимПроведения, СтруктураШапкиДокумента, ТаблицаПоТоварам, Отказ, Заголовок)
	
	Если НЕ СтруктураШапкиДокумента.ОтражатьВРегламентированномУчете 
		Или Отказ Тогда
		Возврат;
	КонецЕсли;
	
	// ТОВАРЫ ПО РЕГИСТРУ ТоварыОрганизаций.
	
	НаборДвижений = Движения.ТоварыОрганизаций;
	
	// Получим таблицу значений, совпадающую со структурой набора записей регистра.
	ТаблицаДвижений = НаборДвижений.ВыгрузитьКолонки();
	
	// Заполним таблицу движений.
	ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(ТаблицаПоТоварам, ТаблицаДвижений);
	
	// Недостающие поля.
	ТаблицаДвижений.ЗаполнитьЗначения(Организация, "Организация");
	ТаблицаДвижений.ЗаполнитьЗначения(Неопределено,"Комиссионер");
	
	Если Не СтруктураШапкиДокумента.ВестиУчетТоваровОрганизацийВРазрезеСкладов Тогда
		ТаблицаДвижений.ЗаполнитьЗначения(Неопределено, "Склад");
	КонецЕсли;
	
	НаборДвижений.мПериод            = ?(СтатусДокумента = Перечисления.СтатусыМаршрутногоЛиста.Завершен, Дата + 1, Дата);
	НаборДвижений.мТаблицаДвижений   = ТаблицаДвижений;
	
	Если Не Отказ Тогда
		Движения.ТоварыОрганизаций.ВыполнитьПриход();
	КонецЕсли;
	
КонецПроцедуры

// Заполняет в таблице движений по регитстру ПартииТоваровНаСкладах нестандартные поля.
//
// Параметры:
//  ТаблицаТЧ       - таблица значений, соответствующая табличной части документа
//  ТаблицаДвижений - таблица значений, соответствующая набору записей регистра,
//
Процедура ЗаполнитьПоляПартииТоваровНаСкладах(ТаблицаТЧ, ТаблицаДвижений,СтруктураШапкиДокумента)
	
	ТаблицаТЧ.Индексы.Добавить("НомерСтроки");
	
	Для каждого СтрокаДвижений Из ТаблицаДвижений Цикл
		
		// Партионный учет по складам
		Если НЕ СтруктураШапкиДокумента.ВестиПартионныйУчетПоСкладам = Истина Тогда
			СтрокаДвижений.Склад       = Неопределено;
		КонецЕсли;
		СтрокаДвижений.СтатусПартии = Перечисления.СтатусыПартийТоваров.Купленный;
		Если Не мПорядокСписанияПартий.Упр = Перечисления.СпособыОценки.ПоСредней Тогда
			СтрокаДвижений.ДокументОприходования = Ссылка;
		КонецЕсли;
		
		// Если партионный учет по сериям не ведется, то надо очистить серию		
		СтрокаТЧ = ТаблицаТЧ.Найти(СтрокаДвижений.НомерСтроки, "НомерСтроки");
		Если (СтрокаТЧ.ВестиПартионныйУчетПоСериям = NULL) ИЛИ (НЕ СтрокаТЧ.ВестиПартионныйУчетПоСериям) Тогда
			СтрокаДвижений.СерияНоменклатуры = Неопределено;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры // ЗаполнитьПоляПартииТоваровНаСкладах()

// Перезаполняет таблицу курсов валют
Процедура ПерезаполнитьКурсыВалют() Экспорт
	
	з = Новый Запрос;
	з.Текст = "ВЫБРАТЬ
	|	КурсыВалютСрезПоследних.Валюта,
	|	КурсыВалютСрезПоследних.Курс / КурсыВалютСрезПоследних.Кратность КАК Курс
	|ИЗ
	|	РегистрСведений.КурсыВалют.СрезПоследних(&ДатаКурса, ) КАК КурсыВалютСрезПоследних";
	ДатаСрезаКурса = Дата;
	Если НЕ ЗначениеЗаполнено(ДатаСрезаКурса) Тогда 
		ДатаСрезаКурса = ТекущаяДата();
	КонецЕсли;
	
	з.УстановитьПараметр("ДатаКурса", ДатаСрезаКурса);
	КурсыВалют.Загрузить(з.Выполнить().Выгрузить());
	
КонецПроцедуры

Функция ПолучитьКурсВалютыДокумента(Валюта) Экспорт
	
	СтрокаВалюты = КурсыВалют.Найти(Валюта, "Валюта");
	Если СтрокаВалюты = Неопределено Тогда 
		#Если Клиент Тогда
			Предупреждение("Не заполнена валюта: "+Валюта);
		#КонецЕсли
		з = Новый Запрос;
		з.Текст = "ВЫБРАТЬ
		|	КурсыВалютСрезПоследних.Курс
		|ИЗ
		|	РегистрСведений.КурсыВалют.СрезПоследних(&ДатаКурса, ) КАК КурсыВалютСрезПоследних
		|ГДЕ
		|	КурсыВалютСрезПоследних.Валюта = &Валюта";
		з.УстановитьПараметр("ДатаКурса", ?(ЗначениеЗаполнено(Дата), Дата, ТекущаяДата()));
		з.УстановитьПараметр("Валюта", Валюта);
		Выборка = з.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда 
			Возврат Выборка.Курс;
		КонецЕсли;
		
		Возврат 0;
	КонецЕсли;
	
	Возврат СтрокаВалюты.Курс;	
	
КонецФункции

Функция ПолучитьКурсВалютыРасчета(Контрагент, Валюта) Экспорт
	
	КурсРасчета = Новый Структура;
	КурсРасчета.Вставить("КурсВал", 0);
	КурсРасчета.Вставить("КурсУпр", 0);
	
	Для Каждого СтрОплата Из Оплата Цикл 
		Если СтрОплата.Контрагент = Контрагент И СтрОплата.Валюта = Валюта Тогда 
			КурсРасчета.КурсВал = СтрОплата.КурсВал;
			КурсРасчета.КурсУпр = СтрОплата.КурсУпр;
			Прервать;
		КонецЕсли;	
	КонецЦикла;	
	
	Если КурсРасчета.КурсВал = 0 Тогда 
		КурсРасчета.КурсВал = ПолучитьКурсВалютыДокумента(Валюта);
	КонецЕсли;	
	
	Если КурсРасчета.КурсУпр = 0 Тогда 
		КурсРасчета.КурсУпр = ПолучитьКурсВалютыДокумента(мВалютаУправленческогоУчета);
	КонецЕсли;	
	
	
	Возврат КурсРасчета;	
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	мУдалятьДвижения = НЕ ЭтоНовый();
	
	Если ОбменДанными.Загрузка  Тогда
		Возврат;
	КонецЕсли;
	
	// Посчитать суммы документа и записать ее в соответствующий реквизит шапки для показа в журналах
	СуммаДокумента = ТоварыЗаказов.Итог("Сумма");
	Если НЕ КурсыВалют.Количество()	Тогда      // в случае перепроведения старых документов
		ПерезаполнитьКурсыВалют();
	КонецЕсли;
	ПоверкаДублейТаблицыЗаказов();
	ОтменаПроведенияСвязанныхДокументов();
	КонтрольЗагрузкиИРеализаций();
	КонтрольЦенВРеализациях();
	Если Ссылка.СтатусДокумента = Перечисления.СтатусыМаршрутногоЛиста.Завершен Тогда 
		Архивный = Истина;
	КонецЕсли;
	
	ДополнительныеСвойства.Вставить("ЗакрытьЗаказы", СтатусДокумента = Перечисления.СтатусыМаршрутногоЛиста.Отправлен Или  СтатусДокумента = Перечисления.СтатусыМаршрутногоЛиста.Завершен);
	Если Ссылка.СтатусДокумента =  Перечисления.СтатусыМаршрутногоЛиста.Составляется
		И СтатусДокумента = Перечисления.СтатусыМаршрутногоЛиста.Отправлен Тогда 
		ДополнительныеСвойства.Вставить("ОтменитьБронь", Истина);
		//СкасованаБронь = Истина;
	КонецЕсли;

КонецПроцедуры

Процедура ПоверкаДублейТаблицыЗаказов()
	Заказы.Свернуть("ЗаказПокупателя, Контрагент, Отгружен, Количество, КоличествоЗагружено, КоличествоОстаток, КоличествоФакт"); 
КонецПроцедуры


Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	// Дерево значений, содержащее имена необходимых полей в запросе по шапке.
	Перем ДеревоПолейЗапросаПоШапке;	
	
	Если СтатусДокумента = Перечисления.СтатусыМаршрутногоЛиста.Составляется Тогда 
		ОбщегоНазначения.УдалитьДвиженияРегистратора(ЭтотОбъект, Отказ);
		Возврат;
	КонецЕсли;	
	
	// ПРОВЕРКА ОПЛАТЫ
	#Если Клиент Тогда
		КонтрагентыЗаказы = Заказы.Выгрузить();
		КонтрагентыЗаказы.Свернуть("Контрагент");
		КонтрагентыОплаты = Оплата.Выгрузить();
		КонтрагентыОплаты.Свернуть("Контрагент");
		МассивНеОплатили = Новый Массив;
		Для Каждого СтрКонтрагент Из КонтрагентыЗаказы Цикл 
			СтрокаОплаты = КонтрагентыОплаты.Найти(СтрКонтрагент.Контрагент, "Контрагент");
			Если СтрокаОплаты = Неопределено Тогда 
				МассивНеОплатили.Добавить(СтрКонтрагент);
			КонецЕсли;	
		КонецЦикла;
		ТекстСообщения = "";
		Если МассивНеОплатили.Количество() > 0 Тогда 
			ТекстСообщения = ТекстСообщения + "Нет оплаты: ";
			Для Каждого НеОпратил Из МассивНеОплатили Цикл 
				ТекстСообщения = ТекстСообщения + НеОпратил.Контрагент + ", ";
			КонецЦикла;
			Предупреждение(ТекстСообщения,10);
		КонецЕсли;
	#КонецЕсли	
	
	// ПРОВЕДЕНИЕ СПИСАНИЯ
	Если мУдалятьДвижения Тогда
		ОбщегоНазначения.УдалитьДвиженияРегистратора(ЭтотОбъект, Отказ);
	КонецЕсли;
	
	СтруктураШапкиДокумента = ОбщегоНазначения.СформироватьСтруктуруШапкиДокумента(ЭтотОбъект);
	
	// Заполним по шапке документа дерево параметров, нужных при проведении.
	ДеревоПолейЗапросаПоШапке = ОбщегоНазначения.СформироватьДеревоПолейЗапросаПоШапке();
	ОбщегоНазначения.ДобавитьСтрокуВДеревоПолейЗапросаПоШапке(ДеревоПолейЗапросаПоШапке, "Константы",        "ВалютаУправленческогоУчета",                 "ВалютаУправленческогоУчета");
	ОбщегоНазначения.ДобавитьСтрокуВДеревоПолейЗапросаПоШапке(ДеревоПолейЗапросаПоШапке, "Константы",        "КурсВалютыУправленческогоУчета",             "КурсВалютыУправленческогоУчета");
	ОбщегоНазначения.ДобавитьСтрокуВДеревоПолейЗапросаПоШапке(ДеревоПолейЗапросаПоШапке, "УчетнаяПолитика" , "ВестиПартионныйУчетПоСкладам",               "ВестиПартионныйУчетПоСкладам");
	ОбщегоНазначения.ДобавитьСтрокуВДеревоПолейЗапросаПоШапке(ДеревоПолейЗапросаПоШапке, "Склад",            "ВидСклада",                                  "ВидСклада");
	ОбщегоНазначения.ДобавитьСтрокуВДеревоПолейЗапросаПоШапке(ДеревоПолейЗапросаПоШапке, "Организации",      "ОтражатьВРегламентированномУчете" ,          "ОтражатьВРегламентированномУчете");
	ОбщегоНазначения.ДобавитьСтрокуВДеревоПолейЗапросаПоШапке(ДеревоПолейЗапросаПоШапке, "УчетнаяПолитика",  "ВестиУчетТоваровОрганизацийВРазрезеСкладов", "ВестиУчетТоваровОрганизацийВРазрезеСкладов");
	
	// Сформируем запрос на дополнительные параметры, нужные при проведении, по данным шапки документа
	СтруктураШапкиДокумента = УправлениеЗапасами.СформироватьЗапросПоДеревуПолей(ЭтотОбъект, ДеревоПолейЗапросаПоШапке, СтруктураШапкиДокумента, мВалютаРегламентированногоУчета);
	
	// Перезаполним курсы
	СтруктураШапкиДокумента.КурсВалютыУправленческогоУчета = ПолучитьКурсВалютыДокумента(СтруктураШапкиДокумента.ВалютаУправленческогоУчета);
	
	// Заголовок для сообщений об ошибках проведения.
	Заголовок = ОбщегоНазначения.ПредставлениеДокументаПриПроведении(СтруктураШапкиДокумента);
	
	// Проверим правильность заполнения шапки документа
	ПроверитьЗаполнениеШапки(СтруктураШапкиДокумента, Отказ, Заголовок);
	
	// Получим необходимые данные для проведения и проверки заполнения данных по табличной части "Товары".
	СтруктураПолей = Новый Структура();
	СтруктураПолей.Вставить("Номенклатура"              	, "Номенклатура");
	СтруктураПолей.Вставить("Услуга"                    	, "Номенклатура.Услуга");
	СтруктураПолей.Вставить("Набор"                     	, "Номенклатура.Набор");
	СтруктураПолей.Вставить("Комплект"                  	, "Номенклатура.Комплект");
	СтруктураПолей.Вставить("Количество"                	, "Количество");
	СтруктураПолей.Вставить("Цена"                      	, "Цена");
	СтруктураПолей.Вставить("Сумма"                     	, "Сумма");
	СтруктураПолей.Вставить("Качество"                  	, "Качество");
	СтруктураПолей.Вставить("ХарактеристикаНоменклатуры"	, "ХарактеристикаНоменклатуры");
	СтруктураПолей.Вставить("СерияНоменклатуры"         	, "СерияНоменклатуры");
	СтруктураПолей.Вставить("ВестиПартионныйУчетПоСериям"	, "Номенклатура.ВестиПартионныйУчетПоСериям");
	СтруктураПолей.Вставить("ДокументРезерва"           	, "ДокументРезерва");
	СтруктураПолей.Вставить("Склад"                     	, "Ссылка.Склад");
	СтруктураПолей.Вставить("МаршрутныйЛист"            	, "Ссылка");
	СтруктураПолей.Вставить("ЗаказПокупателя"            	, "ЗаказПокупателя");
	СтруктураПолей.Вставить("Контрагент"            		, "Контрагент");
	СтруктураПолей.Вставить("Возврат"		            	, "Возврат");
	
	РезультатЗапросаПоТоварам 	= ОбщегоНазначения.СформироватьЗапросПоТабличнойЧасти(ЭтотОбъект, "ЗагрузкаМашины", СтруктураПолей);
	ТаблицаПоТоварам 			= ПодготовитьТаблицуТоваров(РезультатЗапросаПоТоварам, СтруктураШапкиДокумента);
	РезультатЗапросаПоПродажам 	= ОбщегоНазначения.СформироватьЗапросПоТабличнойЧасти(ЭтотОбъект, "Продажи", СтруктураПолей);
	ПроверитьЗаполнениеТабличнойЧасти(ТаблицаПоТоварам, СтруктураШапкиДокумента, Отказ, Заголовок, "ЗагрузкаМашины");
	// для возврата на склад товара из ТЧ Продажи, которых уже нет в ТЧ ЗагрузкаМашины
	ТаблицаПоПродажам 			= ПодготовитьТаблицуТоваров(РезультатЗапросаПоПродажам, СтруктураШапкиДокумента);
	Для Каждого СтрПродажи Из ТаблицаПоПродажам Цикл 
		НоваяСтрока = ТаблицаПоТоварам.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрПродажи);
	КонецЦикла;	
	// -		
	
	// Движения по документу - списание со склада в дорогу загруженного товара
	Если Не Отказ Тогда
		ДвиженияПоРегистрамСписание(РежимПроведения, СтруктураШапкиДокумента, ТаблицаПоТоварам, , Отказ, Заголовок);
	КонецЕсли;
	
	// ПРОВЕДЕНИЕ ОПРИХОДОВАНИЯ
	мУчетнаяПолитика   				= ОбщегоНазначения.ПолучитьПараметрыУчетнойПолитики(КонецМесяца(Дата), Отказ);
	ТабУчетнаяПолитика 				= УправлениеЗапасамиПартионныйУчет.ПолучитьУчетнуюПолитику(Дата);
	мТекущаяСхемаНалогообложения 	= НалоговыйУчет.ПолучитьСхемуНалогообложения(Дата, Организация);
	мПорядокСписанияПартий 			= Новый Структура("Упр,Бух,Нал");
	
	Если ОтражатьВУправленческомУчете Тогда
		СтрокаУчетнойПолитики = ТабУчетнаяПолитика[0];
		мПорядокСписанияПартий.Вставить("Упр", СтрокаУчетнойПолитики.СпособОценкиМПЗУпр);
	КонецЕсли;
	
	// для возврата на склад товара из ТЧ ЗагрузкаМашины у которых Возврат
	Если СтатусДокумента = Перечисления.СтатусыМаршрутногоЛиста.Отправлен Тогда 
		ТаблицаПоВозвратам 	= ТаблицаПоТоварам.Скопировать();
		МассивСтрок 		= Новый Массив;
		Для Каждого СтрВозврата Из ТаблицаПоВозвратам Цикл 
			Если (НЕ СтрВозврата.Возврат) Тогда 
				МассивСтрок.Добавить(СтрВозврата);
			КонецЕсли; 	
		КонецЦикла;	
		Для Каждого ЭлементМассива Из МассивСтрок Цикл 
			ТаблицаПоВозвратам.Удалить(ЭлементМассива);
		КонецЦикла;	
	КонецЕсли;
	// -				
	
	// Движения по документу - оприходование на склад с дороги загруженного товара
	Если Не Отказ Тогда
		ДвиженияПоРегистрамОприходование(РежимПроведения, СтруктураШапкиДокумента, ?(СтатусДокумента = Перечисления.СтатусыМаршрутногоЛиста.Отправлен, ТаблицаПоВозвратам, ТаблицаПоТоварам), Отказ, Заголовок);
	КонецЕсли;		
	
	// ПРОВЕДЕНИЕ ВОЗВРАТОВ
	Если Не Отказ Тогда
		СтруктураПолей.Вставить("ЗаказПокупателя"            	, "ЗаказПокупателя");
		СтруктураПолей.Вставить("Контрагент"            		, "Контрагент");
		СтруктураПолей.Вставить("Возврат"		            	, "Возврат");		
		РезультатЗапросаПоВозвратам = ОбщегоНазначения.СформироватьЗапросПоТабличнойЧасти(ЭтотОбъект, "ЗагрузкаМашины", СтруктураПолей);
		ТаблицаПоВозвратам 			= ПодготовитьТаблицуТоваров(РезультатЗапросаПоВозвратам, СтруктураШапкиДокумента);
		ПроверитьЗаполнениеТабличнойЧасти(ТаблицаПоВозвратам, СтруктураШапкиДокумента, Отказ, Заголовок, "ЗагрузкаМашины");		
		ДвиженияПоРегиструВозвраты(РежимПроведения, СтруктураШапкиДокумента, ТаблицаПоВозвратам, Отказ, Заголовок);
	КонецЕсли;			
	
	//ДенедныеСредства, ДвиженияДенежныхСредств
	
	НаборЗаписей = РегистрыНакопления.ДенежныеСредства.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Регистратор.Установить(ЭтотОбъект.Ссылка);
	Грн = Справочники.Валюты.НайтиПоКоду("980");
	Упр = Константы.ВалютаУправленческогоУчета.Получить();
	ГрнКурс = КурсыВалют.Найти(Грн).Курс;
	УпрКурс = КурсыВалют.Найти(Упр).Курс;
	Для Каждого Строка Из Витрати Цикл
		Запись = НаборЗаписей.ДобавитьРасход();
		Запись.Регистратор = ЭтотОбъект.Ссылка;
		Запись.Период = Дата;
		Запись.ВидДенежныхСредств = Перечисления.ВидыДенежныхСредств.Наличные;
		Запись.БанковскийСчетКасса = Справочники.Кассы.НайтиПоКоду("000000001");
		Запись.Организация = Организация;
		Запись.Сумма = Строка.Сума;
		Запись.СуммаУпр = МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(Строка.Сума, Грн, Упр, ГрнКурс, УпрКурс, 1, 1);
	КонецЦикла;
	НаборЗаписей.Записать();  	
	
	НаборЗаписей = РегистрыНакопления.ДвиженияДенежныхСредств.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Регистратор.Установить(ЭтотОбъект.Ссылка);
	Для Каждого Строка Из Витрати Цикл 
		Запись = НаборЗаписей.Добавить();
		Запись.Регистратор = ЭтотОбъект.Ссылка;
		Запись.Период = Дата;
		Запись.СтатьяДвиженияДенежныхСредств =  Строка.СтаттяВитрат;
		Запись.БанковскийСчетКасса = Справочники.Кассы.НайтиПоКоду("000000001");
		Запись.ПриходРасход = Перечисления.ВидыДвиженийПриходРасход.Расход;
		Запись.Организация = Организация;
		Запись.ДокументДвижения = ЭтотОбъект.Ссылка;
		Запись.ВидДенежныхСредств = Перечисления.ВидыДенежныхСредств.Наличные;
		Запись.Сумма = Строка.Сума;
		Запись.СуммаУпр = МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(Строка.Сума, Грн, Упр, ГрнКурс, УпрКурс, 1, 1);
	КонецЦикла;
	НаборЗаписей.Записать();
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	ОбщегоНазначения.УдалитьДвиженияРегистратора(ЭтотОбъект, Отказ);
	
	ОтменаПроведенияСвязанныхДокументов();
	
КонецПроцедуры

Процедура ОтменаПроведенияСвязанныхДокументов()
	
	Таблица = ПолныеПрава.ПолучитьСписокДокументовПоКритериюОтбора("СвязанныеДокументы", Ссылка);
	Для Каждого СтрДок Из Таблица Цикл    // Якщо документ новий (не записаний) То Таблиця містить чомусь дуже багато документів
		//ДокОбъект = СтрДок.Ссылка.ПолучитьОбъект();
		//ДокОбъект.Записать(РежимЗаписиДокумента.ОтменаПроведения);
	КонецЦикла;	
	
КонецПроцедуры	

#Если Клиент Тогда
	Функция ПечатьМаршрутногоЛиста(НазваниеМакета)
		
		ТабДокумент 					= Новый ТабличныйДокумент;
		ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_МаршрутныйЛист";	
		ТабДокумент.ОриентацияСтраницы 	= ОриентацияСтраницы.Портрет;
		ТабДокумент.РазмерСтраницы 		= "A4";
		ТабДокумент.АвтоМасштаб 		= Истина;
		
		// Шапка
		Запрос = Новый Запрос();
		Запрос.УстановитьПараметр("ТекущийДокумент", ЭтотОбъект.Ссылка);
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	МаршрутныйЛист.Номер КАК НомерДокумента,
		|	МаршрутныйЛист.Дата КАК ДатаДокумента,
		|	МаршрутныйЛист.Организация КАК Организация,
		|	МаршрутныйЛист.Автомобиль КАК Автомобиль,
		|	МаршрутныйЛист.Склад КАК Склад,
		|	МаршрутныйЛист.Комментарий,
		|	ЕСТЬNULL(Штрихкоды.Штрихкод, """") КАК Штрихкод,
		|	ЕСТЬNULL(Штрихкоды.ТипШтрихкода, ЗНАЧЕНИЕ(ПланВидовХарактеристик.ТипыШтрихкодов.ПустаяСсылка)) КАК ТипШтрихкода,
		|	ЕСТЬNULL(Штрихкоды.ПредставлениеШтрихкода, """") КАК ПредставлениеШтрихкода
		|ИЗ
		|	Документ.МаршрутныйЛист КАК МаршрутныйЛист
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Штрихкоды КАК Штрихкоды
		|		ПО МаршрутныйЛист.Ссылка = Штрихкоды.Владелец
		|ГДЕ
		|	МаршрутныйЛист.Ссылка = &ТекущийДокумент";
		
		РезультатШапка = Запрос.Выполнить();
		Если РезультатШапка.Пустой() Тогда 
			Возврат ТабДокумент;
		КонецЕсли;		
		Шапка = Запрос.Выполнить().Выбрать();
		Шапка.Следующий();
		
		Макет 					= ПолучитьМакет(НазваниеМакета);
		КодЯзыкаПечать 			= "ru";
		Макет.КодЯзыкаМакета 	= КодЯзыкаПечать;	
		
		Если Шапка.Штрихкод = "" Тогда 
			Сообщить("Документу не присвоен штрихкод.");
			Возврат ТабДокумент;
		КонецЕсли;	
		Попытка
			КомпонентШК = Новый COMОбъект("V8.Barcod.1");
			ОбластьШтрихкод = Макет.Области.ОбластьШтрихкод;
			РисунокШтрихкод = Макет.Рисунки.D9;
			РисунокШтрихкод.Расположить(ОбластьШтрихкод);
			ТипКода = ПолучитьЗначениеТипаШтрихкодаДляЭУ(Шапка.ТипШтрихкода);
			Если РаботаСТорговымОборудованием.ПроверитьШтрихКод(?(ПустаяСтрока(Шапка.ПредставлениеШтрихкода),
				Шапка.Штрихкод,
				Шапка.ПредставлениеШтрихкода),
				Шапка.ТипШтрихкода) Тогда
				
				Макет.Рисунки.D9.Объект.ТипКода   			= ТипКода;
				Макет.Рисунки.D9.Объект.Сообщение 			= ?(ПустаяСтрока(Шапка.ПредставлениеШтрихкода),
				Шапка.Штрихкод,
				Шапка.ПредставлениеШтрихкода);
			КонецЕсли;															  
		Исключение
			Сообщить("Компонента 1С:Печать штрихкодов не установлена на данном компьютере!", СтатусСообщения.Важное);
			Отказ = Истина;
		КонецПопытки;	
		
		СведенияОбОрганизации 						= УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(Шапка.Организация, Шапка.ДатаДокумента, , ,КодЯзыкаПечать);
		ОбластьМакета 								= Макет.ПолучитьОбласть("Шапка");
		ОбластьМакета.Параметры.Заполнить(Шапка);
		ОбластьМакета.Параметры.НазваниеОрганизации	= ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОбОрганизации, "ПолноеНаименование,", Ложь,КодЯзыкаПечать);
		ОбластьМакета.Параметры.ЕДРПОУОрганизации	= ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОбОрганизации, "КодПоЕДРПОУ,", Ложь,КодЯзыкаПечать);
		ОбластьМакета.Параметры.ЮридическийАдрес    = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОбОрганизации, "ЮридическийАдрес,", Ложь,КодЯзыкаПечать);
		ТабДокумент.Вывести(ОбластьМакета);
		ОбластьШапки = ОбластьМакета;
		// -
		
		////////////////////////////////////////////////////////////////////////////////////////////////////////
		ТЗ = Новый ТаблицаЗначений;
		ТЗ.Колонки.Добавить("Контрагент");
		ТЗ.Колонки.Добавить("Артикул");	
		ТЗ.Колонки.Добавить("Номенклатура");
		ТЗ.Колонки.Добавить("Заказано");
		ТЗ.Колонки.Добавить("Количество");
		ТЗ.Колонки.Добавить("Вес");
		ТЗ.Колонки.Добавить("Цена");
		ТЗ.Колонки.Добавить("Сумма");
		ТЗ.Колонки.Добавить("ЗаказПокупателя");
		ТЗ.Колонки.Добавить("Комментарий");
		ТЗ.Колонки.Добавить("НомерСтрокиВТабЗагрМаш");
		
		
		
		//ТЗ.Колонки.Добавить("ЗаказПокупателя");
		//ТЗ.Колонки.Добавить("СерияНоменклатуры");
		
		Для Каждого СтрЗаказы Из Заказы Цикл
			
			Для Каждого СтрТоварыЗаказов Из ТоварыЗаказов Цикл 
				Если СтрТоварыЗаказов.ЗаказПокупателя = СтрЗаказы.ЗаказПокупателя Тогда				
					
					Отбор = Новый Структура;
					Отбор.Вставить("ЗаказПокупателя", СтрТоварыЗаказов.ЗаказПокупателя);
					Отбор.Вставить("Номенклатура", СтрТоварыЗаказов.Номенклатура);
					
					НайденныеСтроки = ЗагрузкаМашины.НайтиСтроки(Отбор);
					
					Если НайденныеСтроки.Количество() = 0 Тогда
						//вивод пусту строку
						НоваяСтрТЗ = ТЗ.Добавить();
						НоваяСтрТЗ.Контрагент = СтрЗаказы.Контрагент;
						НоваяСтрТЗ.Артикул = СтрТоварыЗаказов.Номенклатура.Артикул;
						НоваяСтрТЗ.Номенклатура = СтрТоварыЗаказов.Номенклатура;
						НоваяСтрТЗ.Заказано = СтрТоварыЗаказов.Количество;
						НоваяСтрТЗ.Количество = 0;
						НоваяСтрТЗ.Вес = 0;
						НоваяСтрТЗ.Цена =  0;
						НоваяСтрТЗ.Сумма =  0;
						НоваяСтрТЗ.ЗаказПокупателя = СтрТоварыЗаказов.ЗаказПокупателя;
						НоваяСтрТЗ.Комментарий = СтрЗаказы.ЗаказПокупателя.Комментарий;
						//НоваяСтрТЗ.НомерСтрокиВТабЗагрМаш = 
						
					ИначеЕсли НайденныеСтроки.Количество() = 1 Тогда
						//вивод строку із заповн даними з загрузкиМашини
						Если  ТЗ.Найти(НайденныеСтроки[0].НомерСтроки, "НомерСтрокиВТабЗагрМаш") = Неопределено Тогда
							
							
							НоваяСтрТЗ = ТЗ.Добавить();
							НоваяСтрТЗ.Контрагент = СтрЗаказы.Контрагент;
							НоваяСтрТЗ.Артикул = НайденныеСтроки[0].Номенклатура.Артикул;
							НоваяСтрТЗ.Номенклатура = НайденныеСтроки[0].Номенклатура;
							НоваяСтрТЗ.Заказано = 1;
							НоваяСтрТЗ.Количество = НайденныеСтроки[0].Количество;
							НоваяСтрТЗ.Вес = НайденныеСтроки[0].ХарактеристикаНоменклатуры.Вага;
							НоваяСтрТЗ.Цена = НайденныеСтроки[0].Цена;
							НоваяСтрТЗ.Сумма = НайденныеСтроки[0].Сумма;
							НоваяСтрТЗ.ЗаказПокупателя = НайденныеСтроки[0].ЗаказПокупателя;
							НоваяСтрТЗ.Комментарий = СтрЗаказы.ЗаказПокупателя.Комментарий;
							НоваяСтрТЗ.НомерСтрокиВТабЗагрМаш = НайденныеСтроки[0].НомерСтроки;
							
							Если СтрТоварыЗаказов.Количество - НайденныеСтроки.Количество() > 0 Тогда
								НоваяСтрТЗ = ТЗ.Добавить();
								НоваяСтрТЗ.Контрагент = СтрЗаказы.Контрагент;
								НоваяСтрТЗ.Артикул = СтрТоварыЗаказов.Номенклатура.Артикул;
								НоваяСтрТЗ.Номенклатура = СтрТоварыЗаказов.Номенклатура;
								НоваяСтрТЗ.Заказано = СтрТоварыЗаказов.Количество - НайденныеСтроки.Количество();
								НоваяСтрТЗ.Количество = 0;
								НоваяСтрТЗ.Вес = 0;
								НоваяСтрТЗ.Цена =  0;
								НоваяСтрТЗ.Сумма =  0;
								НоваяСтрТЗ.ЗаказПокупателя = СтрТоварыЗаказов.ЗаказПокупателя;
								НоваяСтрТЗ.Комментарий = СтрЗаказы.ЗаказПокупателя.Комментарий;
								
							КонецЕсли;
						Иначе
							НоваяСтрТЗ = ТЗ.Добавить();
							НоваяСтрТЗ.Контрагент = СтрЗаказы.Контрагент;
							НоваяСтрТЗ.Артикул = СтрТоварыЗаказов.Номенклатура.Артикул;
							НоваяСтрТЗ.Номенклатура = СтрТоварыЗаказов.Номенклатура;
							НоваяСтрТЗ.Заказано = СтрТоварыЗаказов.Количество;
							НоваяСтрТЗ.Количество = 0;
							НоваяСтрТЗ.Вес = 0;
							НоваяСтрТЗ.Цена =  0;
							НоваяСтрТЗ.Сумма =  0;
							НоваяСтрТЗ.ЗаказПокупателя = СтрТоварыЗаказов.ЗаказПокупателя;
							НоваяСтрТЗ.Комментарий = СтрЗаказы.ЗаказПокупателя.Комментарий;
							
							
						КонецЕсли;
						
					ИначеЕсли НайденныеСтроки.Количество() > 1 Тогда
						
						зак = СтрТоварыЗаказов.Количество;
						
						Для Каждого Элемент Из НайденныеСтроки Цикл
							
							Если  ТЗ.Найти(Элемент.НомерСтроки, "НомерСтрокиВТабЗагрМаш") = Неопределено Тогда
								
								НоваяСтрТЗ = ТЗ.Добавить();
								НоваяСтрТЗ.Контрагент = СтрЗаказы.Контрагент;
								НоваяСтрТЗ.Артикул = Элемент.Номенклатура.Артикул;
								НоваяСтрТЗ.Номенклатура = Элемент.Номенклатура;
								
								Если зак > 0 Тогда
									НоваяСтрТЗ.Заказано = 1;
									зак = зак - 1;
								Иначе
									НоваяСтрТЗ.Заказано = 0;
								КонецЕсли;
								
								НоваяСтрТЗ.Количество = Элемент.Количество;
								НоваяСтрТЗ.Вес = Элемент.ХарактеристикаНоменклатуры.Вага;
								НоваяСтрТЗ.Цена = Элемент.Цена;
								НоваяСтрТЗ.Сумма = Элемент.Сумма;
								НоваяСтрТЗ.ЗаказПокупателя = Элемент.ЗаказПокупателя;
								НоваяСтрТЗ.Комментарий = СтрЗаказы.ЗаказПокупателя.Комментарий;
								НоваяСтрТЗ.НомерСтрокиВТабЗагрМаш = Элемент.НомерСтроки; 
								
								
							КонецЕсли;
							
						КонецЦикла;
						
						Если СтрТоварыЗаказов.Количество - НайденныеСтроки.Количество() > 0 Тогда
							
							НоваяСтрТЗ = ТЗ.Добавить();
							НоваяСтрТЗ.Контрагент = СтрЗаказы.Контрагент;
							НоваяСтрТЗ.Артикул = СтрТоварыЗаказов.Номенклатура.Артикул;
							НоваяСтрТЗ.Номенклатура = СтрТоварыЗаказов.Номенклатура;
							НоваяСтрТЗ.Заказано = СтрТоварыЗаказов.Количество - НайденныеСтроки.Количество();
							НоваяСтрТЗ.Количество = 0;
							НоваяСтрТЗ.Вес = 0;
							НоваяСтрТЗ.Цена =  0;
							НоваяСтрТЗ.Сумма =  0;
							НоваяСтрТЗ.ЗаказПокупателя = СтрТоварыЗаказов.ЗаказПокупателя;
							НоваяСтрТЗ.Комментарий = СтрЗаказы.ЗаказПокупателя.Комментарий;
							
						КонецЕсли;
						
						
					Иначе 
						Сообщить("Упссссс.... Шото пошло не так");
						
					КонецЕсли;	
					
				КонецЕсли;	
				
			КонецЦикла;	
			
		КонецЦикла;
		
		//Перебрати в ТЧ ЗагрузкаМашины строки без Заказів і додати їх до ТЗ
		
		//Отбор = Новый Структура;
		//Отбор.Вставить("ЗаказПокупателя", Документы.ЗаказПокупателя.ПустаяСсылка());
		
		//ТоварБезЗаказа = ЗагрузкаМашины.НайтиСтроки(Отбор);
		//Для Каждого Элемент Из ТоварБезЗаказа Цикл
		//	НоваяСтрТЗ = ТЗ.Добавить();
		//	НоваяСтрТЗ.Контрагент = Справочники.Контрагенты.ПустаяСсылка();
		//	НоваяСтрТЗ.Артикул = Элемент.Номенклатура.Артикул;
		//	НоваяСтрТЗ.Номенклатура = Элемент.Номенклатура;
		//	НоваяСтрТЗ.Заказано = 0;
		//	НоваяСтрТЗ.Количество = Элемент.Количество;
		//	НоваяСтрТЗ.Вес = Элемент.ХарактеристикаНоменклатуры.Вага;
		//	НоваяСтрТЗ.Цена = Элемент.Цена;
		//	НоваяСтрТЗ.Сумма = Элемент.Сумма;
		//	НоваяСтрТЗ.ЗаказПокупателя = Элемент.ЗаказПокупателя;
		//	//НоваяСтрТЗ.Комментарий = СтрЗаказы.ЗаказПокупателя.Комментарий;
		//	НоваяСтрТЗ.НомерСтрокиВТабЗагрМаш = Элемент.НомерСтроки; 
		//	
		//КонецЦикла;
		//////////////////////
		Для Каждого СтрокаЗагрМаш Из ЗагрузкаМашины Цикл
			
			Если ТЗ.Найти(СтрокаЗагрМаш.НомерСтроки, "НомерСтрокиВТабЗагрМаш") = Неопределено Тогда
				
				НоваяСтрТЗ = ТЗ.Добавить();
				
				Если СтрокаЗагрМаш.ЗаказПокупателя = Документы.ЗаказПокупателя.ПустаяСсылка() Тогда
					НоваяСтрТЗ.Контрагент = Справочники.Контрагенты.ПустаяСсылка();
				Иначе
					НоваяСтрТЗ.Контрагент = СтрокаЗагрМаш.ЗаказПокупателя.Контрагент;
				КонецЕсли;
				
				НоваяСтрТЗ.Артикул = СтрокаЗагрМаш.Номенклатура.Артикул;
				НоваяСтрТЗ.Номенклатура = СтрокаЗагрМаш.Номенклатура;
				НоваяСтрТЗ.Заказано = 0;
				НоваяСтрТЗ.Количество = СтрокаЗагрМаш.Количество;
				НоваяСтрТЗ.Вес = СтрокаЗагрМаш.ХарактеристикаНоменклатуры.Вага;
				НоваяСтрТЗ.Цена = СтрокаЗагрМаш.Цена;
				НоваяСтрТЗ.Сумма = СтрокаЗагрМаш.Сумма;
				НоваяСтрТЗ.ЗаказПокупателя = СтрокаЗагрМаш.ЗаказПокупателя;
				НоваяСтрТЗ.Комментарий = СтрокаЗагрМаш.ЗаказПокупателя.Комментарий;
				НоваяСтрТЗ.НомерСтрокиВТабЗагрМаш = СтрокаЗагрМаш.НомерСтроки; 			
				
			КонецЕсли;  			
			
		КонецЦикла;
		
		///////////////////////////////////////////////////////////////////////
		ВыборкаКонтрагенты = ТЗ.Скопировать();
		ВыборкаКонтрагенты.Свернуть("Контрагент, Комментарий","Заказано, Количество, Вес, Сумма");
		
		//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
		ОбластьМакета 			= Макет.ПолучитьОбласть("ШапкаТаблицы");
		ТабДокумент.Вывести(ОбластьМакета);
		
		Для Каждого СтрокаКонтрагенты из ВыборкаКонтрагенты Цикл
			
			ОбластьМакета 	= Макет.ПолучитьОбласть("СтрокаКонтрагента");
			
			ОбластьМакета.Параметры.Заполнить(СтрокаКонтрагенты);
			ОбластьМакета.Параметры.Город = СтрокаКонтрагенты.Контрагент.Город;
			ОбластьМакета.Параметры.Телефон =  СтрокаКонтрагенты.Контрагент.НомерТелефона;
			
			
			
			Если СтрокаКонтрагенты.Контрагент = Справочники.Контрагенты.ПустаяСсылка() Тогда
				
				ОбластьМакета.Параметры.Контрагент = "Без Заказа";
				
			Иначе
				ЗавданняКонтрагента = Завдання.Найти(СтрокаКонтрагенты.Контрагент, "Контрагент"); 
				Если Не ЗавданняКонтрагента = Неопределено Тогда
					ОбластьМакета.Параметры.Завдання = ЗавданняКонтрагента.Коментар;
				КонецЕсли;
			КонецЕсли;
			
			ТабДокумент.Вывести(ОбластьМакета);
			
			Для Каждого СтрокаТЗ Из ТЗ Цикл
				
				Если СтрокаТЗ.Контрагент = СтрокаКонтрагенты.Контрагент Тогда
					
					ОбластьМакета = Макет.ПолучитьОбласть("СтрокаТовара");
					ОбластьМакета.Параметры.Заполнить(СтрокаТЗ);
					ОбластьМакета.Параметры.Комментарий = "";
					
					Если СтрокаТЗ.Цена > 0 и СтрокаТЗ.Количество > 0 и СтрокаТЗ.Вес > 0 Тогда
						
						//вивод ціну за КГ	
						ОбластьМакета.Параметры.Цена = СтрокаТЗ.Цена/СтрокаТЗ.Количество/СтрокаТЗ.Вес;
						
						//Иначе 
						//	ОбластьМакета.Параметры.Цена = ВесовойУчет.ПолучитьЦенуЗаВес(Шапка.ДатаДокумента, СтрокаТЗ.Номенклатура, Истина);
						
					КонецЕсли; 
					
					//ОбластьМакета.Параметры.Заказано 	= Мин(СтрЗаказано.Количество, ВыборкаТовары.Количество);
					//СтрЗаказано.Количество 				= СтрЗаказано.Количество - Мин(СтрЗаказано.Количество, ВыборкаТовары.Количество);
					
					ТабДокумент.Вывести(ОбластьМакета);
					
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
		
		
		//ИтогоКоличество = 0;
		//ИтогоВес 		= 0;
		//ИтогоСумма 		= 0;
		//ИтогоЗаказано	= 0;
		
		//ВыборкаКонтрагенты 	= РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Контрагент");
		//Пока ВыборкаКонтрагенты.СледующийПоЗначениюПоля("Контрагент") Цикл  
		//ИтогоКоличество = ИтогоКоличество + ВыборкаКонтрагенты.Количество;
		//ИтогоВес 		= ИтогоВес + ВыборкаКонтрагенты.Вес;
		//ИтогоСумма 		= ИтогоСумма + ВыборкаКонтрагенты.Сумма;
		//
		//ОбластьМакета 	= Макет.ПолучитьОбласть("СтрокаКонтрагента");
		//ОбластьМакета.Параметры.Заполнить(СтрокаКонтрагенты);
		////КолЗаказано 	= 0;
		//Для Каждого СтрЗаказано Из ТЗТоварыЗаказов Цикл 
		//	Если СтрЗаказано.Контрагент = ВыборкаКонтрагенты.Контрагент Тогда
		//		КолЗаказано = КолЗаказано + СтрЗаказано.Количество;
		//	КонецЕсли;			
		//КонецЦикла;
		//ОбластьМакета.Параметры.Заказано 	= КолЗаказано;
		//ИтогоЗаказано 						= ИтогоЗаказано + КолЗаказано;
		//ТабДокумент.Вывести(ОбластьМакета);
		//////////////////////////////////////////////////////////////////////////////////
		//ВыборкаТовары = ВыборкаКонтрагенты.Выбрать();
		//Пока ВыборкаТовары.Следующий() Цикл
		//	ОбластьМакета = Макет.ПолучитьОбласть("СтрокаТовара");
		//	ОбластьМакета.Параметры.Заполнить(ВыборкаТовары);
		//	Если ВыборкаТовары.ЦенаЗаКГ <> null  И ВыборкаТовары.ЦенаЗаКГ > 0 Тогда 
		//		ОбластьМакета.Параметры.Цена = ВыборкаТовары.ЦенаЗаКГ
		//	Иначе 
		//		ОбластьМакета.Параметры.Цена = ВесовойУчет.ПолучитьЦенуЗаВес(Шапка.ДатаДокумента, ВыборкаТовары.Номенклатура, Истина);
		//	КонецЕсли; 	
		//	Для Каждого СтрЗаказано Из ТЗТоварыЗаказов Цикл 
		//		Если СтрЗаказано.Контрагент = ВыборкаТовары.Контрагент И СтрЗаказано.Артикул = ВыборкаТовары.Артикул И СтрЗаказано.Количество > 0 Тогда  
		//			ОбластьМакета.Параметры.Заказано 	= Мин(СтрЗаказано.Количество, ВыборкаТовары.Количество);
		//			СтрЗаказано.Количество 				= СтрЗаказано.Количество - Мин(СтрЗаказано.Количество, ВыборкаТовары.Количество);
		//		КонецЕсли;	
		//	КонецЦикла;	
		//	ТабДокумент.Вывести(ОбластьМакета);
		//КонецЦикла;
		//Для Каждого СтрЗаказано Из ТЗТоварыЗаказов Цикл 
		//	Если СтрЗаказано.Контрагент = ВыборкаКонтрагенты.Контрагент И СтрЗаказано.Количество > 0 Тогда
		//		ОбластьМакета 							= Макет.ПолучитьОбласть("СтрокаТовара");
		//		ОбластьМакета.Параметры.Артикул 		= СтрЗаказано.Артикул;
		//		ОбластьМакета.Параметры.Номенклатура 	= СтрЗаказано.Номенклатура;
		//		ОбластьМакета.Параметры.Заказано 		= СтрЗаказано.Количество;
		//		ОбластьМакета.Параметры.Количество 		= 0;
		//		ТабДокумент.Вывести(ОбластьМакета);
		//	КонецЕсли;	
		//КонецЦикла;	
		
		ОбластьМакета = Макет.ПолучитьОбласть("Подвал");
		ОбластьМакета.Параметры.ИтогоКоличество = ТЗ.Итог("Количество");
		ОбластьМакета.Параметры.Итоговес 		= ТЗ.Итог("Вес");
		ОбластьМакета.Параметры.ИтогоСумма 		= ТЗ.Итог("Сумма");
		ОбластьМакета.Параметры.ИтогоЗаказано 	= ТЗ.Итог("Заказано");
		ТабДокумент.Вывести(ОбластьМакета);	
		
		Если ЗначениеЗаполнено(Шапка.Комментарий) Тогда
			ОбластьМакета 						= Макет.ПолучитьОбласть("Примітка");
			ОбластьМакета.Параметры.Комментарий = Шапка.Комментарий;
			ТабДокумент.Вывести(ОбластьМакета);
		КонецЕсли;
		// -
		
		//Заповнити невідгружені товари
		
		//Запрос = Новый Запрос;
		//Запрос.Текст = 
		//"ВЫБРАТЬ
		//|	Товары.Номенклатура,
		//|	Товары.ХарактеристикаНоменклатуры,
		//|	Товары.ЗаказПокупателя,
		//|	Товары.СерияНоменклатуры,
		//|	Товары.КоличествоФакт,
		//|	Товары.Цена,
		//|	Товары.Сумма
		//|ПОМЕСТИТЬ НеОтгружено
		//|ИЗ
		//|	&Товары КАК Товары
		//|ГДЕ
		//|	Товары.КоличествоФакт > 0
		//|;
		//|
		//|////////////////////////////////////////////////////////////////////////////////
		//|ВЫБРАТЬ
		//|	ЗаказПокупателяДок.Контрагент,
		//|	ЗаказПокупателяДок.Контрагент.НомерТелефона КАК НомерТелефона,
		//|	ЗаказПокупателяДок.Контрагент.Город КАК Город,
		//|	НеОтгружено.Номенклатура,
		//|	НеОтгружено.ХарактеристикаНоменклатуры,
		//|	НеОтгружено.СерияНоменклатуры,
		//|	НеОтгружено.КоличествоФакт КАК Количество,
		//|	НоменклатураСпр.Артикул,
		//|	НеОтгружено.Цена,
		//|	НеОтгружено.Сумма
		//|ИЗ
		//|	НеОтгружено КАК НеОтгружено
		//|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказПокупателя КАК ЗаказПокупателяДок
		//|		ПО НеОтгружено.ЗаказПокупателя = ЗаказПокупателяДок.Ссылка
		//|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК НоменклатураСпр
		//|		ПО НеОтгружено.Номенклатура = НоменклатураСпр.Ссылка";	
		//Запрос.УстановитьПараметр("Товары", ТоварыЗаказов.Выгрузить());
		//
		//
		//НевідгруженіТовари = Запрос.Выполнить().Выгрузить();
		
		//	НевідгруженіТовари = Новый ТаблицаЗначений;
		//	НевідгруженіТовари.Колонки.Добавить("Контрагент");
		
		//	НевідгруженіТовари.Колонки.Добавить("Номенклатура");
		//	НевідгруженіТовари.Колонки.Добавить("ХарактеристикаНоменклатуры");
		//НевідгруженіТовари.Колонки.Добавить("ЗаказПокупателя");
		//НевідгруженіТовари.Колонки.Добавить("СерияНоменклатуры");
		//НевідгруженіТовари.Колонки.Добавить("Количество");
		//НевідгруженіТовари.Колонки.Добавить("Цена");
		//НевідгруженіТовари.Колонки.Добавить("Сумма");
		
		//Для Каждого Стр Из ТоварыЗаказов Цикл
		//	
		//	//А = ЗагрузкаМашины.Найти(Стр.ЗаказПокупателя,"ЗаказПокупателя");	
		//	Если  ЗагрузкаМашины.Найти(Стр.ЗаказПокупателя,"ЗаказПокупателя")= Неопределено Тогда
		//		
		//		НоваСтрока = НевідгруженіТовари.Добавить();
		//		НоваСтрока.Контрагент = Стр.ЗаказПокупателя.Контрагент;
		//		НоваСтрока.Номенклатура = Стр.Номенклатура;
		//		НоваСтрока.ХарактеристикаНоменклатуры = Стр.ХарактеристикаНоменклатуры; 
		//		НоваСтрока.ЗаказПокупателя = Стр.ЗаказПокупателя;
		//		НоваСтрока.СерияНоменклатуры = Стр.СерияНоменклатуры;
		//		НоваСтрока.Количество = Стр.Количество;
		//		НоваСтрока.Цена = Стр.Цена;
		//		НоваСтрока.Сумма = Стр.Сумма;	 
		//		
		//	КонецЕсли;	 
		//	
		//КонецЦикла;
		//	
		//	
		//	Если НевідгруженіТовари.Количество() > 0 Тогда
		//		Область = Макет.ПолучитьОбласть("НеОтгруженоШапка");
		//		ТабДокумент.Вывести(Область);
		//		
		//		Контрагенты = НевідгруженіТовари.Скопировать();
		//		Контрагенты.Свернуть("Контрагент");
		//		
		//		Для Каждого Контрагент Из Контрагенты Цикл
		//			Область = Макет.ПолучитьОбласть("НеОтгруженоСтрокаКонтрагента");
		//			Область.Параметры.Контрагент = Контрагент.Контрагент;
		//			Область.Параметры.Город = Контрагент.Контрагент.Город;
		//			Область.Параметры.Телефон = Контрагент.Контрагент.НомерТелефона;
		//			
		//			Отбор = Новый Структура;
		//			Отбор.Вставить("Контрагент", Контрагент.Контрагент);
		//			Строки = НевідгруженіТовари.НайтиСтроки(Отбор);
		//			
		//			Всего = 0;
		//			ВсегоВес = 0;
		//			ВсегоСумма = 0;
		//			Для Каждого Стр Из Строки Цикл
		//				Всего = Всего + Стр.Количество;
		//				ВсегоВес = ВсегоВес + Стр.ХарактеристикаНоменклатуры.Вага;
		//				ВсегоСумма = ВсегоСумма + Стр.Цена*Стр.Количество;
		//			КонецЦикла;
		//			Область.Параметры.ОбщееКоличество = Всего;
		//			Область.Параметры.ОбщийВес = ВсегоВес;
		//			Область.Параметры.ОбщаяСумма = ВсегоСумма;
		//			ТабДокумент.Вывести(Область);
		//			
		//			Для Каждого Товар Из Строки Цикл
		//				ОбластьТовар = Макет.ПолучитьОбласть("НеОтгруженоСтрокаТовара");
		//				ОбластьТовар.Параметры.Номенклатура = Товар.Номенклатура;
		//				ОбластьТовар.Параметры.Артикул = Товар.Номенклатура.Артикул;
		//				ОбластьТовар.Параметры.Количество = Товар.Количество;
		//				Попытка
		//				ОбластьТовар.Параметры.Цена = Окр(Товар.Цена / Товар.ХарактеристикаНоменклатуры.Вага, 2);
		//				ОбластьТовар.Параметры.Вес = Товар.ХарактеристикаНоменклатуры;
		//				ОбластьТовар.Параметры.Сумма = Товар.Цена*Товар.Количество;
		//			Исключение
		//				КонецПопытки;
		//				ТабДокумент.Вывести(ОбластьТовар);
		//			КонецЦикла;
		//		КонецЦикла;
		//	КонецЕсли;
		
		Если Завдання.Количество() Тогда
			ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			ТабДокумент.Вывести(ОбластьШапки);
			Область = Макет.ПолучитьОбласть("ШапкаЗавдання");
			ТабДокумент.Вывести(Область);
			Область = Макет.ПолучитьОбласть("РядокЗавдання");

			Для Каждого Строка Из Завдання Цикл
				Если ВыборкаКонтрагенты.Найти(Строка.Контрагент) = Неопределено Тогда
					Область.Параметры.Контрагент = Строка.Контрагент;
					Область.Параметры.Завдання = Строка.Коментар;
					Область.Параметры.Місто = Строка.Контрагент.Город;
					Область.Параметры.Телефон = Строка.Контрагент.НомерТелефона;
					ТабДокумент.Вывести(Область);
				КонецЕсли;
		    КонецЦикла;
		КонецЕсли;		
		
		Возврат ТабДокумент;	
		
	КонецФункции // ПечатьМаршрутногоЛиста()	
	
	Функция ПечатьМаршрутногоЛистаСОплатой(НазваниеМакета)
		
		ТабДокумент 					= Новый ТабличныйДокумент;
		ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_МаршрутныйЛист";	
		ТабДокумент.ОриентацияСтраницы 	= ОриентацияСтраницы.Портрет;
		ТабДокумент.РазмерСтраницы 		= "A4";
		ТабДокумент.АвтоМасштаб 		= Истина;
		
		// Шапка
		Запрос = Новый Запрос();
		Запрос.УстановитьПараметр("ТекущийДокумент", ЭтотОбъект.Ссылка);
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	МаршрутныйЛист.Номер КАК НомерДокумента,
		|	МаршрутныйЛист.Дата КАК ДатаДокумента,
		|	МаршрутныйЛист.Организация КАК Организация,
		|	МаршрутныйЛист.Автомобиль КАК Автомобиль,
		|	МаршрутныйЛист.Склад КАК Склад,
		|	МаршрутныйЛист.Комментарий,
		|	ЕСТЬNULL(Штрихкоды.Штрихкод, """") КАК Штрихкод,
		|	ЕСТЬNULL(Штрихкоды.ТипШтрихкода, ЗНАЧЕНИЕ(ПланВидовХарактеристик.ТипыШтрихкодов.ПустаяСсылка)) КАК ТипШтрихкода,
		|	ЕСТЬNULL(Штрихкоды.ПредставлениеШтрихкода, """") КАК ПредставлениеШтрихкода
		|ИЗ
		|	Документ.МаршрутныйЛист КАК МаршрутныйЛист
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Штрихкоды КАК Штрихкоды
		|		ПО МаршрутныйЛист.Ссылка = Штрихкоды.Владелец
		|ГДЕ
		|	МаршрутныйЛист.Ссылка = &ТекущийДокумент";
		
		РезультатШапка = Запрос.Выполнить();
		Если РезультатШапка.Пустой() Тогда 
			Возврат ТабДокумент;
		КонецЕсли;		
		Шапка = Запрос.Выполнить().Выбрать();
		Шапка.Следующий();
		
		Макет 					= ПолучитьМакет(НазваниеМакета);
		КодЯзыкаПечать 			= "ru";
		Макет.КодЯзыкаМакета 	= КодЯзыкаПечать;	
		
		Если Шапка.Штрихкод = "" Тогда 
			Сообщить("Документу не присвоен штрихкод.");
			Возврат ТабДокумент;
		КонецЕсли;	
		Попытка
			КомпонентШК = Новый COMОбъект("V8.Barcod.1");
			ОбластьШтрихкод = Макет.Области.ОбластьШтрихкод;
			РисунокШтрихкод = Макет.Рисунки.D9;
			РисунокШтрихкод.Расположить(ОбластьШтрихкод);
			ТипКода = ПолучитьЗначениеТипаШтрихкодаДляЭУ(Шапка.ТипШтрихкода);
			Если РаботаСТорговымОборудованием.ПроверитьШтрихКод(?(ПустаяСтрока(Шапка.ПредставлениеШтрихкода),
				Шапка.Штрихкод,
				Шапка.ПредставлениеШтрихкода),
				Шапка.ТипШтрихкода) Тогда
				
				Макет.Рисунки.D9.Объект.ТипКода   			= ТипКода;
				Макет.Рисунки.D9.Объект.Сообщение 			= ?(ПустаяСтрока(Шапка.ПредставлениеШтрихкода),
				Шапка.Штрихкод,
				Шапка.ПредставлениеШтрихкода);
			КонецЕсли;															  
		Исключение
			Сообщить("Компонента 1С:Печать штрихкодов не установлена на данном компьютере!", СтатусСообщения.Важное);
			Отказ = Истина;
		КонецПопытки;	
		
		СведенияОбОрганизации 						= УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(Шапка.Организация, Шапка.ДатаДокумента, , ,КодЯзыкаПечать);
		ОбластьМакета 								= Макет.ПолучитьОбласть("Шапка");
		ОбластьМакета.Параметры.Заполнить(Шапка);
		ОбластьМакета.Параметры.НазваниеОрганизации	= ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОбОрганизации, "ПолноеНаименование,", Ложь,КодЯзыкаПечать);
		ОбластьМакета.Параметры.ЕДРПОУОрганизации	= ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОбОрганизации, "КодПоЕДРПОУ,", Ложь,КодЯзыкаПечать);
		ОбластьМакета.Параметры.ЮридическийАдрес    = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОбОрганизации, "ЮридическийАдрес,", Ложь,КодЯзыкаПечать);
		ТабДокумент.Вывести(ОбластьМакета);
		// -
		
		////////////////////////////////////////////////////////////////////////////////////////////////////////
		ТЗ = Новый ТаблицаЗначений;
		ТЗ.Колонки.Добавить("Контрагент");
		ТЗ.Колонки.Добавить("Артикул");	
		ТЗ.Колонки.Добавить("Номенклатура");
		ТЗ.Колонки.Добавить("Заказано");
		ТЗ.Колонки.Добавить("Количество");
		ТЗ.Колонки.Добавить("Вес");
		ТЗ.Колонки.Добавить("Цена");
		ТЗ.Колонки.Добавить("Сумма");
		ТЗ.Колонки.Добавить("ЗаказПокупателя");
		ТЗ.Колонки.Добавить("Комментарий");
		ТЗ.Колонки.Добавить("НомерСтрокиВТабЗагрМаш");
		ТЗ.Колонки.Добавить("НомерСтроки");
		ТЗ.Колонки.Добавить("Штрихкод");
		ТЗ.Колонки.Добавить("Характеристика");
		
		
		КонтрагентыТЗ = ПолучитьСписокВсехКонтрагентов();
		
		ДолгПереплата = Новый ТаблицаЗначений;
		ДолгПереплата.Колонки.Добавить("Контрагент");
		ДолгПереплата.Колонки.Добавить("ДолгПереплата");
				
		Для Каждого Строка Из КонтрагентыТЗ Цикл
			Отбор = Новый Структура;
			Отбор.Вставить("Контрагент", Строка.Контрагент);
			СумаДолг = 0;		
			СтрокиДолг = Продажи.НайтиСтроки(Отбор);
			Для Каждого Стр Из СтрокиДолг Цикл
				СумаДолг = СумаДолг + Стр.Сумма;
			КонецЦикла;
			СумаОплата = 0;
			СтрокиОплата = Оплата.НайтиСтроки(Отбор);
			Для Каждого Стр Из СтрокиОплата Цикл
				Евро = Справочники.Валюты.НайтиПоКоду("978");
				Если Стр.Возврат Тогда
					//СумаОплата = СумаОплата - Ценообразование.ПересчитатьЦенуПриИзмененииВалюты(Стр.Сумма,Стр.Валюта,Евро,Стр.КурсУпр,,);
					СумаОплата = СумаОплата - МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(Стр.Сумма, Стр.Валюта, Евро, 
												Стр.КурсВал, Стр.КурсУпр,1,1);
				Иначе
					//СумаОплата = СумаОплата + Ценообразование.ПересчитатьЦенуПриИзмененииВалюты(Стр.Сумма,Стр.Валюта,Евро,Стр.КурсУпр,,);
					СумаОплата = СумаОплата + МодульВалютногоУчета.ПересчитатьИзВалютыВВалюту(Стр.Сумма, Стр.Валюта, Евро, 
												Стр.КурсВал, Стр.КурсУпр,1,1);

				КонецЕсли;
			КонецЦикла;
			НоваяСтрока = ДолгПереплата.Добавить();
			НоваяСтрока.Контрагент = Строка.Контрагент;
			НоваяСтрока.ДолгПереплата = СумаДолг - СумаОплата;
		КонецЦикла;
		
		
		ЗаказТЗ = Заказы.Выгрузить();
		ЗаказТЗ.Свернуть("ЗаказПокупателя");
		//Нов = ЗаказТЗ.Добавить();
		//Нов.ЗаказПокупателя = Документы.ЗаказПокупателя.ПустаяСсылка();
		
		Для Каждого СтрЗаказы Из Заказы Цикл
			
			Для Каждого СтрТоварыЗаказов Из ТоварыЗаказов Цикл 
				Если СтрТоварыЗаказов.ЗаказПокупателя = СтрЗаказы.ЗаказПокупателя Тогда
					Отбор = Новый Структура;
					Отбор.Вставить("ЗаказПокупателя", СтрТоварыЗаказов.ЗаказПокупателя);
					Отбор.Вставить("Номенклатура", СтрТоварыЗаказов.Номенклатура);
					
					НайденныеСтроки = Продажи.НайтиСтроки(Отбор);
					
					Если НайденныеСтроки.Количество() = 0 Тогда
						//вивод пусту строку
						НоваяСтрТЗ = ТЗ.Добавить();
						НоваяСтрТЗ.Контрагент = СтрЗаказы.Контрагент;
						НоваяСтрТЗ.Артикул = СтрТоварыЗаказов.Номенклатура.Артикул;
						НоваяСтрТЗ.Номенклатура = СтрТоварыЗаказов.Номенклатура;
						НоваяСтрТЗ.Заказано = СтрТоварыЗаказов.Количество;
						НоваяСтрТЗ.Количество = 0;
						НоваяСтрТЗ.Вес = 0;
						НоваяСтрТЗ.Цена =  0;
						НоваяСтрТЗ.Сумма =  0;
						НоваяСтрТЗ.ЗаказПокупателя = СтрТоварыЗаказов.ЗаказПокупателя;
						НоваяСтрТЗ.Комментарий = СтрЗаказы.ЗаказПокупателя.Комментарий;
						НоваяСтрТЗ.НомерСтроки = СтрТоварыЗаказов.НомерСтроки;
						НоваяСтрТЗ.Характеристика = СтрТоварыЗаказов.ХарактеристикаНоменклатуры;
						
					ИначеЕсли НайденныеСтроки.Количество() = 1 Тогда
						//вивод строку із заповн даними з загрузкиМашини
						Если  ТЗ.Найти(НайденныеСтроки[0].НомерСтроки, "НомерСтрокиВТабЗагрМаш") = Неопределено Тогда
							
							
							НоваяСтрТЗ = ТЗ.Добавить();
							НоваяСтрТЗ.Контрагент = СтрЗаказы.Контрагент;
							НоваяСтрТЗ.Артикул = НайденныеСтроки[0].Номенклатура.Артикул;
							НоваяСтрТЗ.Номенклатура = НайденныеСтроки[0].Номенклатура;
							НоваяСтрТЗ.Заказано = 1;
							НоваяСтрТЗ.Количество = НайденныеСтроки[0].Количество;
							НоваяСтрТЗ.Вес = НайденныеСтроки[0].ХарактеристикаНоменклатуры.Вага;
							НоваяСтрТЗ.Цена = НайденныеСтроки[0].Цена;
							НоваяСтрТЗ.Сумма = НайденныеСтроки[0].Сумма;
							НоваяСтрТЗ.ЗаказПокупателя = НайденныеСтроки[0].ЗаказПокупателя;
							НоваяСтрТЗ.Комментарий = СтрЗаказы.ЗаказПокупателя.Комментарий;
							НоваяСтрТЗ.НомерСтрокиВТабЗагрМаш = НайденныеСтроки[0].НомерСтроки;
							НоваяСтрТЗ.НомерСтроки = СтрТоварыЗаказов.НомерСтроки;
							НоваяСтрТЗ.Характеристика = НайденныеСтроки[0].ХарактеристикаНоменклатуры;
							
							Если СтрТоварыЗаказов.Количество - НайденныеСтроки.Количество() > 0 Тогда
								НоваяСтрТЗ = ТЗ.Добавить();
								НоваяСтрТЗ.Контрагент = СтрЗаказы.Контрагент;
								НоваяСтрТЗ.Артикул = СтрТоварыЗаказов.Номенклатура.Артикул;
								НоваяСтрТЗ.Номенклатура = СтрТоварыЗаказов.Номенклатура;
								НоваяСтрТЗ.Заказано = СтрТоварыЗаказов.Количество - НайденныеСтроки.Количество();
								НоваяСтрТЗ.Количество = 0;
								НоваяСтрТЗ.Вес = 0;
								НоваяСтрТЗ.Цена =  0;
								НоваяСтрТЗ.Сумма =  0;
								НоваяСтрТЗ.ЗаказПокупателя = СтрТоварыЗаказов.ЗаказПокупателя;
								НоваяСтрТЗ.Комментарий = СтрЗаказы.ЗаказПокупателя.Комментарий;
								НоваяСтрТЗ.НомерСтроки = СтрТоварыЗаказов.НомерСтроки;
								НоваяСтрТЗ.Характеристика = СтрТоварыЗаказов.ХарактеристикаНоменклатуры;
							КонецЕсли;
						Иначе
							НоваяСтрТЗ = ТЗ.Добавить();
							НоваяСтрТЗ.Контрагент = СтрЗаказы.Контрагент;
							НоваяСтрТЗ.Артикул = СтрТоварыЗаказов.Номенклатура.Артикул;
							НоваяСтрТЗ.Номенклатура = СтрТоварыЗаказов.Номенклатура;
							НоваяСтрТЗ.Заказано = СтрТоварыЗаказов.Количество;
							НоваяСтрТЗ.Количество = 0;
							НоваяСтрТЗ.Вес = 0;
							НоваяСтрТЗ.Цена =  0;
							НоваяСтрТЗ.Сумма =  0;
							НоваяСтрТЗ.ЗаказПокупателя = СтрТоварыЗаказов.ЗаказПокупателя;
							НоваяСтрТЗ.Комментарий = СтрЗаказы.ЗаказПокупателя.Комментарий;
							НоваяСтрТЗ.НомерСтроки = СтрТоварыЗаказов.НомерСтроки;
							НоваяСтрТЗ.Характеристика = СтрТоварыЗаказов.ХарактеристикаНоменклатуры;
							
						КонецЕсли;
						
					ИначеЕсли НайденныеСтроки.Количество() > 1 Тогда
						
						зак = СтрТоварыЗаказов.Количество;
						
						Для Каждого Элемент Из НайденныеСтроки Цикл
							
							Если  ТЗ.Найти(Элемент.НомерСтроки, "НомерСтрокиВТабЗагрМаш") = Неопределено Тогда
								
								НоваяСтрТЗ = ТЗ.Добавить();
								НоваяСтрТЗ.Контрагент = СтрЗаказы.Контрагент;
								НоваяСтрТЗ.Артикул = Элемент.Номенклатура.Артикул;
								НоваяСтрТЗ.Номенклатура = Элемент.Номенклатура;
								
								Если зак > 0 Тогда
									НоваяСтрТЗ.Заказано = 1;
									зак = зак - 1;
								Иначе
									НоваяСтрТЗ.Заказано = 0;
								КонецЕсли;
								
								НоваяСтрТЗ.Количество = Элемент.Количество;
								НоваяСтрТЗ.Вес = Элемент.ХарактеристикаНоменклатуры.Вага;
								НоваяСтрТЗ.Цена = Элемент.Цена;
								НоваяСтрТЗ.Сумма = Элемент.Сумма;
								НоваяСтрТЗ.ЗаказПокупателя = Элемент.ЗаказПокупателя;
								НоваяСтрТЗ.Комментарий = СтрЗаказы.ЗаказПокупателя.Комментарий;
								НоваяСтрТЗ.НомерСтрокиВТабЗагрМаш = Элемент.НомерСтроки; 
								НоваяСтрТЗ.НомерСтроки = СтрТоварыЗаказов.НомерСтроки;
								НоваяСтрТЗ.Характеристика = Элемент.ХарактеристикаНоменклатуры;
							КонецЕсли;
							
						КонецЦикла;
						
						Если СтрТоварыЗаказов.Количество - НайденныеСтроки.Количество() > 0 Тогда
							
							НоваяСтрТЗ = ТЗ.Добавить();
							НоваяСтрТЗ.Контрагент = СтрЗаказы.Контрагент;
							НоваяСтрТЗ.Артикул = СтрТоварыЗаказов.Номенклатура.Артикул;
							НоваяСтрТЗ.Номенклатура = СтрТоварыЗаказов.Номенклатура;
							НоваяСтрТЗ.Заказано = СтрТоварыЗаказов.Количество - НайденныеСтроки.Количество();
							НоваяСтрТЗ.Количество = 0;
							НоваяСтрТЗ.Вес = 0;
							НоваяСтрТЗ.Цена =  0;
							НоваяСтрТЗ.Сумма =  0;
							НоваяСтрТЗ.ЗаказПокупателя = СтрТоварыЗаказов.ЗаказПокупателя;
							НоваяСтрТЗ.Комментарий = СтрЗаказы.ЗаказПокупателя.Комментарий;
							НоваяСтрТЗ.НомерСтроки = СтрТоварыЗаказов.НомерСтроки;
							НоваяСтрТЗ.Характеристика = СтрТоварыЗаказов.ХарактеристикаНоменклатуры;
						КонецЕсли;
						
						
					Иначе 
						Сообщить("Упссссс.... Шото пошло не так");
						
					КонецЕсли;	
					
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
		
		Отбор = Новый Структура;
		Отбор.Вставить("ЗаказПокупателя", Документы.ЗаказПокупателя.ПустаяСсылка());
		НайденныеСтроки = Продажи.НайтиСтроки(Отбор);
		Если НайденныеСтроки.Количество() > 0 Тогда
			Для Каждого Элемент Из НайденныеСтроки Цикл	
				НоваяСтрТЗ = ТЗ.Добавить();
				НоваяСтрТЗ.Контрагент = Элемент.Контрагент;
				НоваяСтрТЗ.Артикул = Элемент.Номенклатура.Артикул;
				НоваяСтрТЗ.Номенклатура = Элемент.Номенклатура;
				НоваяСтрТЗ.Количество = Элемент.Количество;
				НоваяСтрТЗ.Вес = Элемент.ХарактеристикаНоменклатуры.Вага;
				НоваяСтрТЗ.Цена = Элемент.Цена;
				НоваяСтрТЗ.Сумма = Элемент.Сумма;
				НоваяСтрТЗ.ЗаказПокупателя = Элемент.ЗаказПокупателя;
				НоваяСтрТЗ.Комментарий = СтрЗаказы.ЗаказПокупателя.Комментарий;
				НоваяСтрТЗ.НомерСтрокиВТабЗагрМаш = Элемент.НомерСтроки;
				НоваяСтрТЗ.Характеристика = Элемент.ХарактеристикаНоменклатуры;
			КонецЦикла;
		КонецЕсли;
		
		Для Каждого Строка Из Продажи Цикл
			Отбор = Новый Структура;
			Отбор.Вставить("ЗаказПокупателя", Строка.ЗаказПокупателя);
			Отбор.Вставить("Номенклатура", Строка.Номенклатура);
			Отбор.Вставить("Характеристика", Строка.ХарактеристикаНоменклатуры);
						
			НайденныеСтроки = ТЗ.НайтиСтроки(Отбор);
			
			Если НайденныеСтроки.Количество() = 0 Тогда
				
				НоваяСтрТЗ = ТЗ.Добавить();
				НоваяСтрТЗ.Контрагент = Строка.Контрагент;
				НоваяСтрТЗ.Артикул = Строка.Номенклатура.Артикул;
				НоваяСтрТЗ.Номенклатура = Строка.Номенклатура;
				НоваяСтрТЗ.Количество = Строка.Количество;
				НоваяСтрТЗ.Вес = Строка.ХарактеристикаНоменклатуры.Вага;
				НоваяСтрТЗ.Цена = Строка.Цена;
				НоваяСтрТЗ.Сумма = Строка.Сумма;
				НоваяСтрТЗ.ЗаказПокупателя = Строка.ЗаказПокупателя;
				//НоваяСтрТЗ.Комментарий = СтрЗаказы.ЗаказПокупателя.Комментарий;
				НоваяСтрТЗ.НомерСтрокиВТабЗагрМаш = Строка.НомерСтроки;
				НоваяСтрТЗ.Характеристика = Строка.ХарактеристикаНоменклатуры;
			КонецЕсли;
		КонецЦикла;
		
		
		
		ТЗ.Сортировать("Контрагент");
		//ТоварыЗаказов продажи
		ОбластьМакета 			= Макет.ПолучитьОбласть("ШапкаТаблицы");
		ТабДокумент.Вывести(ОбластьМакета);
		
		ОплатаПоЗаказах = Оплата.Выгрузить();
		//ОплатаПоЗаказах.Колонки.Добавить("Использовано", Новый ОписаниеТипов("Булево"));
		
		ОбщийВес = 0;
		ОбщаяСумма = 0;
		Для Каждого СтрокаКонтрагенты из КонтрагентыТЗ Цикл
						
			ОбластьМакета = Макет.ПолучитьОбласть("Контрагент");
			
			ОбластьМакета.Параметры.Контрагент = СтрокаКонтрагенты.Контрагент;
			ОбластьМакета.Параметры.Город = СтрокаКонтрагенты.Контрагент.Город;
			ОбластьМакета.Параметры.Область = СтрокаКонтрагенты.Контрагент.Область;
			ОбластьМакета.Параметры.Телефон =  СтрокаКонтрагенты.Контрагент.НомерТелефона;
			
			Сп = Новый СписокЗначений;
			СтруктураПоиска = Новый Структура;
			СтруктураПоиска.Вставить("Контрагент", СтрокаКонтрагенты.Контрагент);
			//СтруктураПоиска.Вставить("Использовано", Ложь);
			НайдСтроки = ОплатаПоЗаказах.НайтиСтроки(СтруктураПоиска);
						
			Для Каждого Стр Из НайдСтроки Цикл
				Если Стр.Возврат Тогда
					Если Стр.Безналичные Тогда
						Сп.Добавить("безгот: -" + Стр.Сумма + " " + Стр.Валюта);
					Иначе
						Сп.Добавить("-" + Стр.Сумма + " " + Стр.Валюта);
					КонецЕсли;
				Иначе
					Если Стр.Безналичные Тогда 
						Сп.Добавить("безгот: " + Стр.Сумма + " " + Стр.Валюта);
					Иначе
						Сп.Добавить("" + Стр.Сумма + " " + Стр.Валюта);
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
			
			ОбластьМакета.Параметры.Оплата = Сп;
			Значение = ДолгПереплата.Найти(СтрокаКонтрагенты.Контрагент).ДолгПереплата;
			
			Если Значение < 0 Тогда
				ОбластьМакета.Параметры.БоргПереплата = "переплата " + Значение * (-1) + " " + Евро;
			ИначеЕсли Значение > 0 Тогда
				ОбластьМакета.Параметры.БоргПереплата = "долг " + Значение + " " + Евро;
			КонецЕсли;
			
			ВесПоКонтрагенту = 0;
			СуммаПоКонтрАгенту = 0;
			Для Каждого Стр Из ТЗ Цикл
				Если Стр.Контрагент = СтрокаКонтрагенты.Контрагент Тогда
					ОбщаяСумма = ОбщаяСумма + Стр.Сумма;
					ОбщийВес = ОбщийВес + Стр.Вес;
					ВесПоКонтрагенту = ВесПоКонтрагенту + Стр.Вес;
					СуммаПоКонтрАгенту = СуммаПоКонтрАгенту + Стр.Сумма;
				КонецЕсли;
			КонецЦикла;
			
			ОбластьМакета.Параметры.Вес = Формат(ВесПоКонтрагенту, "ЧДЦ=3");
			ОбластьМакета.Параметры.Сумма = Формат(СуммаПоКонтрАгенту, "ЧДЦ=2");
			
			ТабДокумент.Вывести(ОбластьМакета);
			
			Для Каждого СтрокаТЗ Из ТЗ Цикл
				
				Если СтрокаТЗ.Контрагент = СтрокаКонтрагенты.Контрагент Тогда
					
					ОбластьМакета 	= Макет.ПолучитьОбласть("СтрокаКонтрагента");
					
					
					
					Если СтрокаТЗ.Цена > 0 и СтрокаТЗ.Количество > 0 и СтрокаТЗ.Вес > 0 Тогда
						
						//вивод ціну за КГ	
						ОбластьМакета.Параметры.Цена = СтрокаТЗ.Цена/СтрокаТЗ.Количество/СтрокаТЗ.Вес;
						
				
					Иначе
						ОбластьМакета.Параметры.Цена = 0;
					КонецЕсли; 
					
					ОбластьМакета.Параметры.Сумма = СтрокаТЗ.Сумма;
					ОбластьМакета.Параметры.Артикул = СтрокаТЗ.Артикул;
					ОбластьМакета.Параметры.Вес = СтрокаТЗ.Вес;
					
					ТабДокумент.Вывести(ОбластьМакета);
										
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
		
		ОбластьМакета = Макет.ПолучитьОбласть("Сума");
		ОбластьМакета.Параметры.Вес = Формат(ОбщийВес,"ЧДЦ=3");
		ОбластьМакета.Параметры.Сумма = Формат(ОбщаяСумма, "ЧДЦ=2");
		ТабДокумент.Вывести(ОбластьМакета);
					
		
		ОбластьМакета = Макет.ПолучитьОбласть("Підсумки");
		ВалютаТЗ = КурсыВалют.Выгрузить();
		Долар = Справочники.Валюты.НайтиПоКоду("840");
		ОбластьМакета.Параметры.Долар = Долар;
		ОбластьМакета.Параметры.КурсДолар = Формат(ВалютаТЗ.Найти(Долар).Курс, "ЧДЦ=2");
		Евро = Справочники.Валюты.НайтиПоКоду("978");
		ОбластьМакета.Параметры.Евро = Евро;
		ОбластьМакета.Параметры.КурсЕвро = Формат(ВалютаТЗ.Найти(Евро).Курс, "ЧДЦ=2");
		Грн = Справочники.Валюты.НайтиПоКоду("980");
		ОбластьМакета.Параметры.Грн = Грн;
		ОбластьМакета.Параметры.КурсГрн = Формат(ВалютаТЗ.Найти(Грн).Курс, "ЧДЦ=2");
		
		СуммаПлан = 0;
		Для Каждого Стр Из Заказы Цикл
			СуммаПлан = СуммаПлан + Стр.ЗаказПокупателя.СуммаДокумента;
		КонецЦикла;
		
		ОбластьМакета.Параметры.СумаПланДолар = Ценообразование.ПересчитатьЦенуПриИзмененииВалюты(СуммаПлан,Евро,Долар,ВалютаТЗ.Найти(Долар).Курс,,);
		ОбластьМакета.Параметры.СумаПланЕвро = СуммаПлан;
		ОбластьМакета.Параметры.СумаПланГрн = Ценообразование.ПересчитатьЦенуПриИзмененииВалюты(СуммаПлан,Евро,Грн,ВалютаТЗ.Найти(Грн).Курс,,);
		
		Итог1 = 0;
		Итог2 = 0;
		Итог3 = 0;
		Итог4 = 0;
		Для Каждого Строка Из Оплата Цикл
			Если Строка.Валюта = Справочники.Валюты.НайтиПоКоду("980") И Не Строка.Безналичные Тогда
				Если Строка.Возврат Тогда
					Итог1 = Итог1 - Строка.Сумма;
				Иначе
					Итог1 = Итог1 + Строка.Сумма;
				КонецЕсли;
			ИначеЕсли Строка.Валюта = Справочники.Валюты.НайтиПоКоду("840") Тогда
				Если Строка.Возврат Тогда
					Итог2 = Итог2 - Строка.Сумма;
				Иначе
					Итог2 = Итог2 + Строка.Сумма;
				КонецЕсли;
			ИначеЕсли Строка.Валюта = Справочники.Валюты.НайтиПоКоду("978") И НЕ Строка.Безналичные Тогда     // грн    готівка
				Если Строка.Возврат Тогда
					Итог3 = Итог3 - Строка.Сумма;
				Иначе
					Итог3 = Итог3 + Строка.Сумма;
				КонецЕсли;
			ИначеЕсли Строка.Валюта = Справочники.Валюты.НайтиПоКоду("980") И Строка.Безналичные Тогда     // грн  безнал
				Если Строка.Возврат Тогда
					Итог4 = Итог4 - Строка.Сумма;
				Иначе
					Итог4 = Итог4 + Строка.Сумма;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
		//Форма = ЭтотОбъект.ПолучитьФорму("ФормаДокумента");
		ОбластьМакета.Параметры.СумаФактДолар = Итог2;
		ОбластьМакета.Параметры.СумаФактЕвро = Итог3;
		ОбластьМакета.Параметры.СумаФактГрн = Итог1;
		ОбластьМакета.Параметры.СумаФактГрнБезготівка = Итог4;
		
		ОбластьМакета.Параметры.Кілометраж = ОдометрКонец - ОдометрНачало;
		
		ОбластьМакета.Параметры.ОплатаТранспортуГрн = (ОдометрКонец - ОдометрНачало) * ЦенаЗаКМ;
		//ОбластьМакета.Параметры.ОплатаТранспортуДолар = 
		//ОбластьМакета.Параметры.ОплатаТранспортуЕвро =
		
		ОбластьМакета.Параметры.ДобовіВитратиГрн = Витрати.Итог("СУма");
		//ОбластьМакета.Параметры.ДобовіВитратиДолар =
		//ОбластьМакета.Параметры.ДобовіВитратиЕвро = 
		
		ТабДокумент.Вывести(ОбластьМакета);
		
		Если Витрати.Количество() > 0 Тогда 
			ОбластьМакета = Макет.ПолучитьОбласть("ДобовіВитратиШапка");
			ТабДокумент.Вывести(ОбластьМакета);
			
			Для каждого Строка Из Витрати Цикл
				ОбластьМакета = Макет.ПолучитьОбласть("ДобовіВитрати");
				ОбластьМакета.Параметры.СтаттяВитрат = Строка.СтаттяВитрат;
				ОбластьМакета.Параметры.Сума = "" + Строка.Сума + " " + Грн;
				ТабДокумент.Вывести(ОбластьМакета);
			КонецЦикла;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Шапка.Комментарий) Тогда
			ОбластьМакета 						= Макет.ПолучитьОбласть("Примітка");
			ОбластьМакета.Параметры.Комментарий = Шапка.Комментарий;
			ТабДокумент.Вывести(ОбластьМакета);
		КонецЕсли;
		// -
		
				
		Возврат ТабДокумент;	
		
		
	КонецФункции
	
	Функция НайтиШтрихкод(ХарактеристикаСсылка)
		з = Новый Запрос;
		з.Текст = "ВЫБРАТЬ
		|	Штрихкоды.Штрихкод
		|ИЗ
		|	РегистрСведений.Штрихкоды КАК Штрихкоды
		|ГДЕ
		|	Штрихкоды.ХарактеристикаНоменклатуры = &ХарактеристикаНоменклатуры";
		з.УстановитьПараметр("ХарактеристикаНоменклатуры", ХарактеристикаСсылка);
		Выборка = з.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда 
			Возврат Выборка.Штрихкод;
		Иначе 
			Возврат Неопределено;
		КонецЕсли;
		
	КонецФункции
	
	Функция	ПолучитьСписокВсехКонтрагентов()
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	МаршрутныйЛистЗаказы.Контрагент
		|ИЗ
		|	Документ.МаршрутныйЛист.Заказы КАК МаршрутныйЛистЗаказы
		|ГДЕ
		|	МаршрутныйЛистЗаказы.Ссылка = &Ссылка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	МаршрутныйЛистПродажи.Контрагент
		|ИЗ
		|	Документ.МаршрутныйЛист.Продажи КАК МаршрутныйЛистПродажи
		|ГДЕ
		|	МаршрутныйЛистПродажи.Ссылка = &Ссылка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	МаршрутныйЛистОплата.Контрагент
		|ИЗ
		|	Документ.МаршрутныйЛист.Оплата КАК МаршрутныйЛистОплата
		|ГДЕ
		|	МаршрутныйЛистОплата.Ссылка = &Ссылка";
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		
		ТЗ = Запрос.Выполнить().Выгрузить();
		ТЗ.Свернуть("Контрагент");
		
		Возврат ТЗ;
		
	КонецФункции
	
	// Процедура осуществляет печать документа. Можно направить печать на 
	// экран или принтер, а также распечатать необходмое количество копий.
	//
	//  Название макета печати передается в качестве параметра,
	// по переданному названию находим имя макета в соответствии.
	//
	// Параметры:
	//  НазваниеМакета - строка, название макета.
	//
	Процедура Печать(ИмяМакета, КоличествоЭкземпляров = 1, НаПринтер = Ложь) Экспорт
		
		Если ЭтоНовый() Тогда
			Предупреждение("Документ можно распечатать только после его записи");
			Возврат;
		КонецЕсли;
		
		Если Не РаботаСДиалогами.ПроверитьМодифицированность(ЭтотОбъект) Тогда
			Возврат;
		КонецЕсли;
		
		Если ИмяМакета = "МаршрутныйЛист" Тогда
			ТабДокумент = ПечатьМаршрутногоЛиста(ИмяМакета);
		ИначеЕсли ИмяМакета = "МаршрутныйЛистСОплатой" Тогда
			ТабДокумент = ПечатьМаршрутногоЛистаСОплатой(ИмяМакета);
		КонецЕсли;
		
		УниверсальныеМеханизмы.НапечататьДокумент(ТабДокумент, КоличествоЭкземпляров, НаПринтер, ОбщегоНазначения.СформироватьЗаголовокДокумента(ЭтотОбъект, ЭтотОбъект.Метаданные().Представление()));
		
	КонецПроцедуры // Печать()
#КонецЕсли

// Возвращает доступные варианты печати документа
//
// Вовращаемое значение:
//  Струткура, каждая строка которой соответствует одному из вариантов печати
//  
Функция ПолучитьСтруктуруПечатныхФорм() Экспорт
	
	СтруктураДляПечати = Новый Структура;
	СтруктураДляПечати.Вставить("МаршрутныйЛист","Маршрутный лист");
	СтруктураДляПечати.Вставить("МаршрутныйЛистСОплатой","Маршрутный лист с оплатой");
	
	Возврат СтруктураДляПечати;		
	
КонецФункции // ПолучитьСтруктуруПечатныхФорм()

// Возвращает значение типа штрихкода для использования в ЭУ
// "1С:Печать штрихкодов"
//
// Параметры
// 	ТипКода -	ПланыВидовХарактеристик.ТипыШтрихкодов - тип, значение для которого
//				нужно получить
//
// Возвращаемое значение:
//   Число, которое может быть присвоено свойству ЭУ "ТипКода"
//
Функция ПолучитьЗначениеТипаШтрихкодаДляЭУ(ТипКода)
	
	Перем Значение;
	
	Если ТипКода = ПланыВидовХарактеристик.ТипыШтрихкодов.EAN8 Тогда
		Значение = 0;
	ИначеЕсли ТипКода = ПланыВидовХарактеристик.ТипыШтрихкодов.EAN13 Тогда
		Значение = 1;
	ИначеЕсли ТипКода = ПланыВидовХарактеристик.ТипыШтрихкодов.EAN128 Тогда
		Значение = 2;
	ИначеЕсли ТипКода = ПланыВидовХарактеристик.ТипыШтрихкодов.Code39 Тогда
		Значение = 3;
	ИначеЕсли ТипКода = ПланыВидовХарактеристик.ТипыШтрихкодов.Code128 Тогда
		Значение = 4;
	Иначе
		Значение = -1;
	КонецЕсли;
	
	Возврат Значение;
	
КонецФункции // ПолучитьЗначениеТипаШтрихкодаДляЭУ()

Процедура КонтрольЗагрузкиИРеализаций()
	Для Каждого Строка Из Продажи Цикл
		НайденныеСтроки = ЗагрузкаМашины.НайтиСтроки(Новый Структура("ЗаказПокупателя, Номенклатура, ХарактеристикаНоменклатуры, Возврат", Строка.ЗаказПокупателя, Строка.Номенклатура, Строка.ХарактеристикаНоменклатуры, Ложь));
		Для Каждого Стр Из НайденныеСтроки Цикл
			ЗагрузкаМашины.Удалить(Стр);
		КонецЦикла;
		
		//по ШК
		НайденныеСтроки = ЗагрузкаМашины.НайтиСтроки(Новый Структура("Штрихкод", Строка.Штрихкод));
		Для Каждого Стр Из НайденныеСтроки Цикл
			ЗагрузкаМашины.Удалить(Стр);
		КонецЦикла;
		НайденныеСтроки = ЗагрузкаМашины.НайтиСтроки(Новый Структура("Штрихкод", НРЕГ(Строка.Штрихкод)));
		Для Каждого Стр Из НайденныеСтроки Цикл
			ЗагрузкаМашины.Удалить(Стр);
		КонецЦикла;
		НайденныеСтроки = ЗагрузкаМашины.НайтиСтроки(Новый Структура("Штрихкод", ВРЕГ(Строка.Штрихкод)));
		Для Каждого Стр Из НайденныеСтроки Цикл
			ЗагрузкаМашины.Удалить(Стр);
		КонецЦикла;

		
		
		// Перевірим чи правильний заказ підтянутий, якщо ні очистим і потім проставим правильний. Тут очистка тільки
		Если ЗначениеЗаполнено(Строка.ЗаказПокупателя) Тогда
			СтрокиЗаказа = Заказы.НайтиСтроки(Новый Структура("ЗаказПокупателя", Строка.ЗаказПокупателя));
			Для Каждого СтрокаЗаказа Из СтрокиЗаказа Цикл
				Если СтрокаЗаказа.Контрагент <> Строка.Контрагент Тогда 
					Строка.ЗаказПокупателя = Документы.ЗаказПокупателя.ПустаяСсылка();
					Прервать;
				КонецЕсли;			
			КонецЦикла;			
		КонецЕсли;
		
		
		
		// Контроль проставлення заказів покупця
		Если НЕ ЗначениеЗаполнено(Строка.ЗаказПокупателя) Тогда 
			СтрокиЗаказа = Заказы.НайтиСтроки(Новый Структура("Контрагент", Строка.Контрагент));
			Для Каждого СтрокаЗаказа Из СтрокиЗаказа Цикл
				Если НЕ ЗначениеЗаполнено(Строка.ЗаказПокупателя) Тогда
					Строка.ЗаказПокупателя = СтрокаЗаказа.ЗаказПокупателя;
				КонецЕсли;
				
				СтрокиТовараВЗаказе = СтрокаЗаказа.ЗаказПокупателя.Товары.НайтиСтроки(Новый Структура("Номенклатура, ХарактеристикаНоменклатуры", Строка.Номенклатура, Строка.ХарактеристикаНоменклатуры));
				Если СтрокиТовараВЗаказе.Количество() Тогда 
					Строка.ЗаказПокупателя = СтрокаЗаказа.ЗаказПокупателя;
					Прервать;
				КонецЕсли;				
			КонецЦикла;	
		КонецЕсли;
		
	КонецЦикла;
	
	Продажи.Свернуть("Контрагент, ЗаказПокупателя, Номенклатура, ХарактеристикаНоменклатуры, СерияНоменклатуры, ЕдиницаИзмерения, Количество, Цена, Сумма, Качество, ДокументРезерва, Загружен, Возврат, Штрихкод, ЦенаПродажиВес");
	
КонецПроцедуры

Процедура КонтрольЦенВРеализациях()
	Для Каждого Строка Из Продажи Цикл
		з = Новый Запрос;
		з.Текст = "ВЫБРАТЬ
		          |	РеализацияТоваровУслуг.Ссылка
		          |ПОМЕСТИТЬ тз
		          |ИЗ
		          |	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
		          |ГДЕ
		          |	РеализацияТоваровУслуг.Сделка = &Сделка
		          |;
		          |
		          |////////////////////////////////////////////////////////////////////////////////
		          |ВЫБРАТЬ ПЕРВЫЕ 1
		          |	РеализацияТоваровУслугТовары.ЦенаПродажиВес,
		          |	РеализацияТоваровУслугТовары.Знижка
		          |ИЗ
		          |	тз КАК тз
		          |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
		          |		ПО тз.Ссылка = РеализацияТоваровУслугТовары.Ссылка
		          |ГДЕ
		          |	РеализацияТоваровУслугТовары.Номенклатура = &Номенклатура
		          |	И РеализацияТоваровУслугТовары.ХарактеристикаНоменклатуры = &ХарактеристикаНоменклатуры
		          |	И РеализацияТоваровУслугТовары.ЦенаПродажиВес > 0";
		з.УстановитьПараметр("Сделка", Строка.ЗаказПокупателя);
		з.УстановитьПараметр("Номенклатура", Строка.Номенклатура);
		з.УстановитьПараметр("ХарактеристикаНоменклатуры", Строка.ХарактеристикаНоменклатуры);
		Выборка = з.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда 
			Если Строка.ЦенаПродажиВес <> Выборка.ЦенаПродажиВес И Выборка.ЦенаПродажиВес > 0 Тогда 
				Строка.ЦенаПродажиВес = Выборка.ЦенаПродажиВес;
				Если НЕ Выборка.Знижка Тогда
					ЗаписьЖурналаРегистрации("МАРШРУТНИЙ_ДОКУМЕНТИ", УровеньЖурналаРегистрации.Информация,,," Д5----" +Строка.Сумма + Строка.ЗаказПокупателя);

					Строка.Цена = Строка.ХарактеристикаНоменклатуры.Вага * Строка.ЦенаПродажиВес; 
					Строка.Сумма = Строка.Цена * Строка.Количество;
				КонецЕсли;
			КонецЕсли;		
		КонецЕсли;	
	КонецЦикла;
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	Перем Значение;
	
	ПерепровестиВсеРеализацииБезДВижений();
	Если ЗначениеЗаполнено(Ссылка) И (СтатусДокумента <> Ссылка.СтатусДокумента) Тогда 
		ПерепровестиВсеРеализацииПоДанномуМаршрутнику();
	КонецЕсли;
	
	Если ДополнительныеСвойства.Свойство("ЗакрытьЗаказы", Значение) И Значение = Истина Тогда 
		ИзменитьАктуальностьЗаказа();
	КонецЕсли;
	
	Если ДополнительныеСвойства.Свойство("ОтменитьБронь", Значение) И Значение = Истина Тогда 
		ДополнительныеСвойства.Вставить("ОтменитьБронь", Ложь);
		
		ОчиститьБронь();
		
	КонецЕсли;

КонецПроцедуры

Процедура  ПерепровестиВсеРеализацииБезДВижений()
	Если Проведен И СтатусДокумента = Перечисления.СтатусыМаршрутногоЛиста.Завершен Тогда 
		з = новый Запрос;
		з.Текст = "ВЫБРАТЬ
		|	ТЗ.Ссылка
		|ИЗ
		|	(ВЫБРАТЬ
		|		РеализацияТоваровУслугТовары.Ссылка КАК Ссылка,
		|		ТоварыНаСкладах.Регистратор КАК Регистратор
		|	ИЗ
		|		Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыНаСкладах КАК ТоварыНаСкладах
		|			ПО (ТоварыНаСкладах.Регистратор = РеализацияТоваровУслугТовары.Ссылка)
		|				И РеализацияТоваровУслугТовары.Номенклатура = ТоварыНаСкладах.Номенклатура
		|				И (РеализацияТоваровУслугТовары.Ссылка.Проведен)
		|	
		|	СГРУППИРОВАТЬ ПО
		|		РеализацияТоваровУслугТовары.Ссылка,
		|		ТоварыНаСкладах.Регистратор) КАК ТЗ
		|ГДЕ
		|	ТЗ.Регистратор ЕСТЬ NULL";
		Выборка = з.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			Если Выборка.Ссылка.Проведен Тогда 
				РеаОб = Выборка.Ссылка.ПолучитьОбъект();
				Попытка
					РеаОб.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный);
				Исключение
					Сообщить(ОписаниеОшибки(), СтатусСообщения.Информация);
				КонецПопытки;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПерепровестиВсеРеализацииПоДанномуМаршрутнику() Экспорт
	Если Проведен Тогда 
		з = новый Запрос;
		з.Текст = "ВЫБРАТЬ
		          |	РеализацияТоваровУслуг.Ссылка
		          |ИЗ
		          |	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
		          |ГДЕ
		          |	РеализацияТоваровУслуг.Проведен
		          |	И РеализацияТоваровУслуг.МаршрутныйЛист = &МаршрутныйЛист";
		з.УстановитьПараметр("МаршрутныйЛист", Ссылка);
		Выборка = з.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			РеаОб = Выборка.Ссылка.ПолучитьОбъект();
				Попытка
					РеаОб.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный);
				Исключение
					Сообщить(ОписаниеОшибки(), СтатусСообщения.Информация);
				КонецПопытки;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

Процедура ИзменитьАктуальностьЗаказа()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	МаршрутныйЛистЗаказы.ЗаказПокупателя
		|ИЗ
		|	Документ.МаршрутныйЛист.Заказы КАК МаршрутныйЛистЗаказы
		|ГДЕ
		|	МаршрутныйЛистЗаказы.Ссылка = &Ссылка
		|	И МаршрутныйЛистЗаказы.ЗаказПокупателя.СтатусЗамовлення = &СтатусЗамовлення
		|
		|СГРУППИРОВАТЬ ПО
		|	МаршрутныйЛистЗаказы.ЗаказПокупателя";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("СтатусЗамовлення", Справочники.СтатусиЗамовлень.Новий);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Заказ = Выборка.ЗаказПокупателя.ПолучитьОбъект();
		Заказ.СтатусЗамовлення = Справочники.СтатусиЗамовлень.Неактуальний;
		Заказ.ОбменДанными.Загрузка = Истина;
		Заказ.Записать(РежимЗаписиДокумента.Запись);
	КонецЦикла;
	
	

КонецПроцедуры

Процедура ОчиститьБронь()
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		//|	МаршрутныйЛистТоварыЗаказов.ХарактеристикаНоменклатуры
		//|ИЗ
		//|	Документ.МаршрутныйЛист.ТоварыЗаказов КАК МаршрутныйЛистТоварыЗаказов
		//|ГДЕ
		//|	МаршрутныйЛистТоварыЗаказов.ХарактеристикаНоменклатуры.ПериодБрони >= &ПериодБрони
		//|	И МаршрутныйЛистТоварыЗаказов.Ссылка = &Ссылка
		//|
		//|ОБЪЕДИНИТЬ
		//|
		//|ВЫБРАТЬ
		//|	МаршрутныйЛистПродажи.ХарактеристикаНоменклатуры
		//|ИЗ
		//|	Документ.МаршрутныйЛист.Продажи КАК МаршрутныйЛистПродажи
		//|ГДЕ
		//|	МаршрутныйЛистПродажи.ХарактеристикаНоменклатуры.ПериодБрони >= &ПериодБрони
		//|	И МаршрутныйЛистПродажи.Ссылка = &Ссылка
		//|
		//|ОБЪЕДИНИТЬ
		//|
		//|ВЫБРАТЬ
		|	МаршрутныйЛистЗагрузкаМашины.ХарактеристикаНоменклатуры
		|ИЗ
		|	Документ.МаршрутныйЛист.ЗагрузкаМашины КАК МаршрутныйЛистЗагрузкаМашины
		|ГДЕ
		|	МаршрутныйЛистЗагрузкаМашины.ХарактеристикаНоменклатуры.ПериодБрони >= &ПериодБрони
		|	И МаршрутныйЛистЗагрузкаМашины.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", 		Ссылка);	
	Запрос.УстановитьПараметр("ПериодБрони", НачалоДня(ТекущаяДата()));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	ЗаписьЖурналаРегистрации("Технічні.Скасування броней", ,,Ссылка, "Товарів для скасування броні " + Выборка.Количество());
	Пока Выборка.Следующий() Цикл
		
		Объект = Выборка.ХарактеристикаНоменклатуры.ПолучитьОбъект();	
		Объект.Бронь = Неопределено;
		Объект.ПериодБрони = Неопределено;
		Объект.Записать();
		
	КонецЦикла;
	
	
КонецПроцедуры

Процедура ПодтянутьНеДогруженныеПродажи() Экспорт 
	з = Новый Запрос;
	з.Текст ="ВЫБРАТЬ
	         |	РеализацияТоваровУслугТовары.Номенклатура,
	         |	РеализацияТоваровУслугТовары.Контрагент,
	         |	РеализацияТоваровУслугТовары.Сделка КАК ЗаказПокупателя,
	         |	РеализацияТоваровУслугТовары.ХарактеристикаНоменклатуры,
	         |	РеализацияТоваровУслугТовары.ЕдиницаИзмерения,
	         |	РеализацияТоваровУслугТовары.Количество,
	         |	РеализацияТоваровУслугТовары.Цена,
	         |	РеализацияТоваровУслугТовары.Сумма,
	         |	РеализацияТоваровУслугТовары.Качество,
	         |	РеализацияТоваровУслугТовары.ЦенаПродажиВес,
	         |	Штрихкоды.Штрихкод
	         |ИЗ
	         |	(ВЫБРАТЬ
	         |		РеализацияТоваровУслугТовары.Ссылка КАК Ссылка,
	         |		РеализацияТоваровУслугТовары.НомерСтроки КАК НомерСтроки,
	         |		РеализацияТоваровУслугТовары.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	         |		РеализацияТоваровУслугТовары.ЕдиницаИзмеренияМест КАК ЕдиницаИзмеренияМест,
	         |		РеализацияТоваровУслугТовары.Качество КАК Качество,
	         |		РеализацияТоваровУслугТовары.Количество КАК Количество,
	         |		РеализацияТоваровУслугТовары.КоличествоМест КАК КоличествоМест,
	         |		РеализацияТоваровУслугТовары.Коэффициент КАК Коэффициент,
	         |		РеализацияТоваровУслугТовары.Номенклатура КАК Номенклатура,
	         |		РеализацияТоваровУслугТовары.ПроцентСкидкиНаценки КАК ПроцентСкидкиНаценки,
	         |		РеализацияТоваровУслугТовары.СерияНоменклатуры КАК СерияНоменклатуры,
	         |		РеализацияТоваровУслугТовары.СпособСписанияОстаткаТоваров КАК СпособСписанияОстаткаТоваров,
	         |		РеализацияТоваровУслугТовары.СтавкаНДС КАК СтавкаНДС,
	         |		РеализацияТоваровУслугТовары.Сумма КАК Сумма,
	         |		РеализацияТоваровУслугТовары.СуммаНДС КАК СуммаНДС,
	         |		РеализацияТоваровУслугТовары.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	         |		РеализацияТоваровУслугТовары.Цена КАК Цена,
	         |		РеализацияТоваровУслугТовары.Склад КАК Склад,
	         |		РеализацияТоваровУслугТовары.ПроцентАвтоматическихСкидок КАК ПроцентАвтоматическихСкидок,
	         |		РеализацияТоваровУслугТовары.УсловиеАвтоматическойСкидки КАК УсловиеАвтоматическойСкидки,
	         |		РеализацияТоваровУслугТовары.ЗначениеУсловияАвтоматическойСкидки КАК ЗначениеУсловияАвтоматическойСкидки,
	         |		РеализацияТоваровУслугТовары.КлючСтроки КАК КлючСтроки,
	         |		РеализацияТоваровУслугТовары.КлючСвязи КАК КлючСвязи,
	         |		РеализацияТоваровУслугТовары.ЗаказПокупателя КАК ЗаказПокупателя,
	         |		РеализацияТоваровУслугТовары.ЦенаПродажиВес КАК ЦенаПродажиВес,
	         |		РеализацияТоваровУслугТовары.Знижка КАК Знижка,
	         |		РеализацияТоваровУслугТовары.Ссылка.Контрагент КАК Контрагент,
	         |		РеализацияТоваровУслугТовары.Ссылка.Сделка КАК Сделка
	         |	ИЗ
	         |		Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
	         |	ГДЕ
	         |		РеализацияТоваровУслугТовары.Ссылка.МаршрутныйЛист = &МаршрутныйЛист
	         |		И РеализацияТоваровУслугТовары.Ссылка.Проведен) КАК РеализацияТоваровУслугТовары
	         |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	         |			МаршрутныйЛистПродажи.Ссылка КАК Ссылка,
	         |			МаршрутныйЛистПродажи.НомерСтроки КАК НомерСтроки,
	         |			МаршрутныйЛистПродажи.Контрагент КАК Контрагент,
	         |			МаршрутныйЛистПродажи.ЗаказПокупателя КАК ЗаказПокупателя,
	         |			МаршрутныйЛистПродажи.Номенклатура КАК Номенклатура,
	         |			МаршрутныйЛистПродажи.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	         |			МаршрутныйЛистПродажи.СерияНоменклатуры КАК СерияНоменклатуры,
	         |			МаршрутныйЛистПродажи.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	         |			МаршрутныйЛистПродажи.Количество КАК Количество,
	         |			МаршрутныйЛистПродажи.Цена КАК Цена,
	         |			МаршрутныйЛистПродажи.Сумма КАК Сумма,
	         |			МаршрутныйЛистПродажи.Качество КАК Качество,
	         |			МаршрутныйЛистПродажи.ДокументРезерва КАК ДокументРезерва,
	         |			МаршрутныйЛистПродажи.Загружен КАК Загружен,
	         |			МаршрутныйЛистПродажи.Возврат КАК Возврат,
	         |			МаршрутныйЛистПродажи.Штрихкод КАК Штрихкод,
	         |			МаршрутныйЛистПродажи.ЦенаПродажиВес КАК ЦенаПродажиВес
	         |		ИЗ
	         |			Документ.МаршрутныйЛист.Продажи КАК МаршрутныйЛистПродажи
	         |		ГДЕ
	         |			МаршрутныйЛистПродажи.Ссылка.Ссылка = &МаршрутныйЛист) КАК МаршрутныйЛистПродажи
	         |		ПО (МаршрутныйЛистПродажи.Номенклатура = РеализацияТоваровУслугТовары.Номенклатура)
	         |			И (МаршрутныйЛистПродажи.ХарактеристикаНоменклатуры = РеализацияТоваровУслугТовары.ХарактеристикаНоменклатуры)
	         |			И (МаршрутныйЛистПродажи.Контрагент = РеализацияТоваровУслугТовары.Контрагент)
	         |			И (МаршрутныйЛистПродажи.ЗаказПокупателя = РеализацияТоваровУслугТовары.Сделка)
	         |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.Штрихкоды КАК Штрихкоды
	         |		ПО РеализацияТоваровУслугТовары.Номенклатура = Штрихкоды.Владелец
	         |			И РеализацияТоваровУслугТовары.ХарактеристикаНоменклатуры = Штрихкоды.ХарактеристикаНоменклатуры
	         |ГДЕ
	         |	МаршрутныйЛистПродажи.Номенклатура ЕСТЬ NULL";
	з.УстановитьПараметр("МаршрутныйЛист", Ссылка);
	Выборка = з.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НовСтрПродажи = Продажи.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтрПродажи, Выборка);
	КонецЦикла;
	Записать();
КонецПроцедуры


мВалютаУправленческогоУчета 	= Константы.ВалютаУправленческогоУчета.Получить();
мВалютаРегламентированногоУчета = Константы.ВалютаРегламентированногоУчета.Получить();
