
Процедура ПриЗаписи(Отказ)
	Если ОбменДанными.Загрузка Тогда 
		Возврат;
	КонецЕсли;
	
	Общий.ЗарегистрироватьИзменения(ЭтотОбъект.Ссылка);
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	Если ОбменДанными.Загрузка Тогда 
		Возврат;
	КонецЕсли;
	
	Если ЭтоНовый() Тогда     
		ДатаСоздания = ТекущаяДата();
		НужноЗаноситьВИсторию  = Ложь;
		КонтрагентИстории = Справочники.Контрагенты.ПустаяСсылка();
		
		Если ЗначениеЗаполнено(Контрагент) Тогда
			НужноЗаноситьВИсторию = Истина;
			КонтрагентИстории = Контрагент;
		ИначеЕсли ЗначениеЗаполнено(КонтрагентДляДействий) Тогда
			НужноЗаноситьВИсторию = Истина;
			КонтрагентИстории = КонтрагентДляДействий;		    
		ИначеЕсли ЗначениеЗаполнено(КонтрагентВидео) Тогда
			НужноЗаноситьВИсторию = Истина;
			КонтрагентИстории = КонтрагентВидео; 		
		КонецЕсли;	 
		
		НагадуванняТекст = "Нагадування
		|
		|" + Нагадування;
		
		Менеджер = РегистрыСведений.РаботаСКлиентом.СоздатьМенеджерЗаписи();
		Менеджер.Период = ТекущаяДата();
		Менеджер.Клиент = КонтрагентИстории;
		Менеджер.Запись = НагадуванняТекст;
		Менеджер.УИД_Записи = Новый УникальныйИдентификатор;
		Если ТипДействяПриНапоминании = Перечисления.ТипыДействийПриНапоминании.ОтправкаСообщенияВайберОВидео Тогда
			Менеджер.АвтоматичнийЗаписБезВзаємодіїЗКлієнтом = Ложь;
		Иначе	                              
			Менеджер.АвтоматичнийЗаписБезВзаємодіїЗКлієнтом = Истина;
		КонецЕсли;	
		Менеджер.Записать();
		Если НужноЗаноситьВИсторию Тогда 
			Общий.ОбновитьПоследнююРаботуСКлиентом(КонтрагентИстории);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры
