
Функция СоздатьПользователяНаСервере() Экспорт
	
	Если ПользователиИнформационнойБазы.НайтиПоИмени("Пользователь") = Неопределено Тогда 
		
		НовыйПользователь = ПользователиИнформационнойБазы.СоздатьПользователя();
		НовыйПользователь.Имя = "Пользователь";
		НовыйПользователь.ПолноеИмя = "Пользователь";
		
		НовыйПользователь.Роли.Добавить(Метаданные.Роли.Найти("Пользователь"));
		
		НовыйПользователь.Записать();
		
		Возврат Истина;
		
	Иначе
		Возврат Ложь;                     
	КонецЕсли;	
	
КонецФункции