&НаСервере
Процедура ЗарегистрироватьИзменения(Объект) Экспорт
	нз = РегистрыСведений.РегистрацияОбмена.СоздатьНаборЗаписей();
	нз.Отбор.Объект.Использование = Истина;
	нз.Отбор.Объект.Значение = Объект;
	Запись = нз.Добавить();
	Запись.Объект = Объект;                         
	Запись.ИД = Новый УникальныйИдентификатор();
	нз.Записать();
КонецПроцедуры

&НаСервере
Функция ПолучитьДолгПартнера() Экспорт
	//з = Новый Запрос;
	//з.Текст = "ВЫБРАТЬ
	//          |	ДолгПартнеруОстатки.СуммаОстаток КАК Сумма
	//          |ИЗ
	//          |	РегистрНакопления.ДолгПартнеру.Остатки КАК ДолгПартнеруОстатки";
	//Выборка = з.Выполнить().Выбрать();
	//Если Выборка.Следующий() Тогда 
	//	Возврат Выборка.Сумма;
	//Иначе 
	//	Возврат 0;
	//КонецЕсли;	
	Возврат Константы.ДолгПартнера.Получить();	
КонецФункции


Функция ПолучитьТекстДолгаПартнера() Экспорт
	Долг = ПолучитьДолгПартнера();
	Если Долг < 0 Тогда
		Возврат "Долг компании: "+Формат(-Долг,"ЧДЦ=2")+" EUR.";
	Иначе
		Возврат "Долг партнера: "+Формат(Долг,"ЧДЦ=2")+" EUR.";
	КонецЕсли;
КонецФункции

Функция ПолучитьЗначениеКонстанты(ИмяКонстанты) Экспорт
	
	Возврат Константы[ИмяКонстанты].Получить();
	
КонецФункции


Функция ПолучитьДанныеТовараПоШК(Штрихкод, ТипЦен) Экспорт
	
	з = Новый Запрос;
	з.Текст = "ВЫБРАТЬ
	          |	Штрихкоды.Владелец КАК Номенклатура,
	          |	Штрихкоды.ХарактеристикаНоменклатуры КАК Характеристика,
	          |	Штрихкоды.ЕдиницаИзмерения КАК ЕдиницаИзмерения
	          |ИЗ
	          |	РегистрСведений.Штрихкоды КАК Штрихкоды
	          |ГДЕ
	          |	Штрихкоды.Штрихкод = &Штрихкод";
	з.УстановитьПараметр("Штрихкод",Штрихкод);
	Выборка = з.Выполнить().Выбрать();
	Стр = "";
	Если Выборка.Следующий() Тогда 
		Стр = Новый Структура;
		Стр.Вставить("Номенклатура",Выборка.Номенклатура);
		Стр.Вставить("Характеристика",Выборка.Характеристика);
		Стр.Вставить("ЕдиницаИзмерения",Выборка.ЕдиницаИзмерения);
		Стр.Вставить("Цена",ПолучитьЦенуНоменклатуры(Выборка.Номенклатура, Выборка.Характеристика, ТипЦен));
		Стр.Вставить("Остаток",ПолучитьОстатокНоменклатуры(Выборка.Номенклатура, Выборка.Характеристика, Выборка.ЕдиницаИзмерения));
		Стр.Вставить("Штрихкод",Штрихкод);
	КонецЕсли;
	Возврат Стр;
	
КонецФункции

//Функция ПолучитьДанныеТовараПоСсылке(Характеристика) Экспорт
//	
//		Стр = Новый Структура;
//		Стр.Вставить("Номенклатура",Характеристика.Владелец);
//		Стр.Вставить("Характеристика",Характеристика);
//		Стр.Вставить("ЕдиницаИзмерения",Справочники.ЕдиницыИзмерения.НайтиПоНаименованию("шт"));
//		Стр.Вставить("Цена",ПолучитьЦенуНоменклатуры(Выборка.Номенклатура, Выборка.Характеристика));
//		Стр.Вставить("Остаток",ПолучитьОстатокНоменклатуры(Выборка.Номенклатура, Выборка.Характеристика));
//		Стр.Вставить("Штрихкод","");
//		Возврат Стр;
//	
//КонецФункции

&НаСервере
Процедура ОбновитьСумаОплатиНаложкою(Реализация) Экспорт
	ТекРеализация = Реализация.ПолучитьОбъект();
	Оплаты = ПолучитьДанныеПоОплате(Реализация);
	ТекРеализация.СумаОплатиНаложкою = Окр((Реализация.Сума - Оплаты.СуммаУчета) * Оплаты.Курс.EUR, 0);
	ТекРеализация.Записать(РежимЗАписиДокумента.Запись);
КонецПроцедуры


&НаСервере
Функция ПолучитьТекстСообщенияВайбер(Знач Объект, ДляКлиента, Телефон = "") Экспорт
	ЗРеализации =  ТипЗнч(Объект.Ссылка) = Тип("ДокументСсылка.РеализацияТоваровУслуг");	
	ДоставкаТекст = "";
	Сума = 0;
	Сообщение = "";
	Контрагент = Объект.Контрагент;
	// Доставка    ////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
	
	Если ЗРеализации Тогда
		Сума = Объект.Товары.Итог("Сума");
		Если Объект.Доставка = Перечисления.НаявністьДоставки.Почта Тогда 
			ДоставкаТекст = "Відділення пошти № " + Объект.НомерВідділенняНП;
		ИначеЕсли Объект.Доставка = Перечисления.НаявністьДоставки.Самовывоз Тогда
			ДоставкаТекст = "Самовивіз";
		ИначеЕсли Объект.Доставка = Перечисления.НаявністьДоставки.Доставка Тогда
			ДоставкаТекст = "Адресна доставка
			|" + Объект.Контрагент.Адреса
			
		КонецЕсли;
	Иначе
		Сума = Объект.СуммаДокумента;
	КонецЕсли;
	
	//Если Не ДляКлиента Тогда 		
	
	Сообщение = Контрагент.Наименование +"
	
	|" + Контрагент.Область.Наименование + "
	|" + Контрагент.Город.Наименование +"
	|" + Телефон;
	
	//	КонецЕсли;
	Если ЗначениеЗаполнено(Сообщение) Или ЗначениеЗаполнено(ДоставкаТекст) Тогда 
		Сообщение = Сообщение + "
		|" + ДоставкаТекст +  "
		|";
	КонецЕсли;
	Если ЗРеализации Тогда
		/////////Перелік товарів//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////	
		Для Каждого Элемент Из Объект.Товары Цикл 
			Вес = Элемент.ХарактеристикаНоменклатуры.Вага;
			Если Вес = 0 Тогда 
				Попытка
					Вес = Число(Строка(Элемент.ХарактеристикаНоменклатуры));
				Исключение
					Вес = 20;
				КонецПопытки;
			КонецЕсли;
			
			Если ДляКлиента Тогда
				Сообщение  = Сообщение + "
				|[" + Элемент.Номенклатура.Наименование + "] " 
				+ Элемент.Количество * Вес + "х" + Элемент.ЦенаПродажиВес + " = " + Элемент.Сума;
			Иначе
				СекторНаСкладі = Элемент.ХарактеристикаНоменклатуры.СекторНаСкладі;
				Сообщение  = Сообщение + "
				|[" + Элемент.Номенклатура.Артикул + "] " + ?(Объект.Доставка = Перечисления.НаявністьДоставки.Почта," (" + Элемент.Штрихкод + ") ", "") +
				 ?(ЗначениеЗаполнено(СекторНаСкладі), "(" + СекторНаСкладі + ") ", " ") + (Элемент.Количество * Вес) + "х" + Элемент.ЦенаПродажиВес + " = " + Элемент.Сума;
				
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;

	//Суми////////////////////////////////////////////////////////////////////////////////////////////////////
	
	Оплаты = ПолучитьДанныеПоОплате(Объект);
	Если ЗначениеЗаполнено(Сообщение)  Тогда  
		Сообщение = Сообщение + "
		|";
	КонецЕсли;
	Если ЗРеализации Тогда
				Сообщение = Сообщение + "
				|Загальна сума: " + Формат(Объект.Сума, "ЧДЦ=2") + " €
				|Загальна сума: *" + Формат(Оплаты.Курс.EUR * Объект.Сума, "ЧДЦ=2") + " грн*"	;
	КонецЕсли;
	
	Если Оплаты.СуммаУчета > 0 Тогда
		ОплаченоСума = Оплаты.СуммаУчета;
		Если ОплаченоСума > Сума Тогда 
			ОплаченоСума = Сума;
		КонецЕсли;
		
		
		
		Сообщение = Сообщение +  "
		|Оплачено " +  Оплаты.СуммаУчета + " €" + "
		|Фактична оплата:"; 
		Для  Каждого СумаОплаты Из Оплаты.Суммы Цикл 
			Сообщение = Сообщение + ?(ЗначениеЗаполнено(СумаОплаты.Значение), " 
			|" + Формат(СумаОплаты.Значение, "ЧДЦ=2") + " " + СумаОплаты.Ключ, ""); 
			Если СумаОплаты.Ключ = "UAH_Безнал" Тогда				
				Сообщение = Сообщение + "
				|" + ПолучитьБанковскиеСчетаОплат(Объект);
			КонецЕсли;	
		КонецЦикла;
		
		Если Оплаты.Здача.EUR <> 0 ИЛИ Оплаты.Здача.UAH <> 0 ИЛИ Оплаты.Здача.USD <> 0 Тогда 
			СообщениеРешта = ""; 
			Для  Каждого СумаЗдача Из Оплаты.Здача Цикл 
				СообщениеРешта = СообщениеРешта + ?(ЗначениеЗаполнено(СумаЗдача.Значение), " 
				|" + Формат(СумаЗдача.Значение, "ЧДЦ=2") + " " + СумаЗдача.Ключ, "");  
			КонецЦикла;
			Если НЕ ПустаяСтрока(СообщениеРешта) Тогда 
				Сообщение = Сообщение +  "
				|Фактична решта: " + СообщениеРешта; 
			КонецЕсли;			
			
		КонецЕсли;
		
		
	КонецЕсли;
	
	//Курси////////////////////////////////////////////////////////////////////////////////////////////////
	Взаиморасчеты = Оплаты.Взаиморасчеты; 
	
	Сообщение = Сообщение + "
	|
	|Курс EUR " + Оплаты.Курс.EUR + "
	|Курс USD " + Оплаты.Курс.USD; 
	
	Если ЗРеализации Тогда   // Борг - Переплата
		//Если СообщениеРешта = "" И Взаиморасчеты.Статус = "Передплата" ИЛИ Взаиморасчеты.Статус <> "Передплата" Тогда 
		//	Сообщение = Сообщение + "
		//	|
		//	|" + Взаиморасчеты.Статус +  " "  + Взаиморасчеты.Сумма + " €";
		//КонецЕсли;
		//КонецЕсли;
		
		Если Объект.Сума - Оплаты.СуммаУчета > 0 Тогда  
			Сообщение = Сообщение + "	
			| Борг по документу " +  Формат(Объект.Сума - Оплаты.СуммаУчета, "ЧЦ=12; ЧДЦ=2;") + " €";
		ИначеЕсли Объект.Сума - Оплаты.СуммаУчета < 0 Тогда 
			Сообщение = Сообщение +  "
			| Передоплата по документу: " + Формат(Оплаты.СуммаУчета - Объект.Сума, "ЧЦ=12; ЧДЦ=2") + " €"; 		
		КонецЕсли;
		
		
		//Если ЗРеализации Тогда
		
		Если Объект.Наложка И Объект.Сума - Оплаты.СуммаУчета > 0 Тогда 
			Сообщение = Сообщение + "	
			| Наложений платіж " +  Формат(Объект.СумаОплатиНаложкою, "ЧДЦ=2") + " грн.";
		КонецЕсли;
		
		Если Не ДляКлиента Тогда 
			Сообщение = Сообщение + "	
			|Коментар: " + Объект.Коментар;
			
			Сообщение = Сообщение + "	
			|
			|" + Объект.Дата;

		КонецЕсли;
		
	Иначе 
		//мБорг = Контрагент.Борг - Оплаты.СуммаУчета ;
		//Сообщение = Сообщение + "
		//	|
		//    | " + ?(мБорг >=0, "Борг: ", "Переплата: ") + СтрЗаменить(Формат(мБорг , "ЧЦ=12; ЧДЦ=2;"), "-", "") + " €"
	КонецЕсли;
	
	
	Возврат Сообщение;

КонецФункции

&НаСервере
Функция ПолучитьТекстСообщенияВайберДляПрезентации(Знач Объект, ДляКлиента, Телефон = "") Экспорт

	ДоставкаТекст = "";
	Сума = 0;
	Сообщение = "";
	Контрагент = Объект.Контрагент;
			
	
	Сообщение = "Презентація / Завдання 
	|
	|" + Контрагент.Наименование + "
	
	|" + Контрагент.Область.Наименование + "
	|" + Контрагент.Город.Наименование + "
	|" + Телефон + "
	|";

	Если ЗначениеЗаполнено(Объект.Коментар) Тогда
		Сообщение  = Сообщение + "
		|" + Объект.Коментар;
	КонецЕсли;
	
	Сообщение  = Сообщение + "
	|";
	
	Для Каждого Элемент Из Объект.Товары Цикл 
			Сообщение  = Сообщение + "
			|[" + Элемент.Номенклатура.Артикул + "]  
			|"	+ Элемент.Коментар;
	КонецЦикла;


	
	Возврат Сообщение;

КонецФункции


Функция  ПолучитьДанныеПоОплате(Знач Объект) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КассовыйОрдер.СумаUAH КАК СумаUAH,
		//intrata_wald_24112021 ↓
		|	КассовыйОрдер.СумаUAH_Безнал КАК СумаUAH_Безнал,
		//intrata_wald_24112021 ↑
		|	КассовыйОрдер.СумаEUR КАК СумаEUR,
		|	КассовыйОрдер.СумаUSD КАК СумаUSD,
		|	КассовыйОрдер.КурсUSD КАК КурсUSD,
		|	КассовыйОрдер.КурсEUR КАК КурсEUR,
		|	ДенежныеСредства.Сумма КАК Сумма,
		|	КассовыйОрдер.ВидДвиженияДенежныхСредств КАК ВидДвиженияДенежныхСредств
		|ИЗ
		|	Документ.КассовыйОрдер КАК КассовыйОрдер
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ДенежныеСредства КАК ДенежныеСредства
		|		ПО КассовыйОрдер.Ссылка = ДенежныеСредства.Регистратор
		|ГДЕ " + ?(ТипЗнч(Объект.Ссылка) = Тип("ДокументСсылка.РеализацияТоваровУслуг")," 
		|	КассовыйОрдер.Основание = &Основание", " КассовыйОрдер.Ссылка = &Основание Или КассовыйОрдер.СдачаДокумента = &Основание") + "  
		|	И КассовыйОрдер.Проведен
		|
		|УПОРЯДОЧИТЬ ПО
		|	КассовыйОрдер.Дата";
	
	Запрос.УстановитьПараметр("Основание", Объект.Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Оплаты = Новый Структура("Курс, Суммы, Здача, Взаиморасчеты, СуммаУчета", 
	Новый Структура("EUR, USD", Объект.КурсEUR, Объект.КурсUSD),
	//intrata_wald_24112021 ↓
	//Новый Структура("EUR, USD, UAH", 0, 0, 0), 
	Новый Структура("EUR, USD, UAH, UAH_Безнал", 0, 0, 0, 0),
	//intrata_wald_24112021 ↑
	Новый Структура("EUR, USD, UAH", 0, 0, 0),
	Новый Структура("ВидРеализации, Статус, Сумма", "в борг", "Борг", 0), 
	0);
	Суммы = Оплаты.Суммы;
	Здача = Оплаты.Здача;
	ПерваяЗапись = Истина;
	Пока Выборка.Следующий() Цикл
		Если ПерваяЗапись Тогда 
			Оплаты.Курс.EUR = Выборка.КурсEUR;
			Оплаты.Курс.USD = Выборка.КурсUSD;
			ПерваяЗапись = Ложь;
		КонецЕсли;
		Если Выборка.ВидДвиженияДенежныхСредств = Перечисления.ВидДвиженияДенежныхСредств.Приход Тогда 
			Суммы.EUR = Суммы.EUR + Выборка.СумаEUR;
			Суммы.USD = Суммы.USD + Выборка.СумаUSD;
			Суммы.UAH = Суммы.UAH + Выборка.СумаUAH;
			Суммы.UAH_Безнал = Суммы.UAH_Безнал + Выборка.СумаUAH_Безнал; //intrata_wald_24112021
			Оплаты.СуммаУчета = Оплаты.СуммаУчета + Выборка.Сумма;
		Иначе
			Здача.EUR = Здача.EUR + Выборка.СумаEUR;
			Здача.USD = Здача.USD + Выборка.СумаUSD;
			Здача.UAH = Здача.UAH + Выборка.СумаUAH;
			Оплаты.СуммаУчета = Оплаты.СуммаУчета - Выборка.Сумма;
		КонецЕсли;
	КонецЦикла;
	Если ТипЗнч(Объект.Ссылка) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда  
		Взаиморасчеты = Оплаты.Взаиморасчеты; 
		Взаиморасчеты.Сумма = Объект.Сума - Оплаты.СуммаУчета + Объект.Контрагент.Борг;
		Если Взаиморасчеты.Сумма < 0 Тогда 
			Взаиморасчеты.Сумма = -1 * Взаиморасчеты.Сумма;  
			Взаиморасчеты.ВидРеализации =  " по передплаті";
			Взаиморасчеты.Статус =  "Передплата";
		ИначеЕсли Объект.Наложка Тогда 
			Взаиморасчеты.ВидРеализации =  " по післяплаті";
			//Взаиморасчеты.Статус =  "Наложка";		
			
		КонецЕсли;
	КонецЕсли;
	Возврат Оплаты;
		
КонецФункции  

Функция  ПолучитьБанковскиеСчетаОплат(Знач Объект) Экспорт
	
	СтрокаПредставленияСчетов = "";
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КассовыйОрдер.БанковскийСчет КАК БанковскийСчет
		|ИЗ
		|	Документ.КассовыйОрдер КАК КассовыйОрдер
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ДенежныеСредства КАК ДенежныеСредства
		|		ПО КассовыйОрдер.Ссылка = ДенежныеСредства.Регистратор
		|ГДЕ " + ?(ТипЗнч(Объект.Ссылка) = Тип("ДокументСсылка.РеализацияТоваровУслуг")," 
		|	КассовыйОрдер.Основание = &Основание", " КассовыйОрдер.Ссылка = &Основание Или КассовыйОрдер.СдачаДокумента = &Основание") + "  
		|	И КассовыйОрдер.Проведен
		|
		|УПОРЯДОЧИТЬ ПО
		|	КассовыйОрдер.Дата";
	
	Запрос.УстановитьПараметр("Основание", Объект.Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Если ЗначениеЗаполнено(Выборка.БанковскийСчет) Тогда
			СтрокаПредставленияСчетов = СтрокаПредставленияСчетов + Строка(Выборка.БанковскийСчет) + Символы.ПС;
		КонецЕсли;	
	КонецЦикла;	
	
	Возврат СтрокаПредставленияСчетов;
КонецФункции	


Функция ПолучитьДанныеТовара(Номенклатура, ХарактеристикаНоменклатуры, ТипЦен) Экспорт
	
	//з = Новый Запрос;
	//з.Текст = "ВЫБРАТЬ
	//          |	Штрихкоды.Штрихкод
	//          |ИЗ
	//          |	РегистрСведений.Штрихкоды КАК Штрихкоды
	//          |ГДЕ
	//          |	Штрихкоды.Владелец = &Номенклатура
	//          |	И Штрихкоды.ЕдиницаИзмерения = &ЕдиницаИзмерения
	//          |	И Штрихкоды.ХарактеристикаНоменклатуры = &ХарактеристикаНоменклатуры";
	//з.УстановитьПараметр("Номенклатура",Номенклатура);
	//з.УстановитьПараметр("ХарактеристикаНоменклатуры",ХарактеристикаНоменклатуры);
	//з.УстановитьПараметр("ЕдиницаИзмерения",ЕдиницаИзмерения);
	//Выборка = з.Выполнить().Выбрать();
	//Стр = "";
	//Если Выборка.Следующий() Тогда 
		Стр = Новый Структура;
		Стр.Вставить("Номенклатура",Номенклатура);
		Стр.Вставить("Характеристика",ХарактеристикаНоменклатуры);
		//Стр.Вставить("ЕдиницаИзмерения",ЕдиницаИзмерения);
		Стр.Вставить("Цена",ПолучитьЦенуНоменклатуры(Номенклатура, ХарактеристикаНоменклатуры,ТипЦен));
		Стр.Вставить("Остаток",ПолучитьОстатокНоменклатуры(Номенклатура, ХарактеристикаНоменклатуры));
		Стр.Вставить("ТипЦен",ТипЦен);
	//КонецЕсли;
	Возврат Стр;
	
КонецФункции


Функция ПолучитьШтрихкодТовара(Номенклатура,Характеристика = Неопределено,Единица = Неопределено) Экспорт
	з = Новый Запрос;
	з.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	          |	Вложенный.Штрихкод КАК Штрихкод
	          |ИЗ
	          |	(ВЫБРАТЬ
	          |		Штрихкоды.Штрихкод КАК Штрихкод,
	          |		1 КАК Сортировка
	          |	ИЗ
	          |		РегистрСведений.Штрихкоды КАК Штрихкоды
	          |	ГДЕ
	          |		Штрихкоды.Владелец = &Владелец
	          |		И Штрихкоды.ЕдиницаИзмерения = &ЕдиницаИзмерения
	          |		И Штрихкоды.ХарактеристикаНоменклатуры = &ХарактеристикаНоменклатуры
	          |	
	          |	ОБЪЕДИНИТЬ ВСЕ
	          |	
	          |	ВЫБРАТЬ
	          |		Штрихкоды.Штрихкод,
	          |		2
	          |	ИЗ
	          |		РегистрСведений.Штрихкоды КАК Штрихкоды
	          |	ГДЕ
	          |		Штрихкоды.Владелец = &Владелец
	          |		И Штрихкоды.ХарактеристикаНоменклатуры = &ХарактеристикаНоменклатуры
	          |	
	          |	ОБЪЕДИНИТЬ ВСЕ
	          |	
	          |	ВЫБРАТЬ
	          |		Штрихкоды.Штрихкод,
	          |		3
	          |	ИЗ
	          |		РегистрСведений.Штрихкоды КАК Штрихкоды
	          |	ГДЕ
	          |		Штрихкоды.Владелец = &Владелец
	          |		И Штрихкоды.ЕдиницаИзмерения = &ЕдиницаИзмерения
	          |	
	          |	ОБЪЕДИНИТЬ ВСЕ
	          |	
	          |	ВЫБРАТЬ
	          |		Штрихкоды.Штрихкод,
	          |		4
	          |	ИЗ
	          |		РегистрСведений.Штрихкоды КАК Штрихкоды
	          |	ГДЕ
	          |		Штрихкоды.Владелец = &Владелец) КАК Вложенный";
	з.УстановитьПараметр("Владелец",Номенклатура);
	з.УстановитьПараметр("ХарактеристикаНоменклатуры",Характеристика);
	з.УстановитьПараметр("ЕдиницаИзмерения",Единица);
	Выборка = з.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда 
		Возврат Выборка.Штрихкод;
	КонецЕсли;
	Возврат "";
	
КонецФункции


Функция ПолучитьЦенуНоменклатуры(Номенклатура, ХарактеристикаНоменклатуры, ТипЦен) Экспорт
	з = Новый Запрос;
	з.Текст = "ВЫБРАТЬ
	          |	ЦеныНоменклатуры.Цена,
	          |	1 КАК Сортировка
	          |ИЗ
	          |	РегистрСведений.ЦеныНоменклатуры КАК ЦеныНоменклатуры
	          |ГДЕ
	          |	ЦеныНоменклатуры.Номенклатура = &Номенклатура
	          |	И ЦеныНоменклатуры.ХарактеристикаНоменклатуры = &ХарактеристикаНоменклатуры
	          |	И ЦеныНоменклатуры.ТипЦен = &ТипЦен
	          |
	          |ОБЪЕДИНИТЬ ВСЕ
	          |
	          |ВЫБРАТЬ
	          |	ЦеныНоменклатуры.Цена,
	          |	2
	          |ИЗ
	          |	РегистрСведений.ЦеныНоменклатуры КАК ЦеныНоменклатуры
	          |ГДЕ
	          |	ЦеныНоменклатуры.Номенклатура = &Номенклатура
	          |	И ЦеныНоменклатуры.ХарактеристикаНоменклатуры = &ПустаяХарактеристикаНоменклатуры
	          |	И ЦеныНоменклатуры.ТипЦен = &ТипЦен
	          |
	          |УПОРЯДОЧИТЬ ПО
	          |	Сортировка";
	з.УстановитьПараметр("Номенклатура",Номенклатура);
	з.УстановитьПараметр("ХарактеристикаНоменклатуры",ХарактеристикаНоменклатуры);
	з.УстановитьПараметр("ПустаяХарактеристикаНоменклатуры",Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка());
	з.УстановитьПараметр("ТипЦен",ТипЦен);
	Выборка = з.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда 
		Возврат Выборка.Цена;
	КонецЕсли;
	Возврат 0;	
КонецФункции

Функция ПолучитьОстатокНоменклатуры(Номенклатура, ХарактеристикаНоменклатуры, ЕдиницаИзмерения = Неопределено) Экспорт
	Возврат ХарактеристикаНоменклатуры.Залишок;

	
КонецФункции

Процедура КонстантыПриЗаписиПередЗаписью(Источник, Отказ) Экспорт	
	Если НЕ Отказ И Источник.Метаданные().Имя = "ПарольВхода" И Источник.Значение <> Константы.ПарольВхода.Получить() Тогда 
		Константы.ЭтоНеПервыйОбмен.Установить(Ложь);
	КонецЕсли;
КонецПроцедуры

Функция ПолучитьКвоты(Номенклатура) Экспорт
	Результат = Новый Структура;
	Результат.Вставить("Процент",Номенклатура.Квота);
	Результат.Вставить("Количество",Номенклатура.КвотаЕдиницы);
	Возврат Результат;
КонецФункции

Функция АвтообмінВключений() Экспорт
	Возврат Ложь;
	//Возврат Константы.АвтоматичнийОбмін.Получить();
КонецФункции

Функция АвтообмінКурсВалют() Экспорт
	Возврат Константы.АвтоматичнийОбмінКурсВалют.Получить();
КонецФункции

Процедура УстановитьВремяПоследнегоОбмена() Экспорт
	Константы.ВремяПоследнегоОбмена.Установить(ТекущаяДата());
КонецПроцедуры

Процедура ВиконатиФоновийОбмін() Экспорт
	ФЗ = ФоновыеЗадания.Выполнить("Обмен_УправлениеОбменом.ВыполнитьОбменДаннымиПолный");
	ФЗУИД = ФЗ.УникальныйИдентификатор;

КонецПроцедуры

Процедура ВиконатиФоновийОбмінВалют() Экспорт
	ФЗ = ФоновыеЗадания.Выполнить("Обмен_УправлениеОбменом.ЗавантажитиКурсиВалют");
	ФЗУИД = ФЗ.УникальныйИдентификатор;

КонецПроцедуры

Процедура ВыполнитьФоновийОбменДаннымиВыгрузкаЗаказов() Экспорт
	ФЗ = ФоновыеЗадания.Выполнить("Обмен_УправлениеОбменом.ВыполнитьОбменДаннымиВыгрузкаЗаказов");
	ФЗУИД = ФЗ.УникальныйИдентификатор;
ФоновыеЗадания.НайтиПоУникальномуИдентификатору(ФЗУИД)
КонецПроцедуры

Функция ОтриматиДатуОстанньогоОбміну()  Экспорт
	Возврат Константы.ДатаОстанньогоОбміну.Получить();
КонецФункции

Функция ОтриматиБоргиКлієнта(Клієнт) Экспорт
	СтруктураБорга = Новый Структура;
	СтруктураБорга.Вставить("Борг", Клієнт.Борг);
	СтруктураБорга.Вставить("ПросроченийБорг", Клієнт.ПросроченийБорг);
	СтруктураБорга.Вставить("БоргТзОВ", Клієнт.БоргТзОВ);
	СтруктураБорга.Вставить("ПросроченийБоргТзОВ", Клієнт.ПросроченийБоргТзОВ);
	Возврат СтруктураБорга;
КонецФункции


Функция Можно1Форму(Контрагент, Склад) Экспорт
	Если ЗначениеЗаполнено(Склад) Тогда 
		Возврат Склад.СтрокДіїЛіцензії > ТекущаяДата(); 
	Иначе
		Возврат Контрагент.СтрокДіїЛіцензії > ТекущаяДата();
	КонецЕсли;
КонецФункции

// Преобразует таблицу значений в массив структур.
// Может использоваться для передачи на клиент данных в том случае, если таблица
// значений содержит только такие значения, которые могут
// быть переданы с сервера на клиент.
//
// Полученный массив содержит структуры, каждая из которых повторяет
// структуру колонок таблицы значений.
//
// Не рекомендуется использовать для преобразования таблиц значений
// с большим количеством строк.
//
// Параметры:
//  ТаблицаЗначений - ТаблицаЗначений - исходная таблица значений.
//
// Возвращаемое значение:
//  Массив - коллекция строк таблицы в виде структур.
//
Функция ТаблицаЗначенийВМассив(ТаблицаЗначений) Экспорт
	
	Массив = Новый Массив();
	СтруктураСтрокой = "";
	НужнаЗапятая = Ложь;
	Для Каждого Колонка Из ТаблицаЗначений.Колонки Цикл
		Если НужнаЗапятая Тогда
			СтруктураСтрокой = СтруктураСтрокой + ",";
		КонецЕсли;
		СтруктураСтрокой = СтруктураСтрокой + Колонка.Имя;
		НужнаЗапятая = Истина;
	КонецЦикла;
	Для Каждого Строка Из ТаблицаЗначений Цикл
		НоваяСтрока = Новый Структура(СтруктураСтрокой);
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
		Массив.Добавить(НоваяСтрока);
	КонецЦикла;
	Возврат Массив;

КонецФункции

Функция ОтправитьНоменклатуруУВайбер(Характеристика) Экспорт
	  
	//Сообщить("1: Передана характеристика -" + Характеристика);
	//Сообщить("2: Продажна ціна -" + Константы.ТипЦенПродаж.Получить());

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ХарактеристикиНоменклатуры.Владелец.Наименование КАК Наименование,
		|	ХарактеристикиНоменклатуры.Вага КАК Вага,
		|	ХарактеристикиНоменклатуры.Залишок КАК Залишок,
		|	ХарактеристикиНоменклатуры.СсылкаНаYouTube КАК СсылкаНаYouTube,
		|	ЕСТЬNULL(ЦеныНоменклатуры.Цена, 0) КАК Цена,
		|	ЦеныНоменклатуры.ЦенаАкция КАК ЦенаАкция,
		|	ЦеныНоменклатуры.КонецАкции КАК КонецАкции,
		|	ХарактеристикиНоменклатуры.Описание КАК Описание,
		|	ХарактеристикиНоменклатуры.Владелец.ВідображатиВШтуках КАК ВідображатиВШтуках,
		|	ХарактеристикиНоменклатуры.Владелец.ДатаСозданияЭлемента КАК ДатаСозданияНоменклатуры
		|ИЗ
		|	РегистрСведений.ЦеныНоменклатуры КАК ЦеныНоменклатуры
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
		|		ПО ЦеныНоменклатуры.Номенклатура = ХарактеристикиНоменклатуры.Владелец
		|			И (ЦеныНоменклатуры.ТипЦен = &ТипЦен)
		|ГДЕ
		|	ХарактеристикиНоменклатуры.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("ТипЦен", Константы.ТипЦенПродаж.Получить());
	Запрос.УстановитьПараметр("Ссылка", Характеристика);
		
	Выборка =  Запрос.Выполнить().Выбрать();
	Если Не Выборка.Следующий() Тогда 
		Возврат Ложь;
	КонецЕсли;
	Курс = Константы.КурсEUR.Получить();	
	
	
	СимволБелыйКруг = ПолучитьСимволПоЮникоду(9898);
	СимволЗеленыйКруг = ПолучитьСимволПоЮникоду(128994); 
	СимволЧерныйБольшойКвадрат = "◼";
	СимволЧерныйМалыйКвадрат = "◾";   
	СимволУказательныйПалецУказываетВниз = ПолучитьСимволПоЮникоду(128071); 
	СимволКрасныйКвдарт = ПолучитьСимволПоЮникоду(128997); 
	СимволТелефон		 = ПолучитьСимволПоЮникоду(128242);
	СимволСтрелкаУказываетВниз = ПолучитьСимволПоЮникоду(11015);
	
	
	НаименованиеТовара = СимволЗеленыйКруг + СимволЧерныйМалыйКвадрат + " " + Выборка.Наименование + " " + СимволЧерныйМалыйКвадрат + СимволЗеленыйКруг;
	
	ТекстСообщения = "*" + НаименованиеТовара + "*";

	Если  ЗначениеЗаполнено(Выборка.ЦенаАкция) И Выборка.Цена >  Выборка.ЦенаАкция Тогда  		
		ТекстСообщения = ТекстСообщения + " 
		|
		|*" + СимволКрасныйКвдарт + СимволЧерныйБольшойКвадрат +  " АКЦІЯ " + СимволЧерныйБольшойКвадрат + СимволКрасныйКвдарт + "*";			
	КонецЕсли;

	Если  ЗначениеЗаполнено(Выборка.ДатаСозданияНоменклатуры) И Выборка.ДатаСозданияНоменклатуры >  ТекущаяДата() - 14 * 24 * 60 * 60 Тогда  		
		ТекстСообщения = ТекстСообщения + " 
		|
		|*" + СимволЗеленыйКруг + СимволБелыйКруг +  " НОВИНКА " + СимволБелыйКруг + СимволЗеленыйКруг + "*";			
	КонецЕсли;
	
	
			
	ТекстСообщения = ТекстСообщения + "
	|
	| " + СтрЗаменить(СокрЛП(ОбрізатиОпис(Выборка.Описание)), "¶", Символы.ПС)+ "
	| 
	| " + ?(Выборка.ВідображатиВШтуках,"*Кількість:","*Вага:    ") + Выборка.Вага + ?(Выборка.ВідображатиВШтуках," шт*"," кг*");
	                                   
	Если ЗначениеЗаполнено(Выборка.цена) Тогда 
		Если  ЗначениеЗаполнено(Выборка.ЦенаАкция) И Выборка.Цена >  Выборка.ЦенаАкция Тогда  		
			ТекстСообщения = ТекстСообщения + " 
			| ~*Ціна:    " + Формат(Выборка.Цена, "ЧДЦ=2") + " €/" + ?(Выборка.ВідображатиВШтуках,"шт*~" , "кг*~");			
		Иначе	
			ТекстСообщения = ТекстСообщения + " 
			| *Ціна:    " + Формат( Выборка.Цена, "ЧДЦ=2") + " €/" + ?(Выборка.ВідображатиВШтуках,"шт*" , "кг*");
		КонецЕсли;	
	КонецЕсли;
	
	Если  ЗначениеЗаполнено(Выборка.ЦенаАкция) И Выборка.Цена >  Выборка.ЦенаАкция Тогда  
		ТекстСообщения = ТекстСообщения + "
		| _*Акційна: " + Формат(Выборка.ЦенаАкция, "ЧДЦ=2") + " €/" + ?(Выборка.ВідображатиВШтуках,"шт**_" , "кг**_");
		//| до " + Формат(Выборка.КонецАкции, "ДЛФ=DD");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Выборка.Цена) Тогда 
		Если  ЗначениеЗаполнено(Выборка.ЦенаАкция) И Выборка.Цена >  Выборка.ЦенаАкция Тогда  				
			ТекстСообщения = ТекстСообщения + " 
			|
			| ~*Вартість лота: " + Формат(Выборка.Вага * Выборка.цена * Курс, "ЧДЦ=2") + " грн*~";			
		Иначе	
			ТекстСообщения = ТекстСообщения + " 
			|
			| *Вартість лота: " + Формат(Выборка.Вага * Выборка.цена * Курс, "ЧДЦ=2") + " грн*";
		КонецЕсли;	
	КонецЕсли;

	Если  ЗначениеЗаполнено(Выборка.ЦенаАкция) И Выборка.Цена >  Выборка.ЦенаАкция Тогда 
		ТекстСообщения = ТекстСообщения + "
		| _*Акційна: " +  Формат(Выборка.Вага * Выборка.ЦенаАкция * Курс , "ЧДЦ=2") + " грн*_"
	КонецЕсли;
	
	Запрос1 = Новый Запрос;
	Запрос1.Текст = 
	"ВЫБРАТЬ
	|	Штрихкоды.Штрихкод КАК Штрихкод
	|ИЗ
	|	РегистрСведений.Штрихкоды КАК Штрихкоды
	|ГДЕ
	|	Штрихкоды.ХарактеристикаНоменклатуры = &Характеристика";
	Запрос1.УстановитьПараметр("Характеристика", Характеристика);
	Вибірка = Запрос1.Выполнить().Выбрать();
	Если Вибірка.Следующий() Тогда
		
		ТекстСообщения = ТекстСообщения + "
		|
		//| *Курс EUR " + Курс + "*"; 
		| *Штрихкод " + Вибірка.Штрихкод + "*"; 
	КонецЕсли;
	ТекстСообщения = ТекстСообщения + "
		|
		| *Курс EUR " + Курс + "*"; 
	
	ТекстСообщения = ТекстСообщения + "
	|
	| Наші контакти : 
	| " + СимволУказательныйПалецУказываетВниз + СимволСтрелкаУказываетВниз + СимволУказательныйПалецУказываетВниз + СимволСтрелкаУказываетВниз + СимволУказательныйПалецУказываетВниз + СимволСтрелкаУказываетВниз + СимволУказательныйПалецУказываетВниз + СимволСтрелкаУказываетВниз + СимволУказательныйПалецУказываетВниз + СимволСтрелкаУказываетВниз + "
	| " + СимволТелефон + " *+380676710516*
	| " + СимволТелефон + " *+380993584992*";
	
	
	ТекстСообщения = ТекстСообщения + "
	|
	| " + Выборка.СсылкаНаYouTube;
	
	Возврат ТекстСообщения 
КонецФункции

&НаСервере
Функция ОбрізатиОпис(Рядок) Экспорт 
	
	Если СтрНайти(Рядок, "Сезон") Тогда
		н = СтрНайти(Рядок,"¶",,,1);
		Опис = СтрЗаменить(Рядок,Лев(Рядок,н),"");
	КонецЕсли;
	
	Возврат Опис;
	
КонецФункции

Функция ПолучитьТекстОписанияНоменклатуры(Номенклатура) Экспорт
	
	//Сообщить("1: Передана Номенклатура - " + Номенклатура);
	//Сообщить("2: Продажна ціна - " + Константы.ТипЦенПродаж.Получить());

	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ЕСТЬNULL(ЦеныНоменклатуры.Цена, 0) КАК Цена,
	|	ЦеныНоменклатуры.ЦенаАкция КАК ЦенаАкция,
	|	ЦеныНоменклатуры.КонецАкции КАК КонецАкции,
	|	Товары.Наименование КАК Наименование,
	|	Товары.ДополнительноеОписаниеНоменклатуры КАК Описание,
	|	Товары.YouTube КАК YouTube,
	|	Товары.ВідображатиВШтуках КАК ВідображатиВШтуках
	|ИЗ
	|	РегистрСведений.ЦеныНоменклатуры КАК ЦеныНоменклатуры
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Товары
	|		ПО (ЦеныНоменклатуры.ТипЦен = &ТипЦен)
	|			И ЦеныНоменклатуры.Номенклатура = Товары.Ссылка
	|ГДЕ
	|	Товары.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", Номенклатура);
	Запрос.УстановитьПараметр("ТипЦен", Константы.ТипЦенПродаж.Получить());
	

	СимволБелыйКруг = ПолучитьСимволПоЮникоду(9898);
	СимволЗеленыйКруг = ПолучитьСимволПоЮникоду(128994); 
	СимволЧерныйБольшойКвадрат = "◼";
	СимволЧерныйМалыйКвадрат = "◾";   
	СимволУказательныйПалецУказываетВниз = ПолучитьСимволПоЮникоду(128071); 
	СимволКрасныйКвдарт = ПолучитьСимволПоЮникоду(128997); 
	СимволТелефон		 = ПолучитьСимволПоЮникоду(128242);
	СимволСтрелкаУказываетВниз = ПолучитьСимволПоЮникоду(11015);
	
	
	
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл 
		НаименованиеТовара = СимволЗеленыйКруг + СимволЧерныйМалыйКвадрат + " " + Выборка.Наименование + " " + СимволЧерныйМалыйКвадрат + СимволЗеленыйКруг;	
		Текст = "*" + НаименованиеТовара + "*"
		+?(ЗначениеЗаполнено(Выборка.ЦенаАкция) И Выборка.Цена >  Выборка.ЦенаАкция, "
		|
		|*" + СимволКрасныйКвдарт + СимволЧерныйБольшойКвадрат +  " АКЦІЯ " + СимволЧерныйБольшойКвадрат + СимволКрасныйКвдарт + "*" , "" ) 
		+?(ЗначениеЗаполнено(Выборка.ЦенаАкция) И Выборка.Цена >  Выборка.ЦенаАкция, "
		|
		|*" + СимволЗеленыйКруг + СимволБелыйКруг +  " НОВИНКА " + СимволБелыйКруг + СимволЗеленыйКруг  + "*", "" ) + "			
		|
		|" + Выборка.Описание + " 
		|"
		+?(ЗначениеЗаполнено(Выборка.ЦенаАкция) И Выборка.Цена >  Выборка.ЦенаАкция, "
		|~*Ціна: " + Формат(Выборка.Цена, "ЧДЦ=2") + " €/" + ?(Выборка.ВідображатиВШтуках,"шт*~" , "кг*~"), "
		|*Ціна: " + Формат(Выборка.Цена, "ЧДЦ=2") + " €/" + ?(Выборка.ВідображатиВШтуках,"шт* " , "кг* ")) 
		+ ?(ЗначениеЗаполнено(Выборка.ЦенаАкция) И Выборка.Цена >  Выборка.ЦенаАкция, "  
		|_*Акційна: " + Формат(Выборка.ЦенаАкция, "ЧДЦ=2") + " €/" + ?(Выборка.ВідображатиВШтуках,"шт*_" , "кг*_"), "") + "
		|
		|Наші контакти : 
		|" + СимволУказательныйПалецУказываетВниз + СимволСтрелкаУказываетВниз + СимволУказательныйПалецУказываетВниз + СимволСтрелкаУказываетВниз + СимволУказательныйПалецУказываетВниз + СимволСтрелкаУказываетВниз + СимволУказательныйПалецУказываетВниз + СимволСтрелкаУказываетВниз + СимволУказательныйПалецУказываетВниз + СимволСтрелкаУказываетВниз + "
		|" + СимволТелефон + " *+380676710516*
		|" + СимволТелефон + " *+380993584992*		
		|
		|" + Выборка.YouTube;
	КонецЦикла;
	Возврат Текст;
	
КонецФункции

&НаСервере
Процедура ПолучитьДанныеУведомленийНаНеделю(Уведомления)Экспорт 
	Уведомления = Новый Массив;
	ДоНедели = ТекущаяДата() + 7 * 24 * 3600;
	ТекущееВремя = ТекущаяДата() - 60;  
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	мНагадування.Ссылка КАК Ссылка,
		|	мНагадування.Нагадування КАК Нагадування,
		|	мНагадування.Періодичність КАК Періодичність,
		|	мНагадування.ДеньНедели КАК ДеньНедели,
		|	мНагадування.ДатаНапоминания КАК ДатаНапоминания,
		|	мНагадування.Наименование КАК Наименование
		|ИЗ
		|	Справочник.Нагадування КАК мНагадування
		|ГДЕ
		|	мНагадування.Активне
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЗапланированыеУведомления.УИД_Уведомления КАК УИД_Уведомления
		|ИЗ
		|	РегистрСведений.ЗапланированыеУведомления КАК ЗапланированыеУведомления
		|ГДЕ
		|	НЕ ЗапланированыеУведомления.Отложено
		|	И ЗапланированыеУведомления.ДатаУведомления > &ДатаУведомления
		|	И НЕ ЗапланированыеУведомления.ОбъектУведомления.Періодичність = ЗНАЧЕНИЕ(Перечисление.Періоди.НеПовторювати)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЗапланированыеУведомления.ДанныеУведомления КАК ДанныеУведомления
		|ИЗ
		|	РегистрСведений.ЗапланированыеУведомления КАК ЗапланированыеУведомления
		|ГДЕ
		|	ЗапланированыеУведомления.Отложено
		|	И ЗапланированыеУведомления.ДатаУведомления > &ДатаУведомления";
	
	Запрос.УстановитьПараметр("ДатаУведомления", ТекущаяДата());
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	Выборка = РезультатЗапроса[1].Выбрать();
	Набор = РегистрыСведений.ЗапланированыеУведомления.СоздатьНаборЗаписей();	

	Пока Выборка.Следующий() Цикл 
		Набор.Отбор.УИД_Уведомления.Установить(Выборка.УИД_Уведомления);
		Набор.Записать();
	КонецЦикла;
	

	Выборка = РезультатЗапроса[0].Выбрать();
	
	Пока Выборка.Следующий() Цикл
		МассивДат = Новый Массив;
		мДатаНапоминания = Выборка.ДатаНапоминания;
		Если Выборка.Періодичність = Перечисления.Періоди.Щодня Тогда 
			Пока мДатаНапоминания < ДоНедели Цикл 
				Если мДатаНапоминания > ТекущееВремя Тогда 
					
					МассивДат.Добавить(мДатаНапоминания);
					
				КонецЕсли;
				
				мДатаНапоминания = мДатаНапоминания + 24 * 3600;
				
			КонецЦикла;
			
		ИначеЕсли Выборка.Періодичність = Перечисления.Періоди.Щотижня Тогда 
			мДеньНедели = ДеньНедели(мДатаНапоминания);
			мДатаНапоминания = мДатаНапоминания + (Выборка.ДеньНедели -  мДеньНедели) * 24 * 3600;
			Пока мДатаНапоминания  < ДоНедели Цикл 
				Если мДатаНапоминания > ТекущееВремя Тогда 
					
					МассивДат.Добавить(мДатаНапоминания);
					
				КонецЕсли;
				
				мДатаНапоминания = мДатаНапоминания + 7 * 24 * 3600;
				
			КонецЦикла;
		ИначеЕсли Выборка.Періодичність = Перечисления.Періоди.Щомісяця Тогда 
			
			
			Пока мДатаНапоминания  < ДоНедели Цикл 
				Если мДатаНапоминания > ТекущееВремя Тогда 
					
					МассивДат.Добавить(мДатаНапоминания);
					
				КонецЕсли;
				
				мДатаНапоминания = ДобавитьМесяц(мДатаНапоминания, 1);
				
				
			КонецЦикла;
		ИначеЕсли Выборка.Періодичність = Перечисления.Періоди.Щороку Тогда 
			
			
			Пока мДатаНапоминания  < ДоНедели Цикл 
				Если мДатаНапоминания > ТекущееВремя Тогда 
					
					МассивДат.Добавить(мДатаНапоминания);
					
				КонецЕсли;
				
				мДатаНапоминания = ДобавитьМесяц(мДатаНапоминания, 12);
				
				
			КонецЦикла;

			
		КонецЕсли;
		
		
		Если МассивДат.Количество() Тогда 			
			
			Для Каждого Дата Из МассивДат Цикл 
				УИД = Новый УникальныйИдентификатор;
				ДанныеУведомления = Новый Структура;;
				ДанныеУведомления.Вставить("Заголовок", Выборка.Наименование);
				ДанныеУведомления.Вставить("Текст", Выборка.Нагадування);
				ДанныеУведомления.Вставить("Данные"); 

				ДанныеУведомления["Данные"] = Новый Соответствие;
				ДанныеУведомления["Данные"]["Действие"] = "Напоминание";
				ДанныеУведомления["Данные"]["Дата"] = Дата;
				ДанныеУведомления["Данные"]["УИД_Уведомления"] = Строка(УИД);
				ДанныеУведомления["Данные"]["УИД_Напоминание"] = Строка(Выборка.Ссылка.УникальныйИдентификатор());
				ЗапланироватьУведомление(ДанныеУведомления, Ложь, УИД, Дата, Выборка.Ссылка);
				Уведомления.Добавить(ДанныеУведомления);

			КонецЦикла;	
			
		КонецЕсли;
	КонецЦикла;
	
	
	
	Для Каждого Элемент ИЗ РезультатЗапроса[2].Выгрузить() Цикл 
		ДанныеУведомления = Элемент.ДанныеУведомления.Получить();			 
		
		Уведомления.Добавить(ДанныеУведомления);
		
	КонецЦикла;
	
	
	
	

	  
КонецПроцедуры

&НаСервере
Функция  ДатаОтправки(Дата)
	
	Возврат Дата  + (ТекущаяУниверсальнаяДата() - ТекущаяДата()); 
	
КонецФункции


&НаСервере
Функция ПолучитьДанныеИзСтроки(Строка)Экспорт
	
	Чтение = Новый ЧтениеJSON;
	Чтение.УстановитьСтроку(Строка);
	Данные = ПрочитатьJSON(Чтение,Истина, "Дата");
	Чтение.Закрыть();
	
	Возврат Данные;
	
КонецФункции // ПолучитьСтроку()

&НаСервере
Функция ПолучитьСтрокуИзДанных(Данные) Экспорт
	
		
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	
	ЗаписатьJSON(ЗаписьJSON, Данные);
	
	Возврат ЗаписьJSON.Закрыть();
	
КонецФункции


Процедура ЗапланироватьУведомление(ДанныеУведомления, Отложено, УИД_Уведомления, ДатаУведомления, Напоминание) Экспорт 

	Запись = РегистрыСведений.ЗапланированыеУведомления.СоздатьМенеджерЗаписи();
	Запись.УИД_Уведомления = УИД_Уведомления;
	Запись.Отложено = Отложено;
	Запись.ДанныеУведомления = Новый ХранилищеЗначения(ДанныеУведомления);
	Запись.ДатаУведомления = ДатаУведомления;
	Запись.ОбъектУведомления = Напоминание;
	Запись.Записать();
	


КонецПроцедуры


&НаСервере
Функция ПолучитьУведомленияНаСервере(Дата) Экспорт 
	
	Массив = Новый Массив;	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВходящиеСообщения.Відправник КАК Відправник,
		|	ВходящиеСообщения.ГруппаЧата КАК ГруппаЧата,
		|	ВходящиеСообщения.Повідомлення КАК Текст,
		|	ВходящиеСообщения.ГруппаЧата.КартинкаГруппы КАК КартинкаГруппы
		|ИЗ
		|	РегистрСведений.ВходящиеСообщения КАК ВходящиеСообщения
		|ГДЕ
		|	ВходящиеСообщения.Дата >= &Дата";
	
	Запрос.УстановитьПараметр("Дата", Дата);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл 
		ДанныеСообщения = Новый Структура();
		ДанныеСообщения.Вставить("Текст", Выборка.Текст);
		ДанныеСообщения.Вставить("Відправник", Выборка.Відправник);
		ДанныеСообщения.Вставить("ГруппаЧата", Выборка.ГруппаЧата);
		ДанныеСообщения.Вставить("Картинка", Новый Картинка(Выборка.КартинкаГруппы.Получить()));

		Массив.Добавить(ДанныеСообщения);
	КонецЦикла;
	
	Возврат Массив;	

КонецФункции

&НаСервере
Функция СофрмроватьСообщениеНаВайберЗаказВидео(Номенклатура, Контрагент, КоличествоШтук) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Номенклатура.Наименование КАК Наименование,
		|	Номенклатура.Артикул КАК Артикул
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|ГДЕ
		|	Номенклатура.Ссылка = &Ссылка";

	Запрос.УстановитьПараметр("Ссылка", Номенклатура);
		
	Выборка =  Запрос.Выполнить().Выбрать();
	Если Не Выборка.Следующий() Тогда 
		Возврат Ложь;
	КонецЕсли;


	ТекстСообщения = " Треба відео
	|
	| Артикул : " + Выборка.Артикул + " 
	| " + Выборка.Наименование + "
		//| " + СтрЗаменить(СокрЛП(Выборка.Описание), "¶", Символы.ПС)+ "
	| ";
	
 	Если ЗначениеЗаполнено(КоличествоШтук) Тогда 
		ТекстСообщения = ТекстСообщения + " 
		| " + Строка(КоличествоШтук) + "шт.
		| ";
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Контрагент) Тогда 
		ТекстСообщения = ТекстСообщения + " 
		| " + Контрагент.Наименование + "
		| " + Контрагент.НомерТелефона + "
		| ";
	КонецЕсли;

	
	ТекстСообщения = ТекстСообщения + "
	| " + Константы.ПродавецПартнера.Получить() + " 
	| ";
	
	Возврат ТекстСообщения 
КонецФункции

&НаСервере
Процедура  УстановитьИдентификаторУстройства() Экспорт
	
	Если Не ЗначениеЗаполнено(Константы.ИдентификаторУстройства.Получить()) Тогда 
		Константы.ИдентификаторУстройства.Установить(Новый УникальныйИдентификатор);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СоздатьНапоминаниеСДействием(ТипДействия, Данные) Экспорт
	//Возврат;

	Если ТипДействия = Перечисления.ТипыДействийПриНапоминании.ЗакрытиеСтарыхЗаказов Тогда
		
		Если Не Данные.Свойство("Контрагент") Тогда
			Возврат;
		КонецЕсли;	
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗапланированыеУведомления.УИД_Уведомления КАК УИД_Уведомления
		|ИЗ
		|	РегистрСведений.ЗапланированыеУведомления КАК ЗапланированыеУведомления
		|ГДЕ
		|	ЗапланированыеУведомления.ОбъектУведомления.КонтрагентДляДействий = &КонтрагентДляДействий
		|	И ЗапланированыеУведомления.ОбъектУведомления.ТипДействяПриНапоминании = &ТипДействяПриНапоминании
		|	И ЗапланированыеУведомления.Выполнено = ЛОЖЬ";
		
		Запрос.УстановитьПараметр("КонтрагентДляДействий", Данные.Контрагент);
		Запрос.УстановитьПараметр("ТипДействяПриНапоминании", Перечисления.ТипыДействийПриНапоминании.ЗакрытиеСтарыхЗаказов);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		Если ВыборкаДетальныеЗаписи.Количество() = 0 Тогда
			мОбъект = Справочники.Нагадування.СоздатьЭлемент();
			НагадуванняТекст = "По контрагенту " + Строка(Данные.Контрагент) + " є протерміновані активні замовлення. Закрити їх?";;
			Если Данные.Свойство("АвтоматическоеЗакрытиеЗаказа") Тогда
				Если Данные.АвтоматическоеЗакрытиеЗаказа Тогда
					НагадуванняТекст = "По контрагенту " + Строка(Данные.Контрагент) + " було автоматично закрите активне замовлення.";
				КонецЕсли;	
			КонецЕсли;	
			ДатаНагадування = ТекущаяДата() + 60;
			мОбъект.Нагадування = НагадуванняТекст; 
			мОбъект.Наименование = "Нагадування!";
			мОбъект.Періодичність = Перечисления.Періоди.НеПовторювати;
			мОбъект.ДатаНапоминания = ДатаНагадування;
			мОбъект.Активне = Истина;
			мОбъект.КонтрагентДляДействий = Данные.Контрагент;
			мОбъект.ТипДействяПриНапоминании = Перечисления.ТипыДействийПриНапоминании.ЗакрытиеСтарыхЗаказов;
			
			мОбъект.ДеньНедели = ДеньНедели(ТекущаяДата());
			мОбъект.Записать();
			Напоминание = мОбъект.Ссылка;
			
			УИД = Новый УникальныйИдентификатор; 
			
			ДанныеУведомления = Новый Структура;;
			ДанныеУведомления.Вставить("Заголовок", "Нагадування!");
			ДанныеУведомления.Вставить("Текст", НагадуванняТекст);
			ДанныеУведомления.Вставить("Данные"); 
			
			ДанныеУведомления["Данные"] = Новый Соответствие;
			ДанныеУведомления["Данные"]["Действие"] = "Напоминание";
			ДанныеУведомления["Данные"]["Дата"] = ДатаНагадування;
			ДанныеУведомления["Данные"]["УИД_Уведомления"] = Строка(УИД); 
			ДанныеУведомления["Данные"]["УИД_Напоминание"] = Строка(Напоминание.УникальныйИдентификатор()); 
			
			Общий.ЗапланироватьУведомление(ДанныеУведомления, Ложь, УИД, ДатаНагадування, Напоминание); 
			
			//#Если МобильноеПриложениеСервер Тогда
			//	ЗаписьОчереди = РегистрыСведений.ОчередьЛокальныхУведомлений.СоздатьМенеджерЗаписи();
			//	ЗаписьОчереди.УИД_Уведомления = УИД;
			//	ЗаписьОчереди.Записать();
			//#КонецЕсли 
			
			
			//#Если  МобильноеПриложениеКлиент Тогда
			//	Уведомление = Новый ДоставляемоеУведомление;
			//	ЗаполнитьЗначенияСвойств(Уведомление, ДанныеУведомления, ,"Данные");
			//	Уведомление.Данные = Общий.ПолучитьСтрокуИзДанных(ДанныеУведомления["Данные"]);
			//	
			//	Уведомление.ДатаПоявленияУниверсальноеВремя = ДатаОтправки(ДатаНагадування);
			//	ДоставляемыеУведомления.ДобавитьЛокальноеУведомление(Уведомление);
			//	
			//	//		#Иначе
			//	//			Предупреждение("Для вашого пристрою не можливо встановити нагадування");
			//	//			Возврат;
			//#КонецЕсли 
			
		КонецЕсли;	
		
	ИначеЕсли ТипДействия = Перечисления.ТипыДействийПриНапоминании.ОтправкаСообщенияВайберОВидео Тогда	
		
		Если Не Данные.Свойство("Характеристика") Тогда
			Возврат;
		КонецЕсли;	
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗапланированыеУведомления.УИД_Уведомления КАК УИД_Уведомления
		|ИЗ
		|	РегистрСведений.ЗапланированыеУведомления КАК ЗапланированыеУведомления
		|ГДЕ
		|	ЗапланированыеУведомления.ОбъектУведомления.ХарактеристикаДляДействий = &ХарактеристикаДляДействий
		|	И ЗапланированыеУведомления.ОбъектУведомления.ТипДействяПриНапоминании = &ТипДействяПриНапоминании
		|	И ЗапланированыеУведомления.Выполнено = ЛОЖЬ";
		
		Запрос.УстановитьПараметр("ХарактеристикаДляДействий", Данные.Характеристика);
		Запрос.УстановитьПараметр("ТипДействяПриНапоминании", Перечисления.ТипыДействийПриНапоминании.ОтправкаСообщенияВайберОВидео);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать(); 
		
		Если ВыборкаДетальныеЗаписи.Количество() = 0 Тогда
			мОбъект = Справочники.Нагадування.СоздатьЭлемент();
			НагадуванняТекст = "По артикулу " + Строка(Данные.Характеристика.Владелец.Артикул) + " мішку " +  Строка(Данные.Характеристика) + " для контрагента " + Строка(Данные.Контрагент) +  " з'явилось відео. Відправити у вайбер повідомлення?";
			ДатаНагадування = ТекущаяДата() + 60;
			мОбъект.Нагадування = НагадуванняТекст; 
			мОбъект.Наименование = "Нагадування!";
			мОбъект.Періодичність = Перечисления.Періоди.НеПовторювати;
			мОбъект.ДатаНапоминания = ДатаНагадування;
			мОбъект.Активне = Истина;
			мОбъект.КонтрагентДляДействий = Данные.Контрагент;
			мОбъект.ХарактеристикаДляДействий = Данные.Характеристика;
			мОбъект.ТипДействяПриНапоминании = Перечисления.ТипыДействийПриНапоминании.ОтправкаСообщенияВайберОВидео;
			
			мОбъект.ДеньНедели = ДеньНедели(ТекущаяДата());
			мОбъект.Записать();
			Напоминание = мОбъект.Ссылка;
			
			УИД = Новый УникальныйИдентификатор; 
			
			ДанныеУведомления = Новый Структура;;
			ДанныеУведомления.Вставить("Заголовок", "Нагадування!");
			ДанныеУведомления.Вставить("Текст", НагадуванняТекст);
			ДанныеУведомления.Вставить("Данные"); 
			
			ДанныеУведомления["Данные"] = Новый Соответствие;
			ДанныеУведомления["Данные"]["Действие"] = "Напоминание";
			ДанныеУведомления["Данные"]["Дата"] = ДатаНагадування;
			ДанныеУведомления["Данные"]["УИД_Уведомления"] = Строка(УИД); 
			ДанныеУведомления["Данные"]["УИД_Напоминание"] = Строка(Напоминание.УникальныйИдентификатор()); 
			
			Общий.ЗапланироватьУведомление(ДанныеУведомления, Ложь, УИД, ДатаНагадування, Напоминание); 
			
			//#Если МобильноеПриложениеСервер Тогда
			//	ЗаписьОчереди = РегистрыСведений.ОчередьЛокальныхУведомлений.СоздатьМенеджерЗаписи();
			//	ЗаписьОчереди.УИД_Уведомления = УИД;
			//	ЗаписьОчереди.Записать(); 
			//#КонецЕсли
		КонецЕсли;
		
	ИначеЕсли ТипДействия = Перечисления.ТипыДействийПриНапоминании.ПродолжениеБрониТовара Тогда	
		
		Если Не Данные.Свойство("Характеристика") Тогда
			Возврат;
		КонецЕсли;	
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗапланированыеУведомления.УИД_Уведомления КАК УИД_Уведомления
		|ИЗ
		|	РегистрСведений.ЗапланированыеУведомления КАК ЗапланированыеУведомления
		|ГДЕ
		|	ЗапланированыеУведомления.ОбъектУведомления.ХарактеристикаДляДействий = &ХарактеристикаДляДействий
		|	И ЗапланированыеУведомления.ОбъектУведомления.ТипДействяПриНапоминании = &ТипДействяПриНапоминании
		|	И ЗапланированыеУведомления.Выполнено = ЛОЖЬ";
		
		Запрос.УстановитьПараметр("ХарактеристикаДляДействий", Данные.Характеристика);
		Запрос.УстановитьПараметр("ТипДействяПриНапоминании", Перечисления.ТипыДействийПриНапоминании.ПродолжениеБрониТовара);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать(); 
		
		Если ВыборкаДетальныеЗаписи.Количество() = 0 Тогда
			мОбъект = Справочники.Нагадування.СоздатьЭлемент();
			НагадуванняТекст = "По артикулу " + Строка(Данные.Характеристика.Владелец.Артикул) + " мішку " +  Строка(Данные.Характеристика) + " для контрагента " + Строка(Данные.Контрагент) + " була знята бронь. Перенести бронь?";
			ДатаНагадування = ТекущаяДата() + 60;
			мОбъект.Нагадування = НагадуванняТекст; 
			мОбъект.Наименование = "Нагадування!";
			мОбъект.Періодичність = Перечисления.Періоди.НеПовторювати;
			мОбъект.ДатаНапоминания = ДатаНагадування;
			мОбъект.Активне = Истина;
			мОбъект.КонтрагентДляДействий = Данные.Контрагент;
			мОбъект.ХарактеристикаДляДействий = Данные.Характеристика;
			мОбъект.ТипДействяПриНапоминании = Перечисления.ТипыДействийПриНапоминании.ПродолжениеБрониТовара;
			
			мОбъект.ДеньНедели = ДеньНедели(ТекущаяДата());
			мОбъект.Записать();
			Напоминание = мОбъект.Ссылка;
			
			УИД = Новый УникальныйИдентификатор; 
			
			ДанныеУведомления = Новый Структура;;
			ДанныеУведомления.Вставить("Заголовок", "Нагадування!");
			ДанныеУведомления.Вставить("Текст", НагадуванняТекст);
			ДанныеУведомления.Вставить("Данные"); 
			
			ДанныеУведомления["Данные"] = Новый Соответствие;
			ДанныеУведомления["Данные"]["Действие"] = "Напоминание";
			ДанныеУведомления["Данные"]["Дата"] = ДатаНагадування;
			ДанныеУведомления["Данные"]["УИД_Уведомления"] = Строка(УИД); 
			ДанныеУведомления["Данные"]["УИД_Напоминание"] = Строка(Напоминание.УникальныйИдентификатор()); 
			
			Общий.ЗапланироватьУведомление(ДанныеУведомления, Ложь, УИД, ДатаНагадування, Напоминание); 
			
			//#Если МобильноеПриложениеСервер Тогда
			//	ЗаписьОчереди = РегистрыСведений.ОчередьЛокальныхУведомлений.СоздатьМенеджерЗаписи();
			//	ЗаписьОчереди.УИД_Уведомления = УИД;
			//	ЗаписьОчереди.Записать();
			//#КонецЕсли    
			
		КонецЕсли;

	КонецЕсли;
	
КонецПроцедуры	

&НаСервере
Функция ПолучитьДатуДляУведомления(Дата) Экспорт
	Возврат Дата  + (ТекущаяУниверсальнаяДата() - ТекущаяДата()); 		
КонецФункции

&НаСервере
Функция ОбъектБДСуществует(ТестоваяСсылка) Экспорт    
	МД = Метаданные.НайтиПоТипу(ТипЗнч(ТестоваяСсылка));     
	ИмяОбъекта = МД.Имя;      
	ПолноеИмяОбъекта = МД.ПолноеИмя();        
	Запрос = новый Запрос();      
	Запрос.Текст =      "ВЫБРАТЬ      
	|   " + ИмяОбъекта + ".Ссылка КАК СсылкаБД      
	|ИЗ      
	|   " + ПолноеИмяОбъекта + " КАК " + ИмяОбъекта + "      
	|ГДЕ      
	|   " + ИмяОбъекта + ".Ссылка = &Cсылка";      
	Запрос.УстановитьПараметр("Cсылка", ТестоваяСсылка);      
	РезультатЗапроса = Запрос.Выполнить();        
	Возврат Не РезультатЗапроса.Пустой();    
КонецФункции

&НаСервере
Процедура ЗагрузитьОчередьНапоминанийСДействием() Экспорт
	Ответ = Новый Структура;
	Ответ.Вставить("Успех", Истина);
	
	Пароль = Константы.ПарольВхода.Получить();
	ПараметрыКоманды = Новый Структура;
	
	Данные = Новый Структура;
	Данные.Вставить("Команда", "ПолучитьОчередьНапоминанийСДействием");
	Данные.Вставить("Параметры", ПараметрыКоманды);
	
	Попытка 
		Прокси = СоединениеСБазой.ПолучитьПрокси();
		СтруктураОтветаПоОтчету = Прокси.ВыполнитьКоманду(Пароль, Обмен_УправлениеОбменом.Сериализовать(Данные)).Получить();
	Исключение
		СтруктураОтветаПоОтчету = Новый Структура;
		СтруктураОтветаПоОтчету.Вставить("Успешно", Ложь);
		СтруктураОтветаПоОтчету.Вставить("Ошибка", ОписаниеОшибки());
	КонецПопытки;

	Если Не СтруктураОтветаПоОтчету.Успешно Тогда
		Ответ.Вставить("Успешно",Ложь);
		Ответ.Вставить("Ошибка", СтруктураОтветаПоОтчету.Ошибка);
		Возврат;
	КонецЕсли;
	
	//ТЗОчередьНапоминанийСДействием = СтруктураОтветаПоОтчету.Данные;		
	СтруктураОтвета = СтруктураОтветаПоОтчету.Данные;		
	ТЗОчередьНапоминанийСДействием = СтруктураОтвета.ТЗОчереди;
	ТЗХарактеристик = СтруктураОтвета.ТЗХарактеристик;
	
	Для Каждого стрТЗХарактеристик ИЗ ТЗХарактеристик Цикл
		Характеристика = Справочники.ХарактеристикиНоменклатуры.ПолучитьСсылку(стрТЗХарактеристик.УИДСсылка);
		Если Общий.ОбъектБДСуществует(Характеристика) Тогда
			Если Характеристика.Залишок = стрТЗХарактеристик.Залишок 
				И Характеристика.Описание = стрТЗХарактеристик.Описание
				И Характеристика.ПериодБрони = стрТЗХарактеристик.ПериодБрони
				И Характеристика.СсылкаНаYouTube = стрТЗХарактеристик.СсылкаНаYouTube
				И Характеристика.Контрагент = Справочники.Контрагенты.ПолучитьСсылку(стрТЗХарактеристик.УИДКонтрагент)
				Тогда
				Продолжить;
			КонецЕсли;
			ХарактеристикаОбъект = Характеристика.ПолучитьОбъект();
			ХарактеристикаОбъект.Залишок = стрТЗХарактеристик.Залишок;
			ХарактеристикаОбъект.Описание = стрТЗХарактеристик.Описание;
			ХарактеристикаОбъект.ПериодБрони = стрТЗХарактеристик.ПериодБрони;
			ХарактеристикаОбъект.СсылкаНаYouTube = стрТЗХарактеристик.СсылкаНаYouTube;
			ХарактеристикаОбъект.Контрагент = Справочники.Контрагенты.ПолучитьСсылку(стрТЗХарактеристик.УИДКонтрагент);			
			ХарактеристикаОбъект.Записать();
		КонецЕсли;
	КонецЦикла;	
	
	Для Каждого стрОчереди Из ТЗОчередьНапоминанийСДействием Цикл
		Контрагент = Справочники.Контрагенты.ПолучитьСсылку(стрОчереди.УИДКонтрагентДляДействий);
		Характеристика = Справочники.ХарактеристикиНоменклатуры.ПолучитьСсылку(стрОчереди.УИДХарактеристикаДляДействий);
		ТипДействия = Перечисления.ТипыДействийПриНапоминании[стрОчереди.ИмяТипДействяПриНапоминании];
		
		Если Общий.ОбъектБДСуществует(Характеристика) И Общий.ОбъектБДСуществует(Контрагент) Тогда
			Данные = Новый Структура;
			Данные.Вставить("Характеристика", Характеристика); 
			Данные.Вставить("Контрагент", Контрагент); 
			
			Если ТипДействия = Перечисления.ТипыДействийПриНапоминании.ОтправкаСообщенияВайберОВидео Тогда	
				
				Общий.СоздатьНапоминаниеСДействием(Перечисления.ТипыДействийПриНапоминании.ОтправкаСообщенияВайберОВидео, Данные);			 	 					
				
				
				Запрос = Новый Запрос;
				Запрос.Текст = 
				"ВЫБРАТЬ
				|	Напоминание.Ссылка КАК Напоминание
				|ИЗ
				|	Справочник.Нагадування КАК Напоминание
				|ГДЕ
				|	Напоминание.НоменклатураВидео = &Номенклатура
				|	И Напоминание.КонтрагентВидео = &Контрагент
				|	И Напоминание.ЗаказВидео = ИСТИНА
				|	И Напоминание.Активне = ИСТИНА";
				
				
				Запрос.УстановитьПараметр("Контрагент", Контрагент);
				Запрос.УстановитьПараметр("Номенклатура", Характеристика.Владелец);
				
				РезультатЗапроса = Запрос.Выполнить();
				
				ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
				
				Если ВыборкаДетальныеЗаписи.Следующий() Тогда
					Напоминание = ВыборкаДетальныеЗаписи.Напоминание;
					
					Запрос = Новый Запрос;
					Запрос.Текст = 
					"ВЫБРАТЬ
					|	ЗапланированыеУведомления.УИД_Уведомления КАК УИД_Уведомления
					|ИЗ
					|	РегистрСведений.ЗапланированыеУведомления КАК ЗапланированыеУведомления
					|ГДЕ
					|	ЗапланированыеУведомления.ОбъектУведомления = &ОбъектУведомления
					|	И ЗапланированыеУведомления.Выполнено = ЛОЖЬ";
					
					Запрос.УстановитьПараметр("ОбъектУведомления", Напоминание);
					
					РезультатЗапроса = Запрос.Выполнить();
					
					ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
					
					Если ВыборкаДетальныеЗаписи.Следующий() Тогда
						Набор = РегистрыСведений.ЗапланированыеУведомления.СоздатьНаборЗаписей();
						Набор.Отбор.УИД_Уведомления.Установить(ВыборкаДетальныеЗаписи.УИД_Уведомления);
						Набор.Прочитать();
						
						Если Набор.Количество() Тогда 
							Набор[0].Выполнено = Истина;
							Набор.Записать();
						КонецЕсли;
						
					КонецЕсли;	
					
					Если Напоминание.Періодичність = Перечисления.Періоди.НеПовторювати Тогда 
						Об = Напоминание.ПолучитьОбъект();
						Об.Активне = Ложь;
						об.Записать();
					КонецЕсли; 					
					
				КонецЕсли;  				
			КонецЕсли;   
			
			Если ТипДействия = Перечисления.ТипыДействийПриНапоминании.ПродолжениеБрониТовара Тогда	
				Общий.СоздатьНапоминаниеСДействием(Перечисления.ТипыДействийПриНапоминании.ПродолжениеБрониТовара, Данные);			 	 					
			КонецЕсли;	

		КонецЕсли;
		
		Если Общий.ОбъектБДСуществует(Контрагент) Тогда
			Если ТипДействия = Перечисления.ТипыДействийПриНапоминании.ЗакрытиеСтарыхЗаказов Тогда	
				Данные = Новый Структура;
				Данные.Вставить("Характеристика", Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка()); 
				Данные.Вставить("Контрагент", Контрагент); 
				Данные.Вставить("АвтоматическоеЗакрытиеЗаказа", Истина); 
				Общий.СоздатьНапоминаниеСДействием(Перечисления.ТипыДействийПриНапоминании.ЗакрытиеСтарыхЗаказов, Данные);			 	 					
			КонецЕсли;	
		КонецЕсли;	
		
	КонецЦикла;	
КонецПроцедуры	


&НаСервере
Процедура ПоискАктуальныхЗаказов(Контрагент, Ответ) Экспорт 
	
	Ответ = Новый Структура;
	Ответ.Вставить("Успех", Истина);
	
	Пароль = Константы.ПарольВхода.Получить();
	Параметры = Новый Структура;
	Параметры.Вставить("Контрагент", Контрагент.УникальныйИдентификатор());
	
	
	Данные = Новый Структура;
	Данные.Вставить("Команда", "ПолучитьАктуальныеЗаказы");
	Данные.Вставить("Параметры", Параметры);
	
	Попытка 
		Прокси = СоединениеСБазой.ПолучитьПрокси();
		АктуальныеЗаказы = Прокси.ВыполнитьКоманду(Пароль, Обмен_УправлениеОбменом.Сериализовать(Данные)).Получить();
	Исключение
		АктуальныеЗаказы = Новый Структура;
		АктуальныеЗаказы.Вставить("Успешно", Ложь);
		АктуальныеЗаказы.Вставить("Ошибка", ОписаниеОшибки());
	КонецПопытки;

	Если Не АктуальныеЗаказы.Успешно Тогда
		Ответ.Вставить("Успешно",Ложь);
		Ответ.Вставить("Ошибка", АктуальныеЗаказы.Ошибка);
		Возврат;
	КонецЕсли;
	
	
	Если АктуальныеЗаказы.данные.Количество() Тогда
		Ответ.Вставить("Предупреждение", "У клієнта є актуальні замовлення");
		Заказ = Документы.Заказ.ПолучитьСсылку(АктуальныеЗаказы.Данные[0].УИДЗаказ);
		Если ПустаяСтрока(Заказ.ВерсияДанных) Тогда 
			Ответ.Вставить("ОткрытьЗакрытиеЗаказа", Истина);
		Иначе
			Ответ.Вставить("Заказ", Заказ);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗанестиВИсториюКлиентовСообщиеняПоДокументамПриОбмене(Знач ТаблицаИД) Экспорт
	
	Попытка
		
		СписокИД = Новый СписокЗначений;
		Для Каждого Строка Из ТаблицаИД Цикл
			СписокИД.Добавить(Строка.ИД);
		КонецЦикла;	
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	РегистрацияОбмена.Объект КАК Объект
		|ИЗ
		|	РегистрСведений.РегистрацияОбмена КАК РегистрацияОбмена
		|ГДЕ
		|	РегистрацияОбмена.ИД В(&СписокИД)";
		
		Запрос.УстановитьПараметр("СписокИД", СписокИД);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			ДокументДляИстории = ВыборкаДетальныеЗаписи.Объект;
			
			Если ТипЗнч(ДокументДляИстории) = Тип("ДокументСсылка.Заказ")  Тогда
				Заказ = ДокументДляИстории;
				Если Не ДокументДляИстории.ОтраженВИсторииКлиента Тогда
					ЗаказОбъект = Заказ.ПолучитьОбъект();
					
					Телефон="";
					
					СЗ = Новый СписокЗначений();
					НомерТелефона = ЗаказОбъект.Контрагент.НомерТелефона;
					Если Не ПустаяСтрока(НомерТелефона) Тогда 
						Для Н=1 по СтрЧислоСтрок(НомерТелефона) Цикл
							СЗ.Добавить(СтрПолучитьСтроку(НомерТелефона, Н));
						КонецЦикла;
					КонецЕсли;
					
					Если СЗ.Количество() > 0 Тогда
						Телефон = СЗ[0].Значение;
					КонецЕсли;	
					
					//ТекстИстории = Общий.ПолучитьТекстСообщенияВайбер(ЗаказОбъект, Ложь, Телефон);				
					
					Контрагент = ЗаказОбъект.Контрагент;
					
					//Сума = 0;
					ДоставкаТекст = "";
					Если ЗаказОбъект.Доставка = Перечисления.НаявністьДоставки.Почта Тогда 
						ДоставкаТекст = "Відділення пошти № " + ЗаказОбъект.НомерВідділенняНП;
					ИначеЕсли ЗаказОбъект.Доставка = Перечисления.НаявністьДоставки.Самовывоз Тогда
						ДоставкаТекст = "Самовивіз";
					ИначеЕсли ЗаказОбъект.Доставка = Перечисления.НаявністьДоставки.Доставка Тогда
						ДоставкаТекст = "Адресна доставка
						|" + ЗаказОбъект.Контрагент.Адреса;						
					КонецЕсли;
					
					Сообщение = "Замовлення  
					|
					|" + Контрагент.Наименование + "
					|" + Контрагент.Область.Наименование + "
					|" + Контрагент.Город.Наименование +"
					|" + Телефон;
					
					//	КонецЕсли;
					Если ЗначениеЗаполнено(Сообщение) Или ЗначениеЗаполнено(ДоставкаТекст) Тогда 
						Сообщение = Сообщение + "
						|" + ДоставкаТекст +  "
						|";
					КонецЕсли;
					//Если ЗРеализации Тогда
					/////////Перелік товарів//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////	
					Для Каждого Элемент Из ЗаказОбъект.Товары Цикл 
						Вес = Элемент.ХарактеристикаНоменклатуры.Вага;
						Если Вес = 0 Тогда 
							Попытка
								Вес = Число(Строка(Элемент.ХарактеристикаНоменклатуры));
							Исключение
								Вес = 20;
							КонецПопытки;
						КонецЕсли;
						
						//Если ДляКлиента Тогда
						//	Сообщение  = Сообщение + "
						//	|[" + Элемент.Номенклатура.Наименование + "] " 
						//	+ Элемент.Количество * Вес + "х" + Элемент.ЦенаПродажиВес + " = " + Элемент.Сума;
						//Иначе
						Сообщение  = Сообщение + "
						|[" + Элемент.Номенклатура.Артикул + "] " 
						+ Элемент.Количество * Вес + "х" + Элемент.ЦенаПродажиВес + " = " + Элемент.Сума;
						
						//КонецЕсли;
					КонецЦикла;
					//КонецЕсли;
					
					//Суми////////////////////////////////////////////////////////////////////////////////////////////////////
					
					//Оплаты = ПолучитьДанныеПоОплате(ЗаказОбъект);
					Если ЗначениеЗаполнено(Сообщение)  Тогда  
						Сообщение = Сообщение + "
						|";
					КонецЕсли;
					//Если ЗРеализации Тогда
					Сообщение = Сообщение + "
					|Загальна сума: " + ЗаказОбъект.Сума + " €";
					//|Загальна сума: *" + Оплаты.Курс.EUR * ЗаказОбъект.Сума + " грн*"	;
					//КонецЕсли;
					
					Менеджер = РегистрыСведений.РаботаСКлиентом.СоздатьМенеджерЗаписи();
					Менеджер.Период = ТекущаяДата();
					Менеджер.Клиент = ЗаказОбъект.Контрагент;
					Менеджер.Запись = Сообщение;
					Менеджер.УИД_Записи = Новый УникальныйИдентификатор;
					Менеджер.АвтоматичнийЗаписБезВзаємодіїЗКлієнтом = Ложь;
					Менеджер.Записать();
					Общий.ОбновитьПоследнююРаботуСКлиентом(ЗаказОбъект.Контрагент);
					
					ЗаказОбъект.ОтраженВИсторииКлиента = Истина;
					ЗаказОбъект.Записать(РежимЗаписиДокумента.Запись);
				КонецЕсли;	
			КонецЕсли;
			
			Если ТипЗнч(ДокументДляИстории) = Тип("ДокументСсылка.РеализацияТоваровУслуг")  Тогда	
				Реализация = ДокументДляИстории;
				Если Не Реализация.ОтраженВИсторииКлиента Тогда
					РеализацияОбъект = Реализация.ПолучитьОбъект();
					
					Телефон="";
					
					СЗ = Новый СписокЗначений();
					НомерТелефона = РеализацияОбъект.Контрагент.НомерТелефона;
					Если Не ПустаяСтрока(НомерТелефона) Тогда 
						Для Н=1 по СтрЧислоСтрок(НомерТелефона) Цикл
							СЗ.Добавить(СтрПолучитьСтроку(НомерТелефона, Н));
						КонецЦикла;
					КонецЕсли;
					
					Если СЗ.Количество() > 0 Тогда
						Телефон = СЗ[0].Значение;
					КонецЕсли;	
					
					Сообщение = "Реалізація" + Символы.ПС + Символы.ВК + Символы.ПС + Символы.ВК;
					Сообщение = Сообщение + Общий.ПолучитьТекстСообщенияВайбер(РеализацияОбъект, Ложь, Телефон);							
					
					
					//Контрагент = РеализацияОбъект.Контрагент;
					//
					//Сума = 0;
					//ДоставкаТекст = "";
					//Если РеализацияОбъект.Доставка = Перечисления.НаявністьДоставки.Почта Тогда 
					//	ДоставкаТекст = "Відділення пошти № " + РеализацияОбъект.НомерВідділенняНП;
					//ИначеЕсли РеализацияОбъект.Доставка = Перечисления.НаявністьДоставки.Самовывоз Тогда
					//	ДоставкаТекст = "Самовивіз";
					//ИначеЕсли РеализацияОбъект.Доставка = Перечисления.НаявністьДоставки.Доставка Тогда
					//	ДоставкаТекст = "Адресна доставка
					//	|" + РеализацияОбъект.Контрагент.Адреса;						
					//КонецЕсли;
					//
					//Сообщение = "Реалізація  
					//|
					//|" + Контрагент.Наименование + "
					//|" + Контрагент.Область.Наименование + "
					//|" + Контрагент.Город.Наименование +"
					//|" + Телефон;
					//
					////	КонецЕсли;
					//Если ЗначениеЗаполнено(Сообщение) Или ЗначениеЗаполнено(ДоставкаТекст) Тогда 
					//	Сообщение = Сообщение + "
					//	|" + ДоставкаТекст +  "
					//	|";
					//КонецЕсли;
					////Если ЗРеализации Тогда
					///////////Перелік товарів//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////	
					//Для Каждого Элемент Из РеализацияОбъект.Товары Цикл 
					//	Вес = Элемент.ХарактеристикаНоменклатуры.Вага;
					//	Если Вес = 0 Тогда 
					//		Попытка
					//			Вес = Число(Строка(Элемент.ХарактеристикаНоменклатуры));
					//		Исключение
					//			Вес = 20;
					//		КонецПопытки;
					//	КонецЕсли;
					//	
					//	//Если ДляКлиента Тогда
					//	//	Сообщение  = Сообщение + "
					//	//	|[" + Элемент.Номенклатура.Наименование + "] " 
					//	//	+ Элемент.Количество * Вес + "х" + Элемент.ЦенаПродажиВес + " = " + Элемент.Сума;
					//	//Иначе
					//	Сообщение  = Сообщение + "
					//	|[" + Элемент.Номенклатура.Артикул + "] " 
					//	+ Элемент.Количество * Вес + "х" + Элемент.ЦенаПродажиВес + " = " + Элемент.Сума;
					//	
					//	//КонецЕсли;
					//КонецЦикла;
					////КонецЕсли;
					//
					////Суми////////////////////////////////////////////////////////////////////////////////////////////////////
					//
					//Оплаты = ПолучитьДанныеПоОплате(РеализацияОбъект);
					//Если ЗначениеЗаполнено(Сообщение)  Тогда  
					//	Сообщение = Сообщение + "
					//	|";
					//КонецЕсли;
					////Если ЗРеализации Тогда
					//Сообщение = Сообщение + "
					//|Загальна сума: " + РеализацияОбъект.Сума + " €
					//|Загальна сума: *" + Оплаты.Курс.EUR * РеализацияОбъект.Сума + " грн*"	;
					////КонецЕсли;  
					//
					//
					//Если Оплаты.СуммаУчета > 0 Тогда
					//	ОплаченоСума = Оплаты.СуммаУчета;
					//	Если ОплаченоСума > Сума Тогда 
					//		ОплаченоСума = Сума;
					//	КонецЕсли;
					//	
					//	
					//	
					//	Сообщение = Сообщение +  "
					//	|Оплачено " +  Оплаты.СуммаУчета + " €" + "
					//	|Фактична оплата:"; 
					//	Для  Каждого СумаОплаты Из Оплаты.Суммы Цикл 
					//		Сообщение = Сообщение + ?(ЗначениеЗаполнено(СумаОплаты.Значение), " 
					//		|" + СумаОплаты.Значение + " " + СумаОплаты.Ключ, "");  
					//	КонецЦикла;
					//	
					//	Если Оплаты.Здача.EUR <> 0 ИЛИ Оплаты.Здача.UAH <> 0 ИЛИ Оплаты.Здача.USD <> 0 Тогда 
					//		СообщениеРешта = ""; 
					//		Для  Каждого СумаЗдача Из Оплаты.Здача Цикл 
					//			СообщениеРешта = СообщениеРешта + ?(ЗначениеЗаполнено(СумаЗдача.Значение), " 
					//			|" + СумаЗдача.Значение + " " + СумаЗдача.Ключ, "");  
					//		КонецЦикла;
					//		Если НЕ ПустаяСтрока(СообщениеРешта) Тогда 
					//			Сообщение = Сообщение +  "
					//			|Фактична решта: " + СообщениеРешта; 
					//		КонецЕсли;
					//		
					//		
					//	КонецЕсли;
					//	
					//	
					//КонецЕсли;				
					
					
					
					Менеджер = РегистрыСведений.РаботаСКлиентом.СоздатьМенеджерЗаписи();
					Менеджер.Период = ТекущаяДата();
					Менеджер.Клиент = РеализацияОбъект.Контрагент;
					Менеджер.Запись = Сообщение;
					Менеджер.УИД_Записи = Новый УникальныйИдентификатор;
					Менеджер.АвтоматичнийЗаписБезВзаємодіїЗКлієнтом = Ложь;
					Менеджер.Записать();
					Общий.ОбновитьПоследнююРаботуСКлиентом(РеализацияОбъект.Контрагент);
					
					РеализацияОбъект.ОтраженВИсторииКлиента = Истина;
					РеализацияОбъект.Записать(РежимЗаписиДокумента.Запись);
				КонецЕсли;	
			КонецЕсли;	
			
			
			Если ТипЗнч(ДокументДляИстории) = Тип("ДокументСсылка.КассовыйОрдер")  Тогда 	
				
				Оплата = ДокументДляИстории;
				Если Не Оплата.ОтраженВИсторииКлиента Тогда
					ОплатаОбъект = Оплата.ПолучитьОбъект();
					
					Телефон="";
					
					СЗ = Новый СписокЗначений();
					НомерТелефона = ОплатаОбъект.Контрагент.НомерТелефона;
					Если Не ПустаяСтрока(НомерТелефона) Тогда 
						Для Н=1 по СтрЧислоСтрок(НомерТелефона) Цикл
							СЗ.Добавить(СтрПолучитьСтроку(НомерТелефона, Н));
						КонецЦикла;
					КонецЕсли;
					
					Если СЗ.Количество() > 0 Тогда
						Телефон = СЗ[0].Значение;
					КонецЕсли;	
					
					Сообщение = "Оплата" + Символы.ПС + Символы.ВК + Символы.ПС + Символы.ВК;				
					Сообщение = Сообщение + Общий.ПолучитьТекстСообщенияВайбер(ОплатаОбъект, Ложь, Телефон);				
					
					//Контрагент = РеализацияОбъект.Контрагент;
					//
					//Сума = 0;
					//ДоставкаТекст = "";
					//Если РеализацияОбъект.Доставка = Перечисления.НаявністьДоставки.Почта Тогда 
					//	ДоставкаТекст = "Відділення пошти № " + РеализацияОбъект.НомерВідділенняНП;
					//ИначеЕсли РеализацияОбъект.Доставка = Перечисления.НаявністьДоставки.Самовывоз Тогда
					//	ДоставкаТекст = "Самовивіз";
					//ИначеЕсли РеализацияОбъект.Доставка = Перечисления.НаявністьДоставки.Доставка Тогда
					//	ДоставкаТекст = "Адресна доставка
					//	|" + РеализацияОбъект.Контрагент.Адреса;						
					//КонецЕсли;
					//
					//Сообщение = "Реалізація  
					//|
					//|" + Контрагент.Наименование + "
					//|" + Контрагент.Область.Наименование + "
					//|" + Контрагент.Город.Наименование +"
					//|" + Телефон;
					//
					////	КонецЕсли;
					//Если ЗначениеЗаполнено(Сообщение) Или ЗначениеЗаполнено(ДоставкаТекст) Тогда 
					//	Сообщение = Сообщение + "
					//	|" + ДоставкаТекст +  "
					//	|";
					//КонецЕсли;
					////Если ЗРеализации Тогда
					///////////Перелік товарів//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////	
					//Для Каждого Элемент Из РеализацияОбъект.Товары Цикл 
					//	Вес = Элемент.ХарактеристикаНоменклатуры.Вага;
					//	Если Вес = 0 Тогда 
					//		Попытка
					//			Вес = Число(Строка(Элемент.ХарактеристикаНоменклатуры));
					//		Исключение
					//			Вес = 20;
					//		КонецПопытки;
					//	КонецЕсли;
					//	
					//	//Если ДляКлиента Тогда
					//	//	Сообщение  = Сообщение + "
					//	//	|[" + Элемент.Номенклатура.Наименование + "] " 
					//	//	+ Элемент.Количество * Вес + "х" + Элемент.ЦенаПродажиВес + " = " + Элемент.Сума;
					//	//Иначе
					//	Сообщение  = Сообщение + "
					//	|[" + Элемент.Номенклатура.Артикул + "] " 
					//	+ Элемент.Количество * Вес + "х" + Элемент.ЦенаПродажиВес + " = " + Элемент.Сума;
					//	
					//	//КонецЕсли;
					//КонецЦикла;
					////КонецЕсли;
					//
					////Суми////////////////////////////////////////////////////////////////////////////////////////////////////
					//
					//Оплаты = ПолучитьДанныеПоОплате(РеализацияОбъект);
					//Если ЗначениеЗаполнено(Сообщение)  Тогда  
					//	Сообщение = Сообщение + "
					//	|";
					//КонецЕсли;
					////Если ЗРеализации Тогда
					//Сообщение = Сообщение + "
					//|Загальна сума: " + РеализацияОбъект.Сума + " €
					//|Загальна сума: *" + Оплаты.Курс.EUR * РеализацияОбъект.Сума + " грн*"	;
					////КонецЕсли;  
					//
					//
					//Если Оплаты.СуммаУчета > 0 Тогда
					//	ОплаченоСума = Оплаты.СуммаУчета;
					//	Если ОплаченоСума > Сума Тогда 
					//		ОплаченоСума = Сума;
					//	КонецЕсли;
					//	
					//	
					//	
					//	Сообщение = Сообщение +  "
					//	|Оплачено " +  Оплаты.СуммаУчета + " €" + "
					//	|Фактична оплата:"; 
					//	Для  Каждого СумаОплаты Из Оплаты.Суммы Цикл 
					//		Сообщение = Сообщение + ?(ЗначениеЗаполнено(СумаОплаты.Значение), " 
					//		|" + СумаОплаты.Значение + " " + СумаОплаты.Ключ, "");  
					//	КонецЦикла;
					//	
					//	Если Оплаты.Здача.EUR <> 0 ИЛИ Оплаты.Здача.UAH <> 0 ИЛИ Оплаты.Здача.USD <> 0 Тогда 
					//		СообщениеРешта = ""; 
					//		Для  Каждого СумаЗдача Из Оплаты.Здача Цикл 
					//			СообщениеРешта = СообщениеРешта + ?(ЗначениеЗаполнено(СумаЗдача.Значение), " 
					//			|" + СумаЗдача.Значение + " " + СумаЗдача.Ключ, "");  
					//		КонецЦикла;
					//		Если НЕ ПустаяСтрока(СообщениеРешта) Тогда 
					//			Сообщение = Сообщение +  "
					//			|Фактична решта: " + СообщениеРешта; 
					//		КонецЕсли;
					//		
					//		
					//	КонецЕсли;
					//	
					//	
					//КонецЕсли;				
					
					
					
					Менеджер = РегистрыСведений.РаботаСКлиентом.СоздатьМенеджерЗаписи();
					Менеджер.Период = ТекущаяДата();
					Менеджер.Клиент = ОплатаОбъект.Контрагент;
					Менеджер.Запись = Сообщение;
					Менеджер.УИД_Записи = Новый УникальныйИдентификатор;
					Менеджер.АвтоматичнийЗаписБезВзаємодіїЗКлієнтом = Истина;
					Менеджер.Записать();
					Общий.ОбновитьПоследнююРаботуСКлиентом(ОплатаОбъект.Контрагент);
					
					
					ОплатаОбъект.ОтраженВИсторииКлиента = Истина;
					ОплатаОбъект.Записать(РежимЗаписиДокумента.Запись);
				КонецЕсли;	
				
			КонецЕсли;	
			
			
			
			Если ТипЗнч(ДокументДляИстории) = Тип("ДокументСсылка.Презентація")  Тогда	
				Презентація = ДокументДляИстории;
				Если Не Презентація.ОтраженВИсторииКлиента Тогда
					ПрезентаціяОбъект = Презентація.ПолучитьОбъект();
					
					Телефон="";
					
					СЗ = Новый СписокЗначений();
					НомерТелефона = ПрезентаціяОбъект.Контрагент.НомерТелефона;
					Если Не ПустаяСтрока(НомерТелефона) Тогда 
						Для Н=1 по СтрЧислоСтрок(НомерТелефона) Цикл
							СЗ.Добавить(СтрПолучитьСтроку(НомерТелефона, Н));
						КонецЦикла;
					КонецЕсли;
					
					Если СЗ.Количество() > 0 Тогда
						Телефон = СЗ[0].Значение;
					КонецЕсли;	
					
					Сообщение = Общий.ПолучитьТекстСообщенияВайберДляПрезентации(ПрезентаціяОбъект, Ложь, Телефон);							
					
										
					
					Менеджер = РегистрыСведений.РаботаСКлиентом.СоздатьМенеджерЗаписи();
					Менеджер.Период = ТекущаяДата();
					Менеджер.Клиент = ПрезентаціяОбъект.Контрагент;
					Менеджер.Запись = Сообщение;
					Менеджер.УИД_Записи = Новый УникальныйИдентификатор;
					Менеджер.АвтоматичнийЗаписБезВзаємодіїЗКлієнтом = Истина;
					Менеджер.Записать();
					Общий.ОбновитьПоследнююРаботуСКлиентом(ПрезентаціяОбъект.Контрагент);
					
					ПрезентаціяОбъект.ОтраженВИсторииКлиента = Истина;
					ПрезентаціяОбъект.Записать(РежимЗаписиДокумента.Запись);
				КонецЕсли;	
			КонецЕсли;		
			
			
			
			
			Если ТипЗнч(ДокументДляИстории) = Тип("ДокументСсылка.МаршрутныйЛист")  Тогда	
				
				МаршрутныйЛист = ДокументДляИстории;
				
				Для Каждого  СтрРеализации Из МаршрутныйЛист.Реализации Цикл
					
					Реализация = СтрРеализации.Реализация;
					Если Не Реализация.ОтраженВИсторииКлиента Тогда
						РеализацияОбъект = Реализация.ПолучитьОбъект();
						
						Телефон="";
						
						СЗ = Новый СписокЗначений();
						НомерТелефона = РеализацияОбъект.Контрагент.НомерТелефона;
						Если Не ПустаяСтрока(НомерТелефона) Тогда 
							Для Н=1 по СтрЧислоСтрок(НомерТелефона) Цикл
								СЗ.Добавить(СтрПолучитьСтроку(НомерТелефона, Н));
							КонецЦикла;
						КонецЕсли;
						
						Если СЗ.Количество() > 0 Тогда
							Телефон = СЗ[0].Значение;
						КонецЕсли;	
						
						Сообщение = "Реалізація" + Символы.ПС + Символы.ВК + Символы.ПС + Символы.ВК;
						Сообщение = Сообщение + Общий.ПолучитьТекстСообщенияВайбер(РеализацияОбъект, Ложь, Телефон);							
						
						Менеджер = РегистрыСведений.РаботаСКлиентом.СоздатьМенеджерЗаписи();
						Менеджер.Период = ТекущаяДата();
						Менеджер.Клиент = РеализацияОбъект.Контрагент;
						Менеджер.Запись = Сообщение;
						Менеджер.УИД_Записи = Новый УникальныйИдентификатор;
						Менеджер.АвтоматичнийЗаписБезВзаємодіїЗКлієнтом = Ложь;
						Менеджер.Записать();
						Общий.ОбновитьПоследнююРаботуСКлиентом(РеализацияОбъект.Контрагент);
						
						РеализацияОбъект.ОтраженВИсторииКлиента = Истина;
						РеализацияОбъект.Записать(РежимЗаписиДокумента.Запись);
					КонецЕсли;	
				КонецЦикла;
			КонецЕсли;				
			
			
			
			
			
		КонецЦикла;
		
	Исключение
	КонецПопытки;	
КонецПроцедуры	

&НаСервере
Процедура ЗаписатьИсториюРеализацийИзМаршрутного(ДокументДляИстории) Экспорт 
	
	Если ТипЗнч(ДокументДляИстории) = Тип("ДокументСсылка.МаршрутныйЛист")  Тогда	
		
		МаршрутныйЛист = ДокументДляИстории;
		
		Для Каждого  СтрРеализации Из МаршрутныйЛист.Реализации Цикл
			
			Реализация = СтрРеализации.Реализация;
			Если Не Реализация.ОтраженВИсторииКлиента Тогда
				РеализацияОбъект = Реализация.ПолучитьОбъект();
				
				Телефон="";
				
				СЗ = Новый СписокЗначений();
				НомерТелефона = РеализацияОбъект.Контрагент.НомерТелефона;
				Если Не ПустаяСтрока(НомерТелефона) Тогда 
					Для Н=1 по СтрЧислоСтрок(НомерТелефона) Цикл
						СЗ.Добавить(СтрПолучитьСтроку(НомерТелефона, Н));
					КонецЦикла;
				КонецЕсли;
				
				Если СЗ.Количество() > 0 Тогда
					Телефон = СЗ[0].Значение;
				КонецЕсли;	
				
				Сообщение = "Реалізація" + Символы.ПС + Символы.ВК + Символы.ПС + Символы.ВК;
				Сообщение = Сообщение + Общий.ПолучитьТекстСообщенияВайбер(РеализацияОбъект, Ложь, Телефон);							
				
				Менеджер = РегистрыСведений.РаботаСКлиентом.СоздатьМенеджерЗаписи();
				Менеджер.Период = ТекущаяДата();
				Менеджер.Клиент = РеализацияОбъект.Контрагент;
				Менеджер.Запись = Сообщение;
				Менеджер.УИД_Записи = Новый УникальныйИдентификатор;
				Менеджер.АвтоматичнийЗаписБезВзаємодіїЗКлієнтом = Ложь;
				Менеджер.Записать();
				Общий.ОбновитьПоследнююРаботуСКлиентом(РеализацияОбъект.Контрагент);

				
				РеализацияОбъект.ОтраженВИсторииКлиента = Истина;
				РеализацияОбъект.Записать(РежимЗаписиДокумента.Запись);
			КонецЕсли;	
		КонецЦикла;
	КонецЕсли;	
КонецПроцедуры		

&НаСервере
Функция ПолучитьСимволПоЮникоду(КодСимволаВДесятичномВиде) Экспорт
	
//	https://ru.wikipedia.org/wiki/UTF-16#%D0%9F%D1%80%D0%B8%D0%BD%D1%86%D0%B8%D0%BF_%D0%BA%D0%BE%D0%B4%D0%B8%D1%80%D0%BE%D0%B2%D0%B0%D0%BD%D0%B8%D1%8F

//В UTF-16 символы кодируются двухбайтовыми словами с использованием всех возможных диапазонов значений (от 0 до FFFF16). При этом можно кодировать символы Unicode в диапазонах 000016..D7FF16 и E00016..FFFF16. Исключенный отсюда диапазон D80016..DFFF16 используется как раз для кодирования так называемых суррогатных пар — символов, которые кодируются двумя 16-битными словами.

//Символы Unicode до FFFFh включительно (исключая диапазон для суррогатов) записываются как есть 16-битным словом.

//Символы же в диапазоне 10000h..10FFFFh (больше 16 бит) кодируются по следующей схеме:

//    Из кода символа вычитается 10000h. В результате получится значение от нуля до FFFFF16, которое помещается в разрядную сетку 20 бит.

//    Старшие 10 бит (число в диапазоне 0000h..03FFh) суммируются с D800h, и результат идёт в ведущее (первое) слово, которое входит в диапазон D800h..DBFFh.

//    Младшие 10 бит (тоже число в диапазоне 0000h..03FFh) суммируются с DC00h, и результат идёт в последующее (второе) слово, которое входит в диапазон DC00h..DFFFh.


//ПРИКЛАД
//Исходный код символа
//Зеленый круг
//1F7E2

//Сначала вычитаем из него 10000h
//Получим 
//0F7E2

//Закидываем это на 20-битную сетку, получаем: 
//0000.1111.0111.1110.0010

//Разбиваем на две чиселки по 10 бит
//0000.1111.01
//11.1110.0010

//Переводим в хекс
//3D
//3E2

//Прибавляем к ним константы D800h и DC00h

//Получаэм
//D83D
//DFE2

//Переводим в десятичный
//55357
//57314


//Сообщить(Символ (55357) + Символ (57314)); 

	Если КодСимволаВДесятичномВиде <= 65536 Тогда
		Возврат Символ(КодСимволаВДесятичномВиде);
	КонецЕсли;	

    //Отнимем 1000h
	Константа1000h_ВДесятичномВиде = 65536;
	КодСимволаВДесятичномВиде = КодСимволаВДесятичномВиде - Константа1000h_ВДесятичномВиде;
	
	КодСимволаВДвоичновмВиде = ДесятичноеВДвоичное(КодСимволаВДесятичномВиде);

	Если СтрДлина(КодСимволаВДвоичновмВиде) > 20 Тогда
		Возврат "";
	КонецЕсли;	 
	
	Пока СтрДлина(КодСимволаВДвоичновмВиде) < 20 Цикл
		КодСимволаВДвоичновмВиде = "0" + КодСимволаВДвоичновмВиде;	
	КонецЦикла;	
	
	КодСимволаВДвоичновмВиде_Часть1 = Лев(КодСимволаВДвоичновмВиде, 10);
	КодСимволаВДвоичновмВиде_Часть2 = Прав(КодСимволаВДвоичновмВиде, 10);
	
	Константа_D800h_ВДесятичномВиде = 55296;
	Константа_DC00h_ВДесятичномВиде = 56320;  
	
	КодСимволаВДесятичномВиде_Часть1 = ДвоичноеВДесятичное(КодСимволаВДвоичновмВиде_Часть1);	
	КодСимволаВДесятичномВиде_Часть2 = ДвоичноеВДесятичное(КодСимволаВДвоичновмВиде_Часть2);	
	
	КодСимволаВДесятичномВиде_Часть1 = КодСимволаВДесятичномВиде_Часть1 + Константа_D800h_ВДесятичномВиде;
	КодСимволаВДесятичномВиде_Часть2 = КодСимволаВДесятичномВиде_Часть2 + Константа_DC00h_ВДесятичномВиде;
	
	Возврат Символ(КодСимволаВДесятичномВиде_Часть1) + Символ(КодСимволаВДесятичномВиде_Часть2);
	

КонецФункции   

&НаСервере
Функция ДесятичноеВДвоичное(Знач ИсхЧисло) Экспорт
    
    ДвоичныйКод = "";
    Пока ИсхЧисло <> 0 Цикл
        ДвоичныйКод = "" + ИсхЧисло%2 + ДвоичныйКод ;
        ИсхЧисло = Цел(ИсхЧисло/2);
	КонецЦикла;
	
    Возврат ДвоичныйКод;
    
КонецФункции

&НаСервере
Функция ДвоичноеВДесятичное(Знач Стр2) Экспорт
	
	Стр = СокрЛП(Стр2);
	Рез=0;
	
	Для н=1 по СтрДлина(Стр) Цикл
		Рез=Рез*2+Число(Сред(Стр,н,1));
	КонецЦикла;
	
	Возврат Рез;
	
КонецФункции  

Функция ПолучитьНеПросмотренныеНапоминания() Экспорт
		
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаУведомления", ТекущаяДата());
	
	Запрос.Текст = "ВЫБРАТЬ
	|	ЗапланированыеУведомления.УИД_Уведомления КАК УИД_Уведомления
	|ИЗ
	|	РегистрСведений.ЗапланированыеУведомления КАК ЗапланированыеУведомления
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ЗапланированыеУведомления.ДатаУведомления КАК ДатаУведомления,
	|			ЗапланированыеУведомления.ОбъектУведомления КАК ОбъектУведомления
	|		ИЗ
	|			РегистрСведений.ЗапланированыеУведомления КАК ЗапланированыеУведомления
	|		ГДЕ
	|			НЕ ЗапланированыеУведомления.Выполнено
	|			И НЕ ЗапланированыеУведомления.ОбъектУведомления.НагадатиПроТовар
	|			И ЗапланированыеУведомления.ДатаУведомления < &ДатаУведомления) КАК ВложенныйЗапрос
	|		ПО ЗапланированыеУведомления.ОбъектУведомления = ВложенныйЗапрос.ОбъектУведомления
	|			И ЗапланированыеУведомления.ДатаУведомления < ВложенныйЗапрос.ДатаУведомления
	|			И (НЕ ЗапланированыеУведомления.Выполнено)";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Массив = Новый Массив;
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Набор = РегистрыСведений.ЗапланированыеУведомления.СоздатьНаборЗаписей();
		Набор.Отбор.УИД_Уведомления.Установить(ВыборкаДетальныеЗаписи.УИД_Уведомления);
		Набор.Записать();
	КонецЦикла;
	
	
	
	Запрос.Текст = 	"ВЫБРАТЬ
	|	ЗапланированыеУведомления.УИД_Уведомления КАК УИД_Уведомления,
	|	ЗапланированыеУведомления.ДанныеУведомления КАК ДанныеУведомления
	|ИЗ
	|	РегистрСведений.ЗапланированыеУведомления КАК ЗапланированыеУведомления
	|ГДЕ
	|	НЕ ЗапланированыеУведомления.Выполнено
	|	И ЗапланированыеУведомления.ДатаУведомления < &ДатаУведомления
	|";
	
	
	
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Массив = Новый Массив;
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Уведомление = ВыборкаДетальныеЗаписи.ДанныеУведомления.Получить();
		ДанныеУведомления = Уведомление.Данные;
		ПараметрыФормы = Новый Структура("ТекстНагадування",  Уведомление.Текст);
		ПараметрыФормы.Вставить("ДатаНагадування",  ДанныеУведомления["Дата"]);
		ПараметрыФормы.Вставить("УИД_Уведомления",  ДанныеУведомления["УИД_Уведомления"]);
		ПараметрыФормы.Вставить("УИД_Напоминание", ДанныеУведомления["УИД_Напоминание"]); 
		ПараметрыФормы.Вставить("Ключ", ДанныеУведомления["УИД_Напоминание"]); 
		Если ДанныеУведомления["НапоминаниеОТоваре"] = "1" Тогда
			
			ПараметрыФормы.Вставить("УИД_Номенклатура", ДанныеУведомления["УИД_Номенклатуры"]);
			
		КонецЕсли;
		
		Массив.Добавить(ПараметрыФормы);
		
	КонецЦикла;

	Возврат Массив;
КонецФункции

&НаСервереБезКонтекста
Процедура ЗавершитьФоновиеЗаданияНаСервере() Экспорт
	МассивФоновихЗаданий = ФоновыеЗадания.ПолучитьФоновыеЗадания();
	Для Каждого фз Из МассивФоновихЗаданий Цикл 
		фз.Отменить();
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ОбновитьПоследнююРаботуСКлиентом(Контрагент) Экспорт 
	з = Новый Запрос;
	з.Текст = "ВЫБРАТЬ
	          |	РаботаСКлиентомСрезПоследних.Период КАК Период,
	          |	РаботаСКлиентомСрезПоследних.Запись КАК Запись
	          |ИЗ
	          |	РегистрСведений.РаботаСКлиентом.СрезПоследних(, Клиент = &Клиент) КАК РаботаСКлиентомСрезПоследних";
	з.УстановитьПараметр("Клиент", Контрагент);
	Виборка = з.Выполнить().Выбрать();
	
	контрОб = Контрагент.ПолучитьОбъект();
	ЕстьИзменения = Ложь;
	контрОб.мЭтоОбмен = Истина;
	
	Если Виборка.Следующий() Тогда 
		Если контрОб.РаботаСКлиентомПериод <>  Виборка.Период ИЛИ контрОб.РаботаСКлиентомЗапись <> Виборка.Запись Тогда 
			контрОб.РаботаСКлиентомПериод = Виборка.Период;
			контрОб.РаботаСКлиентомЗапись = Виборка.Запись;
			ЕстьИзменения = Истина;
		КонецЕсли;
	иначе
		Если контрОб.РаботаСКлиентомПериод <>  '00010101' ИЛИ контрОб.РаботаСКлиентомЗапись <> "" Тогда
			контрОб.РаботаСКлиентомПериод =  '00010101';
			контрОб.РаботаСКлиентомЗапись = "";
			ЕстьИзменения = Истина;
		КонецЕсли;
	КонецЕсли;
	Если ЕстьИзменения Тогда 
		контрОб.Записать();
	КонецЕсли;
	
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьЗаполненостьДаннихКонтрагентов() Экспорт
		з = Новый Запрос;
	з.Текст = "ВЫБРАТЬ
	          |	Контрагенты.Ссылка КАК Ссылка
	          |ИЗ
	          |	Справочник.Контрагенты КАК Контрагенты
	          |ГДЕ
	          |	Контрагенты.РаботаСКлиентомПериод <> ДАТАВРЕМЯ(1, 1, 1)";
	
	Если з.Выполнить().Выбрать().Количество() = 0 Тогда 
		з.Текст = "ВЫБРАТЬ
		          |	Контрагенты.Ссылка КАК Ссылка
		          |ИЗ
		          |	Справочник.Контрагенты КАК Контрагенты";
		Виборка = з.Выполнить().Выбрать();
		Пока Виборка.Следующий() Цикл	
			ОбновитьПоследнююРаботуСКлиентом(Виборка.Ссылка);
		КонецЦикла;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция  ПоискДублейНомеровТелефона_НаСервере1С(НомерТелефона, Контрагент, Пошук = Ложь) Экспорт
	
	ПараметрыКоманды = Новый Структура;
	ПараметрыКоманды.Вставить("НомерТелефона", НомерТелефона);
	ПараметрыКоманды.Вставить("Контрагент", Контрагент.УникальныйИдентификатор()); 
	ПараметрыКоманды.Вставить("Пошук", Пошук);  
	
	Данные = Новый Структура;
	Данные.Вставить("Команда", "ДублиКонтрагента");
	Данные.Вставить("Параметры", ПараметрыКоманды);
	Пароль = Константы.ПарольВхода.Получить();
	
	Попытка 
		Прокси = СоединениеСБазой.ПолучитьПрокси();
		Ответ = Прокси.ВыполнитьКоманду(Пароль, Обмен_УправлениеОбменом.Сериализовать(Данные)).Получить();
	Исключение
		Ответ = Новый Структура;
		Ответ.Вставить("Успешно", Ложь);
		Ответ.Вставить("Ошибка", ОписаниеОшибки());
	КонецПопытки;
	
	Возврат Ответ;	
	
КонецФункции

&НаСервере
Процедура ЗарегистрироватьИзмененияКонтрагента(Контрагент, НаименованиеСтар, НаименованиеНов, ДатаОновленняСтар, ДатаОновленняНов) Экспорт
	
	Если НаименованиеСтар = НаименованиеНов Тогда 
		Возврат
	КонецЕсли;
	
	
	
	нз = РегистрыСведений.РегистрацияИзмененияКонтрагента.СоздатьНаборЗаписей();
	нз.Отбор.Контрагент.Установить(Контрагент);
	ТекД = ТекущаяДата();
	нз.Отбор.Период.Установить(ТекД);
	з = нз.Добавить();
	з.Контрагент = Контрагент;
	з.Период =  ТекД;
	з.НаименованиеСтар = НаименованиеСтар;
	з.НаименованиеНов = НаименованиеНов;
	з.ДатаОновленняСтар = ДатаОновленняСтар;
	з.ДатаОновленняНов = ДатаОновленняНов;
	
	
	ПоследнееМестоВызова = "";
	Попытка
		Ошибка = 1 / 0;
	Исключение
		ПоследнееМестоВызова	= ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		//Отсекаем лишний текст
		ПоследнееМестоВызова	= СтрЗаменить(ПоследнееМестоВызова, "Деление на 0", "");
		ПоследнееМестоВызова	= СтрЗаменить(ПоследнееМестоВызова, "Ділення на 0", "");
		ПоследнееМестоВызова	= Сред(ПоследнееМестоВызова, Найти(ПоследнееМестоВызова, ")}:ДобавитьИнформациюСозданияЭлемента(Источник);"), СтрДлина(ПоследнееМестоВызова));		
		ПоследнееМестоВызова	= СокрЛП(СтрЗаменить(ПоследнееМестоВызова, ")}:ДобавитьИнформациюСозданияЭлемента(Источник);", ""));
		
	
		
	КонецПопытки;	
	
	з.Инфо = ПоследнееМестоВызова;
	
	
	
	нз.Записать();
	
КонецПроцедуры




