
&НаСервере
Процедура КомандаОкНаСервере()
	Константы.ПарольВхода.Установить(Пароль);
	Константы.ОновлюватиЗалишкиПриВиборі.Установить(ОновлюватиЗалишкиПриПідборі);
	Константы.АвтоматичнийОбмінКурсВалют.Установить(Автообмін);
	Константы.ПідбірВПачкахШтуках.Установить(ПідбірВПачкахШтуках);
	Константы.ЛокальнеЗєднання.Установить(ЛокальнеЗєднання);
	Константы.АвтоматичнеВечірнєСкиданняДокументів.Установить(ВечірнєСкидання);
	Константы.ЧасСкиданняЗамовлень.Установить(ЧасОбміну);

КонецПроцедуры

&НаКлиенте
Процедура КомандаОк(Команда)
	КомандаОкНаСервере();
	Записать();
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПриОткрытииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриОткрытииНаСервере()
	Пароль = Константы.ПарольВхода.Получить();
	ОновлюватиЗалишкиПриПідборі = Константы.ОновлюватиЗалишкиПриВиборі.Получить();
	Автообмін = Константы.АвтоматичнийОбмінКурсВалют.Получить();
	ПідбірВПачкахШтуках = Константы.ПідбірВПачкахШтуках.Получить();
	ЛокальнеЗєднання = Константы.ЛокальнеЗєднання.Получить();
	ВечірнєСкидання = Константы.АвтоматичнеВечірнєСкиданняДокументів.Получить();
	ЧасОбміну = Константы.ЧасСкиданняЗамовлень.Получить();

КонецПроцедуры
