Перем мЭтоОбмен Экспорт;



Процедура ПриЗаписи(Отказ)
	//Если мЭтоОбмен <> Истина И ВивантажуватиВ1С Тогда 
	//	Общий.ЗарегистрироватьИзменения(ЭтотОбъект.Ссылка);		
	//КонецЕсли;
	//Если Не ВивантажуватиВ1С Тогда 
	//	НаборЗаписей = РегистрыСведений.РегистрацияОбмена.СоздатьНаборЗаписей();
	//	НаборЗаписей.Отбор.Объект.Установить(Ссылка);
	//	НаборЗаписей.Записать();
	//КонецЕсли;   
	
	Если мЭтоОбмен <> Истина  Тогда 
		Общий.ЗарегистрироватьИзменения(ЭтотОбъект.Ссылка);		
	КонецЕсли;

КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если Не Архив Тогда 
		Архив = ЭтотОбъект.ПометкаУдаления;
	КонецЕсли;
КонецПроцедуры

мЭтоОбмен = Ложь;

