
Перем ИдентификаторФоновогоЗадания Экспорт;

&НаКлиенте
Перем ДатаУведомления Экспорт; 

&НаКлиенте
Перем МассивОткрытыхОконНапоминаний Экспорт;

Процедура ПередНачаломРаботыСистемы(Отказ)
	
	УправлениеПользователями.СоздатьПользователяНаСервере();
	Общий.УстановитьИдентификаторУстройства();
	

	
	МассивОткрытыхОконНапоминаний = Новый Массив;	
КонецПроцедуры

Процедура ПриНачалеРаботыСистемы()
	
	 //Обмен_УправлениеОбменом.Тест();
	 ДатаУведомления = ТекущаяДата();
	//ПодключитьОбработчикОжидания("Автообмен",1800);
	ПодключитьОбработчикОжидания("АвтообменКурсВалют",600);
	ПодключитьОбработчикОжидания("ВечірнійОбмін",1800);
	АвтообменКурсВалют();
	ВечірнійОбмін();
	ПодключитьОбработчикОжидания("ПолучениеСообщенийВайбер", 3600);

	
	
	#Если МобильноеПриложениеКлиент Тогда
		
		ДоставляемыеУведомления.ПодключитьОбработчикУведомлений("ПриПолученииУведомления");
		
	#Иначе
		
		ПодключитьОбработчикОжидания("ПолучитьУведомления",61);
		
	#КонецЕсли
	
КонецПроцедуры
 
Процедура Автообмен() Экспорт
	Если Общий.АвтообмінВключений() Тогда
		Общий.ВиконатиФоновийОбмін();
				//Обмен_УправлениеОбменом.ВыполнитьОбменДанными();
		//УстановитьЗаголовокПриложения("Автообмін: "+ТекущаяДата());
	КонецЕсли;	
КонецПроцедуры

Процедура АвтообменКурсВалют() Экспорт
	Если Общий.АвтообмінКурсВалют() Тогда
		Общий.ВиконатиФоновийОбмінВалют();
	КонецЕсли;	
КонецПроцедуры

Процедура ВечірнійОбмін() Экспорт
	
	ДатаПочаткуОбміну = НачалоДня(ТекущаяДата()) + (Общий.ПолучитьЗначениеКонстанты("ЧасСкиданняЗамовлень") - '00010101');
	
	Если ТекущаяДата() > ДатаПочаткуОбміну И Общий.ПолучитьЗначениеКонстанты("АвтоматичнеВечірнєСкиданняДокументів") Тогда
		Общий.ВыполнитьФоновийОбменДаннымиВыгрузкаЗаказов();
	КонецЕсли;	
КонецПроцедуры

Процедура ПолучениеСообщенийВайбер()Экспорт
	
	ViberОбновлениеКлиент.ВыполнитьОбменСообщениями();
	
	
КонецПроцедуры	

Процедура ПриПолученииУведомления(Уведомление, Локальное, Показано) Экспорт 
	Попытка 
		ДанныеУведомления = Уведомление.Данные;
		//Сообщить(ДанныеУведомления);
		Если ТипЗнч(ДанныеУведомления) = Тип("Строка") Тогда 
			ДанныеУведомления = Общий.ПолучитьДанныеИзСтроки(ДанныеУведомления);
		КонецЕсли;
		
		
		Если ДанныеУведомления["Действие"] = "НовоеСообщение" Тогда 
			ОткрытьФорму("Обработка.Чат1с.Форма.Форма");
		ИначеЕсли ДанныеУведомления["Действие"] = "Напоминание" Тогда
			ПараметрыФормы = Новый Структура("ТекстНагадування",  Уведомление.Текст);
			ПараметрыФормы.Вставить("ДатаНагадування",  ДанныеУведомления["Дата"]);
			ПараметрыФормы.Вставить("УИД_Уведомления",  ДанныеУведомления["УИД_Уведомления"]);
			ПараметрыФормы.Вставить("УИД_Напоминание", ДанныеУведомления["УИД_Напоминание"]);
			Если ДанныеУведомления["НапоминаниеОТоваре"] = "1" Тогда
				
				ПараметрыФормы.Вставить("УИД_Номенклатура", ДанныеУведомления["УИД_Номенклатуры"]);
				 
			КонецЕсли; 
			
			ОткрытьФорму("Обработка.Нагадування.Форма.ФормаПерегляду", ПараметрыФормы);
			
			//
			//Если МассивОткрытыхОконНапоминаний.Найти(ДанныеУведомления["УИД_Уведомления"]) = Неопределено Тогда
			//	МассивОткрытыхОконНапоминаний.Добавить(ДанныеУведомления["УИД_Уведомления"]);
			//	
			//	//ОткрытьФорму("Обработка.Нагадування.Форма.ФормаПерегляду", ПараметрыФормы,,ДанныеУведомления["УИД_Уведомления"],,,,РежимОткрытияОкнаФормы.Независимый);
			//	ОткрытьФорму("Обработка.Нагадування.Форма.ФормаПерегляду", ПараметрыФормы,,ДанныеУведомления["УИД_Уведомления"]);			
			//КонецЕсли;			
			
		КонецЕсли;
	Исключение
		Сообщить(ОписаниеОшибки())
	КонецПопытки;
	
КонецПроцедуры



Процедура ОтобразитьЗаголовок() Экспорт
	//Если Общий.АвтообмінВключений() Тогда
	//	УстановитьЗаголовокПриложения("Автообмін: "+Общий.ОтриматиДатуОстанньогоОбміну());
	//Иначе 	
	//	УстановитьЗаголовокПриложения("Обмін: "+Общий.ОтриматиДатуОстанньогоОбміну());
	//КонецЕсли;
КонецПроцедуры


&НаСервереБезКонтекста
Функция  НоменклатураПоУИД(УИД) 
	УИД_Номенклатура = Новый УникальныйИдентификатор(УИД);
	Возврат Справочники.Номенклатура.ПолучитьСсылку(УИД_Номенклатура);
КонецФункции





#Если Не МобильноеПриложениеКлиент Тогда
	
	&НаКлиенте
	Процедура ПолучитьУведомления() Экспорт 
		мДатаУведомления = ТекущаяДата();
		мПолученыеСообщения = Общий.ПолучитьУведомленияНаСервере(ДатаУведомления - 3); 
		
		Для Каждого Сообщения Из мПолученыеСообщения Цикл 
			Оповещение = Новый ОписаниеОповещения("ОткрытьЧат", Клієнтський, Сообщения.ГруппаЧата); 
			ПоказатьОповещениеПользователя(СокрЛП("" + Сообщения.ГруппаЧата  + " " + Сообщения.Відправник), Оповещение, Сообщения.Текст, Сообщения.Картинка);
		КонецЦикла;
		
		ДатаУведомления = мДатаУведомления;
	КонецПроцедуры
	
#КонецЕсли

