
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//
	//Запрос = Новый Запрос;
	//Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	//               |	ХранилищеДополнительнойИнформации.Ссылка
	//               |ИЗ
	//               |	Справочник.ХранилищеДополнительнойИнформации КАК ХранилищеДополнительнойИнформации
	//               |ГДЕ
	//               |	ХранилищеДополнительнойИнформации.Характеристика = &Характеристика";
	//Запрос.УстановитьПараметр("Характеристика", Объект.Ссылка);
	//Выборка = Запрос.Выполнить().Выбрать();
	//
	//Если Выборка.Следующий() И ЗначениеЗаполнено(Выборка.Ссылка) Тогда
	//	СсылкаНаКартинку = ПолучитьНавигационнуюСсылку(Выборка.Ссылка, "Хранилище");
	//КонецЕсли;
	
	Элементы.ДекорацияЮтуб.Доступность = Не ПустаяСтрока(Объект.СсылкаНаYouTube);
	
КонецПроцедуры

&НаКлиенте
Процедура Декорация1Нажатие(Элемент)
	СтандартнаяОбработка = Ложь;
	ЗапуститьПриложение(Объект.СсылкаНаYouTube);
КонецПроцедуры


#Если МобильноеПриложениеКлиент Тогда
&НаКлиенте
Процедура Декорация2Нажатие(Элемент)
	СтандартнаяОбработка = Ложь;
		
	ТекстСообщения = Общий.ОтправитьНоменклатуруУВайбер(Объект.Ссылка);
	Если ТекстСообщения = Ложь Тогда 
		Сообщить("Не вдалося сформувати текст повідомлення");
	КонецЕсли;
	
	НовВз = Новый ЗапускПриложенияМобильногоУстройства();
	
	НовВз.Действие = "android.intent.action.SEND";
	НовВз.Приложение = "com.viber.voip"; 
	НовВз.ИмяКласса = "com.viber.voip.WelcomeShareActivity"; 
	НовВз.Тип = "text/plain";
	НовВз.ДополнительныеДанные.Добавить("android.intent.extra.TEXT", ТекстСообщения);
	
	НовВз.Запустить(Истина);

КонецПроцедуры

#Иначе
&НаКлиенте
Процедура Декорация2Нажатие(Команда)
	
	ТекстСообщения = Общий.ОтправитьНоменклатуруУВайбер(Объект.Ссылка);
	Если ТекстСообщения = Ложь Тогда 
		Сообщить("Не вдалося сформувати текст повідомлення");
	КонецЕсли;
	
	Сообщить(ТекстСообщения);

КонецПроцедуры
#КонецЕсли


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ЦБСектор = Обмен_УправлениеОбменом.ПолучитьСектор(Объект.Ссылка, "");
	Если ЗначениеЗаполнено(ЦБСектор) И ЦБСектор <> Объект.СекторНаСкладі Тогда 
		Объект.СекторНаСкладі = ЦБСектор;
	КонецЕсли;
	
	
	Элементы.Бронь.Видимость = Объект.ПериодБрони > ТекущаяДата();
КонецПроцедуры

&НаКлиенте
Процедура ШК(Команда)
	#Если МобильноеПриложениеКлиент Тогда
		
		ОбработчикСканирования = Новый ОписаниеОповещения("ОбработкаСканирования", ЭтаФорма);	
		СредстваМультимедиа.ПоказатьСканированиеШтрихКодов("Сканируйте штрихкоды", ОбработчикСканирования);
		
	#Иначе
		СтрокаШК = "";
		Если ВвестиСтроку(СтрокаШК, "Введите ШК вручную") Тогда 
			ОбработкаСканирования(СтрокаШК, Истина, "",);	
		КонецЕсли;
		
	#КонецЕсли
	

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаСканирования(Штрихкод, Результат, Сообщение, ДополнительныеПараметры) Экспорт
	Перем ТекстСообщения;
	
	#Если МобильноеПриложениеКлиент Тогда
		СредстваМультимедиа.ЗакрытьСканированиеШтрихКодов();
	#КонецЕсли
	
	Объект.СекторНаСкладі = Штрихкод;	
	
КонецПроцедуры


&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	Обмен_УправлениеОбменом.ПолучитьСектор(Объект.Ссылка, Объект.СекторНаСкладі);
КонецПроцедуры

