
Функция ПолучитьПоследнийХеш(ВидДанных, Пользователь, УИД_Клиента) Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ХешиДанныхОбмена.ХешДанных
		|ИЗ
		|	РегистрСведений.ХешиДанныхОбмена КАК ХешиДанныхОбмена
		|ГДЕ
		|	ХешиДанныхОбмена.УИД_Клиента = &УИД_Клиента
		|	И ХешиДанныхОбмена.Пользователь = &Пользователь
		|	И ХешиДанныхОбмена.ВидДанных = &ВидДанных";
	
	Запрос.УстановитьПараметр("ВидДанных", ВидДанных);
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	Запрос.УстановитьПараметр("УИД_Клиента", УИД_Клиента);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий()Тогда 
		Возврат Выборка.ХешДанных;
	Иначе
		Возврат "";
		
	КонецЕсли;
	
КонецФункции

Процедура ОновитьХешДанных(ВидДанных, Пользователь, УИД_Клиента, Хеш) Экспорт 
	
	Запись = СоздатьМенеджерЗаписи();
	Запись.ВидДанных = ВидДанных;
	Запись.Пользователь = Пользователь;
	Запись.УИД_Клиента = УИД_Клиента;
	Запись.ХешДанных = Хеш;
	Запись.Записать();
	
КонецПроцедуры
