

 Функция ПолучитьАбсолютныйЦвет(ИсходныйЦвет) 
	 если ИсходныйЦвет = Неопределено Тогда 
		 Возврат Новый Цвет(128,0,0);
	 КонецЕсли;
	 
	 
	 
	 Если ИсходныйЦвет.Вид = ВидЦвета.Абсолютный Тогда
		 Возврат ИсходныйЦвет;
	 КонецЕсли;
	 
	 ТабДок = Новый ТабличныйДокумент;
	 ТабДок.Область("R1C1").ЦветФона = ИсходныйЦвет;
	 
	 ТемпФил = КаталогВременныхФайлов()+"\TempFile1c.mxl";
	 
	 ТабДок.Записать(ТемпФил, ТипФайлаТабличногоДокумента.MXL7);
	 ТабДок.Прочитать(ТемпФил);
	 
	 АЦвет = ТабДок.Область("R1C1").ЦветФона;
	 
	 Возврат АЦвет;
	 
 КонецФункции
 
 Функция Из_10_В_Любую(Знач Значение=0,Нотация=36) 
	 Hex16 = 16;
	 Значение = ?(Значение<Hex16,Hex16,Значение);
	 Если Нотация<=0 Тогда Возврат("") КонецЕсли;
	 Значение=Число(Значение);
	 Если Значение<=0 Тогда Возврат("0") КонецЕсли;
	 Значение=Цел(Значение);
	 Результат="";
	 Пока Значение>0 Цикл
		 Результат=Сред("0123456789ABCDEFGHIJKLMNOPQRSTUVWXYZ",Значение%Нотация+1,1)+Результат;
		 Значение=Цел(Значение/Нотация) ;
	 КонецЦикла;
	 
	 
	 Возврат Результат;
 КонецФункции
 
 Функция Цвет1С_RBG_to_hex16(Цвет1с)Экспорт
	 
	 
	 
	 РБГ = ПолучитьАбсолютныйЦвет(Цвет1с) ;	
	 
	 rr = Из_10_В_Любую(РБГ.Красный,16);
	 gg = Из_10_В_Любую(РБГ.Зеленый,16);
	 bb = Из_10_В_Любую(РБГ.Синий,16);
	 
	 Возврат "#" +rr+gg+bb;	
	 
 КонецФункции
 
 Функция СкопироватьФайл(ПолноеИмяОткуда,ПолноеИмяКуда) Экспорт 
	 Попытка
		 КопироватьФайл(ПолноеИмяОткуда,ПолноеИмяКуда);
		 Возврат Истина;
	 Исключение
		 Возврат Ложь;
	 КонецПопытки;	
 КонецФункции
 
 Процедура ЗвукСигнал()   Экспорт 
	 //ДД = ПолучитьМакет("ЗвукАська");
	 // ВремИмя = ПолучитьИмяВременногоФайла(".mp3");
	 // ТемпИмя = КаталогВременныхФайлов() + "\ICQ.mp3";	
	 // ДД.Записать(ВремИмя);
	  ф = ЭтотОбъект.ПолучитьФорму("Форма");	
	 Попытка 
		 ф.ЭлементыФормы.музик.settings.autostart = Истина; 
		 ф.ЭлементыФормы.музик.settings.volume = 100; 
		 ф.ЭлементыФормы.музик.URL = "E:\ФайлиЧат1с\WM\ISQ1.mp3"; 
	 Исключение 
		 ф.ЭлементыФормы.музик.settings.autostart = Истина; 
		 ф.ЭлементыФормы.музик.settings.volume = 100; 
		 ф.ЭлементыФормы.музик.URL = "E:\ФайлиЧат1с\WM\ISQ2.mp3"
	 КонецПопытки; 	
	// ф = Неопределено;
	 //УдалитьФайлы(ВремИмя);
 КонецПроцедуры