
Функция ПолучитьПрокси() Экспорт
	
	 // Центральна база
		АдресЛокал = "http://192.168.0.10/ltex/ws/MobileExchange/MobileExchange.1cws?wsdl";	
		Адрес = "https://ltex1c.com.ua/ltex/ws/MobileExchange/MobileExchange.1cws?wsdl";

	

	 // Тестова база
		//АдресЛокал = "http://192.168.0.10/ltex_dev/ws/MobileExchange/MobileExchange.1cws?wsdl"; 	
		//Адрес = "https://ltex1c.com.ua/ltex_dev/ws/MobileExchange/MobileExchange.1cws?wsdl";

	
	
	Пользователь = "SOAP";
	Пароль = "wsBFtyg87GDR4kdsjKI8";
	Попытка
		Определения = Новый WSОпределения(АдресЛокал,Пользователь,Пароль,,3);
		
	Исключение
		//Попытка
		Определения = Новый WSОпределения(Адрес,Пользователь,Пароль,,20);	
		//Исключение
		//	Определения = Новый WSОпределения(Адрес2,Пользователь,Пароль,,1);

		//КонецПопытки;
		
	КонецПопытки;
//	Константы.Определение.Установить(Новый ХранилищеЗначения(Определения));
	URI = URIПространстваИменСервиса();
	Прокси = Новый WSПрокси(Определения, URI, "MobileExchange", "MobileExchange" + "Soap");
	Прокси.Пользователь = Пользователь;
	Прокси.Пароль = Пароль;
	
	Возврат Прокси;
	
КонецФункции

Функция URIПространстваИменСервиса() Экспорт
	
	Возврат "http://arm_mobile";
	
КонецФункции


