
&НаКлиенте
Процедура Декорация1Нажатие(Элемент)
	СтандартнаяОбработка = Ложь;
	//#Если МобильноеПриложениеКлиент Тогда
		ЗапуститьПриложение(Объект.YouTube);
	//#Иначе
		 //ЗапуститьПриложение(
	//#КонецЕсли	
	// Вставити вміст обробника.
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Объект") Тогда 
		ЗначениеВРеквизитФормы(Параметры.объект.ПолучитьОбъект(), "Объект");
		
	КонецЕсли;
	Параметры.Свойство("СтрокаРассылки", СтрокаРассылки);	
	//Запрос = Новый Запрос;
	//Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	//|	ХранилищеДополнительнойИнформации.Ссылка
	//|ИЗ
	//|	Справочник.ХранилищеДополнительнойИнформации КАК ХранилищеДополнительнойИнформации
	//|ГДЕ
	//|	ХранилищеДополнительнойИнформации.Номенклатура = &Номенклатура
	//|	И ХранилищеДополнительнойИнформации.Характеристика = &Характеристика";
	//Запрос.УстановитьПараметр("Номенклатура", Объект.Ссылка);
	//Запрос.УстановитьПараметр("Характеристика", Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка());
	//Выборка = Запрос.Выполнить().Выбрать ();
	//
	//Если Выборка.Следующий() И ЗначениеЗаполнено(Выборка.Ссылка) Тогда
	//	СсылкаНаКартинку = ПолучитьНавигационнуюСсылку(Выборка.Ссылка, "Хранилище");
	//	//Элементы.ПолеКартинки.Картинка = Выборка.Ссылка.Хранилище.Получить();
	//КонецЕсли;
	з = Новый Запрос;
	з.Текст = "ВЫБРАТЬ
	          |	Штрихкоды.Штрихкод КАК Штрихкод
	          |ИЗ
	          |	РегистрСведений.Штрихкоды КАК Штрихкоды
	          |ГДЕ
	          |	Штрихкоды.Владелец = &Владелец";
	з.УстановитьПараметр("Владелец",Объект.Ссылка);
	Выборка = з.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда 
		Штрихкод = Выборка.Штрихкод;
	КонецЕсли;
	
	//з.УстановитьПараметр("ЕдиницаИзмерения");
	
	СсылкаНаКартинку = ПолучитьКартинку(Объект.Ссылка,Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка());
	
	
з = Новый Запрос;
	з.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	          |	ЦеныНоменклатуры.Цена КАК Цена,
	          |	ЦеныНоменклатуры.ЕдиницаИзмерения КАК ЕдиницаИзмерения
	          |ИЗ
	          |	РегистрСведений.ЦеныНоменклатуры КАК ЦеныНоменклатуры
	          |ГДЕ
	          |	НЕ ЦеныНоменклатуры.ТипЦен.ЭтоЦенаПартнера
	          |	И ЦеныНоменклатуры.Номенклатура = &Номенклатура
	          |	И ЦеныНоменклатуры.ХарактеристикаНоменклатуры = &ПустаяХарактеристика";
			  з.УстановитьПараметр("Номенклатура",Объект.Ссылка);
			  з.УстановитьПараметр("ПустаяХарактеристика",Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка());
	Выборка = з.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Цена = Формат(Выборка.Цена,"ЧДЦ=2") + " EUR.";
		Цена1 = Формат(Выборка.Цена,"ЧДЦ=2") + " EUR.";

		ЕдиницаИзмерения = Выборка.ЕдиницаИзмерения;
	КонецЕсли;
	
	
	з.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	          |	НормыЗапасов.Количество
	          |ИЗ
	          |	РегистрСведений.НормыЗапасов КАК НормыЗапасов
	          |ГДЕ
	          |	НормыЗапасов.Номенклатура = &Номенклатура
	          |	И НормыЗапасов.ХарактеристикаНоменклатуры = &ПустаяХарактеристика
	          |	И НормыЗапасов.ЕдиницаИзмерения = &ЕдиницаИзмерения";
			  з.УстановитьПараметр("Номенклатура",Объект.Ссылка);
			  з.УстановитьПараметр("ПустаяХарактеристика",Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка());
			  з.УстановитьПараметр("ЕдиницаИзмерения",ЕдиницаИзмерения);
	Выборка = з.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		НормаЗапаса = Выборка.Количество;
	КонецЕсли;
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ХарактеристикиНоменклатуры.Ссылка) КАК Количество,
		|	СУММА(ВЫБОР
		|			КОГДА ХарактеристикиНоменклатуры.СсылкаНаYouTube = """"
		|				ТОГДА 0
		|			ИНАЧЕ 1
		|		КОНЕЦ) КАК КоличествоСсылок
		|ИЗ
		|	Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
		|ГДЕ
		|	ХарактеристикиНоменклатуры.Владелец = &Владелец
		|	И ХарактеристикиНоменклатуры.Залишок > 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Резервы.ТорговийИмя КАК Торговый,
		|	Резервы.Количество КАК Количество
		|ИЗ
		|	РегистрСведений.Резервы КАК Резервы
		|ГДЕ
		|	Резервы.Номенклатура = &Владелец";
	
	Запрос.УстановитьПараметр("Владелец", Объект.Ссылка);
	Результат = Запрос.ВыполнитьПакет();
	Выборка = Результат[0].Выбрать();
	Если Выборка.Следующий() Тогда 
		Элементы.Характеристики.Заголовок = "Характеристики ("  +Выборка.Количество + " шт.) (" +Выборка.КоличествоСсылок + " шт.)";  
	КонецЕсли;
	
	Выборка = Результат[1].Выбрать();

	Пока Выборка.Следующий() Цикл 
		
		Стр = Резервы.Добавить();
		Стр.Торговый 	= Выборка.Торговый;
		стр.Количество 	= Выборка.Количество;
		
	КонецЦикла;
	Элементы.Резервы.Заголовок = "Зарезервовано  ("  + Резервы.Итог("Количество") + " шт.)";  

	
	Элементы.Цены.Видимость = Константы.ПоказыватьЦены.Получить(); 
	Элементы.ЦеныПоставщика.Видимость = Константы.ПоказыватьЦеныПоставщиков.Получить(); 
		
	Элементы.ДекорацияЮтуб.Доступность = ЗначениеЗаполнено(Объект.YouTube);
	Элементы.ДекорацияСайт.Доступность = ЗначениеЗаполнено(Объект.ПосиланняНаСайт);
	Элементы.ДекорацияЛоти.Доступность = ЗначениеЗаполнено(Объект.НаявніЛоти);
	
	ИнформацияОХарактеристиках.Параметры.УстановитьЗначениеПараметра("Владелец", Объект.Ссылка);
	ИнформацияОХарактеристиках.Параметры.УстановитьЗначениеПараметра("ТекущаяДата", ТекущаяДата());
	
	ЦеныНоменклатуры.Параметры.УстановитьЗначениеПараметра("Номенклатура", Объект.Ссылка);
	ЦеныПоставщиков.Параметры.УстановитьЗначениеПараметра("Номенклатура", Объект.Ссылка);
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Резервы.ТорговийИмя КАК ТорговийИмя,
		|	Резервы.Количество КАК Количество
		|ИЗ
		|	РегистрСведений.Резервы КАК Резервы
		|ГДЕ
		|	Резервы.Номенклатура = &Номенклатура";
	
	Запрос.УстановитьПараметр("Номенклатура", Объект.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		// Вставить обработку выборки ВыборкаДетальныеЗаписи
	КонецЦикла;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА

	
	//СоздатьЭлементыХарактеристик();
КонецПроцедуры


&НаСервере
Процедура СоздатьЭлементыХарактеристик()
	
	з = Новый Запрос;
	з.Текст = "ВЫБРАТЬ
	          |	ХарактеристикиНоменклатуры.Ссылка КАК Характеристика,
	          |	Штрихкоды.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	          |	ЦеныНоменклатуры.Цена КАК Цена,
	          |	Штрихкоды.Штрихкод КАК Штрихкод,
	          |	НормыЗапасов.Количество КАК НормаЗапасов,
	          |	ЦеныНоменклатурыБезХарактеристик.Цена КАК ЦенаОбщая
	          |ИЗ
	          |	Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
	          |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Штрихкоды КАК Штрихкоды
	          |		ПО (Штрихкоды.ХарактеристикаНоменклатуры = ХарактеристикиНоменклатуры.Ссылка)
	          |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры КАК ЦеныНоменклатуры
	          |		ПО (ЦеныНоменклатуры.ХарактеристикаНоменклатуры = ХарактеристикиНоменклатуры.Ссылка)
	          |			И (НЕ ЦеныНоменклатуры.ТипЦен.ЭтоЦенаПартнера)
	          |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НормыЗапасов КАК НормыЗапасов
	          |		ПО ХарактеристикиНоменклатуры.Владелец = НормыЗапасов.Номенклатура
	          |			И ХарактеристикиНоменклатуры.Ссылка = НормыЗапасов.ХарактеристикаНоменклатуры
	          |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры КАК ЦеныНоменклатурыБезХарактеристик
	          |		ПО ХарактеристикиНоменклатуры.Владелец = ЦеныНоменклатурыБезХарактеристик.Номенклатура
	          |			И (НЕ ЦеныНоменклатурыБезХарактеристик.ТипЦен.ЭтоЦенаПартнера)
	          |			И (ЦеныНоменклатурыБезХарактеристик.ХарактеристикаНоменклатуры = &ПустаяХарактеристика)
	          |ГДЕ
	          |	ХарактеристикиНоменклатуры.Владелец = &Владелец";
			  з.УстановитьПараметр("Владелец",Объект.Ссылка);
			  з.УстановитьПараметр("ПустаяХарактеристика",Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка());

	Выборка = з.Выполнить().Выбрать();
	НомерЭлементаГруппы = 1;
	Пока Выборка.Следующий() Цикл
		МассивДобавляемыхРеквизитов = Новый Массив;
		//ЭлементСтраницы = Элементы["Характеристика"+НомерЭлементаГруппы];	
		
		ТипСтрока = Новый ОписаниеТипов("Строка");
		ТипЧисло = Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(10,0));
		ТипХарактеристика = Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры");
		ТипЕдИзм = Новый ОписаниеТипов("СправочникСсылка.ЕдиницыИзмерения");
		
		ЭлементСтраницы = Элементы.Добавить("Характеристика"+НомерЭлементаГруппы, Тип("ГруппаФормы"), ЭтаФорма);
		ЭлементСтраницы.Вид = ВидГруппыФормы.ОбычнаяГруппа;
		ЭлементСтраницы.Заголовок = Выборка.Характеристика;
		//ЭлементСтраницы.Поведение = ПоведениеОбычнойГруппы.Свертываемая;
		ЭлементСтраницы.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Горизонтальная;
		//	ЭлементСтраницы.Свернута = Истина;
		ЭлементСтраницы.ЗаголовокСвернутогоОтображения = Выборка.Характеристика;
		/////////////////////////////////////////////////////////////////////////СТВОРЕННЯ РЕКВІЗИТІВ
		
		
		
		Картинка = Новый РеквизитФормы("Картинка"+НомерЭлементаГруппы, ТипСтрока, "", "Картинка");
		МассивДобавляемыхРеквизитов.Добавить(Картинка);
		ШК = Новый РеквизитФормы("Штрихкод"+НомерЭлементаГруппы, ТипСтрока, "", "Штрихкод");
		МассивДобавляемыхРеквизитов.Добавить(ШК);
		ЕдИзм = Новый РеквизитФормы("ЕдиницаИзмерения"+НомерЭлементаГруппы, ТипЕдИзм, "", "Ед. изм.");
		МассивДобавляемыхРеквизитов.Добавить(ЕдИзм);
		Характ = Новый РеквизитФормы("Характеристика"+НомерЭлементаГруппы, ТипХарактеристика, "", "Характеристика");
		МассивДобавляемыхРеквизитов.Добавить(Характ);
		ЦенаТов = Новый РеквизитФормы("Цена"+НомерЭлементаГруппы, ТипСтрока, "", "Цена");	
		МассивДобавляемыхРеквизитов.Добавить(ЦенаТов);
		НормаЗапасов = Новый РеквизитФормы("НормаЗапаса"+НомерЭлементаГруппы, ТипЧисло, "", "Норма запаса");		
		МассивДобавляемыхРеквизитов.Добавить(НормаЗапасов);

		
		
		
		///////////////////////////////////////////////////////////////////////////////////////////////////////////////

		
		МассивУдаляемыхРеквизитов = Новый Массив;
		//
		ИзменитьРеквизиты(МассивДобавляемыхРеквизитов, МассивУдаляемыхРеквизитов);
		//////////////////////////////////////////////////////////////////////////////////////////СТВОРЕННЯ ЕЛЕМЕНТІВ
		
		
		
		ЭлементКартинка = Элементы.Добавить("Картинка"+НомерЭлементаГруппы, Тип("ПолеФормы"), ЭлементСтраницы);
		ЭлементКартинка.Вид = ВидПоляФормы.ПолеКартинки;
		ЭлементКартинка.ПутьКДанным = "Картинка"+НомерЭлементаГруппы;
		ЭлементКартинка.Ширина = 11;
		ЭлементКартинка.Высота = 4;
		ЭлементКартинка.РастягиватьПоГоризонтали = Ложь;
		ЭлементКартинка.РастягиватьПоВертикали = Ложь;
		ЭлементКартинка.РазмерКартинки = РазмерКартинки.Пропорционально;
		ЭлементКартинка.Гиперссылка = Истина;
		ЭлементКартинка.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
		ЭлементКартинка.Рамка = Новый Рамка(ТипРамкиЭлементаУправления.БезРамки,0);

		ЭтаФорма["Картинка"+НомерЭлементаГруппы] =  ПолучитьКартинку(Объект.Ссылка,Выборка.Характеристика);
		ЭлементКартинка.УстановитьДействие("Нажатие","СсылкаНаКартинкуНажатие");
		/////////
		
		ЭлементПодгруппа = Элементы.Добавить("ЭлементПодгруппа"+НомерЭлементаГруппы,Тип("ГруппаФормы"),ЭлементСтраницы);
		ЭлементПодгруппа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
		ЭлементПодгруппа.Отображение = ОтображениеОбычнойГруппы.Нет;
		ЭлементПодгруппа.РастягиватьПоГоризонтали = Истина;
		ЭлементПодгруппа.РастягиватьПоВертикали = Ложь;
		//ЭлементПодгруппа.ВертикальноеПоложение = ВертикальноеПоложение.Верх;
		ЭлементПодгруппа.ВертикальноеПоложениеВГруппе = ВертикальноеПоложениеЭлемента.Верх;
		ЭлементПодгруппа.ОтображатьЗаголовок = Ложь;
		//ЭлементПодгруппа.Отображение = ОтображениеОбычнойГруппы.СильноеВыделение;
		
		ЭлементШтрихкод = Элементы.Добавить("ЭлементШК"+НомерЭлементаГруппы,Тип("ПолеФормы"),ЭлементПодгруппа);
		ЭлементШтрихкод.ПутьКДанным = "Штрихкод"+НомерЭлементаГруппы;
		ЭлементШтрихкод.Заголовок = "Код товара";
		ЭлементШтрихкод.Вид = ВидПоляФормы.ПолеНадписи;
		ЭтаФорма["Штрихкод"+НомерЭлементаГруппы] = Выборка.Штрихкод; 
		
		ЭлементЕдИзм = Элементы.Добавить("ЭлементЕдИзм"+НомерЭлементаГруппы,Тип("ПолеФормы"),ЭлементПодгруппа);
		ЭлементЕдИзм.ПутьКДанным = "ЕдиницаИзмерения"+НомерЭлементаГруппы;
		ЭлементЕдИзм.Вид = ВидПоляФормы.ПолеНадписи;
		ЭтаФорма["ЕдиницаИзмерения"+НомерЭлементаГруппы] = Выборка.ЕдиницаИзмерения;
		
		ЭтаФорма["Характеристика"+НомерЭлементаГруппы] = Выборка.Характеристика;
		
		ЭлементЦена = Элементы.Добавить("ЭлементЦена"+НомерЭлементаГруппы,Тип("ПолеФормы"),ЭлементПодгруппа);
		ЭлементЦена.ПутьКДанным = "Цена"+НомерЭлементаГруппы;
		ЭлементЦена.Вид = ВидПоляФормы.ПолеНадписи;
		Если ЗначениеЗаполнено(Выборка.Цена) Тогда 
	
			ЭтаФорма["Цена"+НомерЭлементаГруппы] = Формат(Выборка.Цена,"ЧДЦ=2")+" EUR.";
		ИначеЕсли ЗначениеЗаполнено(Выборка.ЦенаОбщая) Тогда 
	
			ЭтаФорма["Цена"+НомерЭлементаГруппы] = Формат(Выборка.ЦенаОбщая,"ЧДЦ=2")+" EUR.";

		КонецЕсли;
		
		ЭлементНормаЗапасов = Элементы.Добавить("ЭлементНормаЗапаса"+НомерЭлементаГруппы,Тип("ПолеФормы"),ЭлементПодгруппа);
		ЭлементНормаЗапасов.ПутьКДанным = "НормаЗапаса"+НомерЭлементаГруппы;
		ЭлементНормаЗапасов.Вид = ВидПоляФормы.ПолеВвода;
		ЭлементНормаЗапасов.Ширина = 3;
		//ЭлементНормаЗапасов.ЦветФона = Новый Цвет(255,255,255);
		//ЭлементНормаЗапасов.ЦветТекста = Новый Цвет(0,0,0);
		ЭлементНормаЗапасов.ЦветРамки = Новый Цвет(153,153,153);
		ЭлементНормаЗапасов.ГоризонтальноеПоложение = ГоризонтальноеПоложениеЭлемента.Центр;
		ЭтаФорма["НормаЗапаса"+НомерЭлементаГруппы] = Выборка.НормаЗапасов;
		ЭлементНормаЗапасов.УстановитьДействие("ПриИзменении","НормаЗапасаПриИзменении");

		//
		//ЭлементДекорация = Элементы.Добавить("Дек"+НомерЭлементаГруппы, Тип("ДекорацияФормы"), ЭлементПодгруппа);
		//ЭлементДекорация.РастягиватьПоВертикали = Истина;
		//
		//ЭлементДекорация.Вид = ВидДекорацииФормы.Надпись;
		//ЭлементДекорация.ЦветФона = Новый Цвет(0,0,0);
		//ЭлементДекорация.Высота = 10;

		
		НомерЭлементаГруппы = НомерЭлементаГруппы + 1;
	КонецЦикла;
	
	
КонецПроцедуры

&НаСервере
Функция ПолучитьКартинку(Номенклатура,Знач Характеристика = Неопределено)
	Если Характеристика = Неопределено Тогда 
		Характеристика = Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка();
	КонецЕсли;
	
		Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	|	ХранилищеДополнительнойИнформации.Ссылка
	|ИЗ
	|	Справочник.ХранилищеДополнительнойИнформации КАК ХранилищеДополнительнойИнформации
	|ГДЕ
	|	ХранилищеДополнительнойИнформации.Номенклатура = &Номенклатура
	|	И ХранилищеДополнительнойИнформации.Характеристика = &Характеристика";
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("Характеристика", Характеристика);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() И ЗначениеЗаполнено(Выборка.Ссылка) Тогда
		Возврат ПолучитьНавигационнуюСсылку(Выборка.Ссылка, "Хранилище");
		//Элементы.ПолеКартинки.Картинка = Выборка.Ссылка.Хранилище.Получить();
	КонецЕсли;
	Возврат "";
КонецФункции




&НаКлиенте
Процедура СсылкаНаКартинкуНажатие(Элемент, СтандартнаяОбработка)
	ИмяЭлемента = СтрЗаменить(Элемент.Имя,"СсылкаНаКартинку","");
	СтандартнаяОбработка = Ложь;
	ПараметрыКартинки = Новый Структура();
	ПараметрыКартинки.Вставить("СсылкаНаКартинку",ЭтотОбъект[Элемент.Имя]);
	ПараметрыКартинки.Вставить("Наименование",Объект.Наименование);
	Если ЗначениеЗаполнено(ИмяЭлемента) Тогда 
	ПараметрыКартинки.Вставить("Характеристика",Элементы["Характеристика"+СтрЗаменить(ИмяЭлемента,"Картинка","")].Заголовок);
		КонецЕсли;
	ПараметрыКартинки.Вставить("Штрихкод",ЭтотОбъект["Штрихкод"+СтрЗаменить(ИмяЭлемента,"Картинка","")]);
	ПараметрыКартинки.Вставить("ЕдиницаИзмерения",ЭтотОбъект["ЕдиницаИзмерения"+СтрЗаменить(ИмяЭлемента,"Картинка","")]);
	ПараметрыКартинки.Вставить("Цена",ЭтотОбъект["Цена"+СтрЗаменить(ИмяЭлемента,"Картинка","")]);
	ФормаПросмотраКартинки = ПолучитьФорму("Справочник.Номенклатура.Форма.ФормаПросмотраКартинки",ПараметрыКартинки,ЭтаФорма);
	ФормаПросмотраКартинки.Открыть();
	
	
	
//		Картинка = Параметры.СсылкаНаКартинку;
//	Наименование = Параметры.Наименование;

//	Характеристика = Параметры.Характеристика;

//	ЕдиницаИзмерения = Параметры.ЕдиницаИзмерения;
//Цена = Параметры.Цена;
//Штрихкод = Параметры.Штрихкод;

	
КонецПроцедуры


&НаСервереБезКонтекста
Процедура НормаЗапасаОкончаниеВводаТекстаНаСервере(Номенклатура,Знач ХарактеристикаНоменклатуры,ЕдиницаИзмерения,Количество)
	//Если ХарактеристикаНоменклатуры = Неопределено Тогда 
	//	ХарактеристикаНоменклатуры = Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка();
	//КонецЕсли;
	//
	//нз =РегистрыСведений.НормыЗапасов.СоздатьНаборЗаписей();
	//нз.Отбор.Номенклатура.Установить(Номенклатура);	
	//нз.Отбор.ХарактеристикаНоменклатуры.Установить(ХарактеристикаНоменклатуры);
	//нз.Отбор.ЕдиницаИзмерения.Установить(ЕдиницаИзмерения);
	//зап = нз.Добавить();
	//зап.Номенклатура = Номенклатура;
	//зап.ХарактеристикаНоменклатуры = ХарактеристикаНоменклатуры;
	//зап.ЕдиницаИзмерения = ЕдиницаИзмерения;
	//зап.Количество = Количество;
	//зап.Дата = ТекущаяДата();
	//нз.Записать();
	//
	//Общий.ЗарегистрироватьИзменения(Номенклатура.Ссылка);
КонецПроцедуры


&НаКлиенте
Процедура НормаЗапасаОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	//Если Элемент.Имя = "НормаЗапаса" Тогда 
	//	ТекЕдиницаИзмерения = ЕдиницаИзмерения;
	//	ТекХарактристика = Неопределено;
	//Иначе
	//	ТекЕдиницаИзмерения = ЭтотОбъект["ЕдиницаИзмерения"+СтрЗаменить(Элемент.Имя,"ЭлементНормаЗапаса","")];
	//	ТекХарактристика = ЭтотОбъект["Характеристика"+СтрЗаменить(Элемент.Имя,"ЭлементНормаЗапаса","")];	
	//КонецЕсли;
	//НормаЗапасаОкончаниеВводаТекстаНаСервере(Объект.Ссылка,ТекХарактристика,ТекЕдиницаИзмерения,Число(Текст));
КонецПроцедуры


&НаКлиенте
Процедура НормаЗапасаПриИзменении(Элемент)
	Если Элемент.Имя = "НормаЗапаса" Тогда 
		ТекЕдиницаИзмерения = ЕдиницаИзмерения;
		ТекХарактристика = Неопределено;
	Иначе
		ТекЕдиницаИзмерения = ЭтотОбъект["ЕдиницаИзмерения"+СтрЗаменить(Элемент.Имя,"ЭлементНормаЗапаса","")];
		ТекХарактристика = ЭтотОбъект["Характеристика"+СтрЗаменить(Элемент.Имя,"ЭлементНормаЗапаса","")];	
	КонецЕсли;
	НормаЗапасаОкончаниеВводаТекстаНаСервере(Объект.Ссылка,ТекХарактристика,ТекЕдиницаИзмерения,Число(Элемент.ТекстРедактирования));
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если Не Объект.Просмотр Тогда 
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура YouTubeНажатие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	#Если МобильноеПриложениеКлиент Тогда
		ЗапуститьПриложение(Объект.YouTube);	
	#КонецЕсли	
КонецПроцедуры


&НаКлиенте
Процедура ПосиланняНаСайтНажатие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	#Если МобильноеПриложениеКлиент Тогда
		ЗапуститьПриложение(Объект.ПосиланняНаСайт);	
	#КонецЕсли	
КонецПроцедуры


&НаКлиенте
Процедура Декорация3Нажатие(Элемент)
	СтандартнаяОбработка = Ложь;
	//#Если МобильноеПриложениеКлиент Тогда
		ЗапуститьПриложение(Объект.НаявніЛоти);	
	//#КонецЕсли	

КонецПроцедуры


&НаКлиенте
Процедура Декорация2Нажатие(Элемент)
	СтандартнаяОбработка = Ложь;
	//#Если МобильноеПриложениеКлиент Тогда
		ЗапуститьПриложение(Объект.ПосиланняНаСайт);	
	//#КонецЕсли	

КонецПроцедуры


&НаСервере
Процедура кмОтправитьВайберНаСервере()
КонецПроцедуры

#Если МобильноеПриложениеКлиент Тогда
&НаКлиенте
Процедура кмОтправитьВайбер(Команда)
	
	ТекущиеДанные = Элементы.ИнформацияОХарактеристиках.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	ТекстСообщения = Общий.ОтправитьНоменклатуруУВайбер(ТекущиеДанные.Ссылка);
	Если ТекстСообщения = Ложь Тогда 
		Сообщить("Не вдалося сформувати текст повідомлення");
	КонецЕсли;
	
	НовВз = Новый ЗапускПриложенияМобильногоУстройства();
	
	НовВз.Действие = "android.intent.action.SEND";
	НовВз.Приложение = "com.viber.voip"; 
	НовВз.ИмяКласса = "com.viber.voip.WelcomeShareActivity"; 
	НовВз.Тип = "text/plain";
	НовВз.ДополнительныеДанные.Добавить("android.intent.extra.TEXT", ТекстСообщения);
	
	НовВз.Запустить(Истина);


КонецПроцедуры
#Иначе
&НаКлиенте
Процедура кмОтправитьВайбер(Команда)
	
	ТекущиеДанные = Элементы.ИнформацияОХарактеристиках.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	ТекстСообщения = Общий.ОтправитьНоменклатуруУВайбер(ТекущиеДанные.Ссылка);
	Если ТекстСообщения = Ложь Тогда 
		Сообщить("Не вдалося сформувати текст повідомлення");
	КонецЕсли;
	
	Сообщить(ТекстСообщения);

КонецПроцедуры
#КонецЕсли

&НаКлиенте
Процедура ИнформацияОХарактеристикахВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
		ОткрытьЗначение(Элементы.ИнформацияОХарактеристиках.ТекущиеДанные.Ссылка); 
КонецПроцедуры

&НаКлиенте
Процедура УстановитьБронь(Команда)
	Отказ = Ложь;
	Строка = Элементы.ИнформацияОХарактеристиках.ТекущиеДанные;
	Если Строка = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	Вага = Строка.Ссылка;
	
			
		УстановитьБроньНаСервере(Вага, Отказ );
		
		Если Отказ Тогда 	
			Возврат;
		КонецЕсли;
		
		Форма = ПолучитьФорму("Справочник.Номенклатура.Форма.ФормаУстановкиБрони");
		Форма.Номенклатура = Объект.Ссылка;
		Форма.Вага = Вага;
		Форма.Открыть();
		
	
КонецПроцедуры

&НаСервере
Процедура УстановитьБроньНаСервере(Характеристика, Отказ)

	Если  Характеристика.ПериодБрони > КонецДня(ТекущаяДата())	  Тогда 
		Сообщить("Характеристика заброньована до " + Формат(Характеристика.ПериодБрони, "ДФ=dd.MM.yyyy")); 
		Отказ = Истина;	
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ИнформацияОХарактеристикахПриАктивизацииСтрокиНаСервере(Характеристика, Заголовок)
	
	Если Характеристика.МояБронь И Характеристика.ПериодБрони > КонецДня(ТекущаяДата()) тогда 
		Заголовок = "Вилучити бронь";
	Иначе
		Заголовок = "Забронювати";
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИнформацияОХарактеристикахПриАктивизацииСтроки(Элемент)
	//Перем мЗаголовок;
	//ТекДанные = Элементы.ИнформацияОХарактеристиках.ТекущиеДанные;
	//Если ТекДанные = Неопределено Тогда 
	//	Возврат;
	//КонецЕсли;
	//ИнформацияОХарактеристиках.получить(1)
	//ИнформацияОХарактеристикахПриАктивизацииСтрокиНаСервере( ТекДанные.Ссылка, мЗаголовок);
	//Элементы.ИнформацияОХарактеристикахКонтекстноеМенюУстановитьБронь.Заголовок = ?(ТекДанные.ШтрихкодОформлениеЯчейки.ЦветТекста = WebЦвета.НейтральноГрифельноСиний, "Вилучити бронь", "Забронювати");

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "Установка брони"  Тогда 
		Элементы.ИнформацияОХарактеристиках.Обновить();
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ВилучитиБроньНаСервере(Характеристика)
	
	Если Не (Характеристика.МояБронь И Характеристика.ПериодБрони >= КонецДня(ТекущаяДата())) тогда 

		Возврат;
	КонецЕсли;
	
	
	Прокси = СоединениеСБазой.ПолучитьПрокси();
	Пароль = Константы.ПарольВхода.Получить();
	Данные = Новый Структура;
	Данные.Вставить("Команда", "ВилучитиБронь");
	Данные.Вставить("Характеристика", Характеристика.УникальныйИдентификатор());
	Ответ = Прокси.ЗабронюватиНоменклатуру(Пароль, Обмен_УправлениеОбменом.Сериализовать(Данные));
	Ответ = Ответ.Получить();
	
	Если Ответ.Успешно Тогда 
		ВагаОбъект = Характеристика.ПолучитьОбъект();
		ВагаОбъект.Бронь = Неопределено;
		ВагаОбъект.ПериодБрони = Неопределено;
		ВагаОбъект.МояБронь = Ложь;
		ВагаОбъект.Записать();
	Иначе
		Сообщить(Ответ.Ошибка);
	КонецЕсли; 	
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьБронь(Команда)
	  Отказ = Ложь;
	  Строка = Элементы.ИнформацияОХарактеристиках.ТекущиеДанные;
	  Если Строка = Неопределено Тогда 
		  Возврат;
	  КонецЕсли;
	  
	  Вага = Строка.Ссылка;

		ВилучитиБроньНаСервере(Вага);
		Элементы.ИнформацияОХарактеристиках.Обновить();
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьВРассылку(Команда)
	ТекущиеДанные = Элементы.ИнформацияОХарактеристиках.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	Данные = Новый Структура("Номенклатура, Характеристика", Объект.Ссылка, ТекущиеДанные.Ссылка);
	
	 
	Оповестить("ДОбавитьУРассылку", Данные);
КонецПроцедуры

&НаКлиенте
Процедура кмСкинутиУВайберЗаказВидео(Команда)
    Клієнтський.СкинутиУВайберЗаказВидео(Объект.Ссылка);
КонецПроцедуры



