
// Возвращает строковое значение ставки НДС по значению перечисления
//
// Параметры:
// 		СтавкаНДС - ПеречислениеСсылка.СтавкиНДС - значение перечисления СтавкиНДС
//
// Возвращаемое значение:
// 		Строка - Значение ставки НДС строкой
//
Функция ПолучитьСтавкуНДССтрокой(СтавкаНДС) Экспорт
	
	Если СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС20") Тогда
		ЗначениеНалога = "20";
	ИначеЕсли СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС7") Тогда
		ЗначениеНалога = "7";
	ИначеЕсли СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС0") Тогда
		ЗначениеНалога = "0";
	ИначеЕсли СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.БезНДС") Тогда
		ЗначениеНалога = "Без НДС";
	ИначеЕсли СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.НеНДС") Тогда
		ЗначениеНалога = "Не НДС";
	Иначе
		ЗначениеНалога = Строка(СтавкаНДС);
	КонецЕсли;
	
	Возврат ЗначениеНалога;
	
КонецФункции // ПолучитьСтавкуНДССтрокой()

// Возвращает строковое значение ставки НДС по значению перечисления
//
// Параметры:
// 		СтавкаНДС - ПеречислениеСсылка.СтавкиНДС - значение перечисления СтавкиНДС
//
// Возвращаемое значение:
// 		Строка - Значение ставки НДС строкой
//
Функция ПолучитьПоСтрокеСтавкуНДС(ЗначениеНалога) Экспорт
	
	Если ЗначениеНалога = "20" Тогда
		СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС20");
	ИначеЕсли ЗначениеНалога = "7" Тогда
		СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС7");
	ИначеЕсли ЗначениеНалога = "0" Тогда
		СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС0");
	ИначеЕсли ЗначениеНалога = "Без НДС" Тогда
		СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.БезНДС");
	Иначе
		СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.НеНДС");
	КонецЕсли;
	
	Возврат СтавкаНДС;
		
КонецФункции // ПолучитьСтавкуНДССтрокой()
