
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//Завершені = Истина;
	ОновитьОтбор(); 
КонецПроцедуры

Процедура ОновитьОтбор()
	
	Список.КомпоновщикНастроек.Настройки.Отбор.Элементы[0].Использование = НЕ Завершені ;
	Список.КомпоновщикНастроек.Настройки.Отбор.Элементы[1].Использование = ЗаказВидео ;
	

КонецПроцедуры

&НаКлиенте
Процедура ЗавершеніПриИзменении(Элемент)
	ОновитьОтбор();
КонецПроцедуры

&НаКлиенте
Процедура ЗаказВидеоПриИзменении(Элемент)
	ОновитьОтбор();
КонецПроцедуры
