
&НаКлиенте
Процедура ДатаНачалаПриИзменении(Элемент)
	Продажи.Параметры.УстановитьЗначениеПараметра("ДатаНачала",ДатаНачала);
	ОбновитьИтоги();
	//Продажи.Отбор.Элементы[0].ПравоеЗначение = ДатаНачала;
КонецПроцедуры

&НаКлиенте
Процедура ДатаКонецПриИзменении(Элемент)
	Продажи.Параметры.УстановитьЗначениеПараметра("ДатаКонец",КонецДня(ДатаКонец));
	ОбновитьИтоги();
	//Продажи.Отбор.Элементы[1].ПравоеЗначение = КонецДня(ДатаКонец);
КонецПроцедуры

&НаКлиенте
Процедура КнОчиститьПериод(Команда)
	ДатаНачала = '00010101'; 
	ДатаКонец = '00010101';
	Продажи.Параметры.УстановитьЗначениеПараметра("ДатаНачала",'00010101');
	Продажи.Параметры.УстановитьЗначениеПараметра("ДатаКонец",КонецДня(ТекущаяДата()));
	ОбновитьИтоги();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Продажи.Параметры.УстановитьЗначениеПараметра("ДатаНачала",'00010101');
	Продажи.Параметры.УстановитьЗначениеПараметра("ДатаКонец",КонецДня(ТекущаяДата()));
КонецПроцедуры


&НаКлиенте
Процедура КнСформировать(Команда)
	Продажи.Параметры.УстановитьЗначениеПараметра("ДатаНачала",ДатаНачала);
	Продажи.Параметры.УстановитьЗначениеПараметра("ДатаКонец",КонецДня(ДатаКонец));
	//ОбновитьИнтерфейс();
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьИтоги()
	
	св =ПолучитьДанныеДС();
	
	

    
    ВсегоСуммаПартнера = Формат(св.СуммаПартнера,"ЧДЦ=2") + " EUR.";
	ВсегоСуммаПродажи = Формат(св.СуммаПродажи,"ЧДЦ=2") + " EUR.";
	ВсегоСуммаПрибыли = Формат(св.Прибыль,"ЧДЦ=2") + " EUR.";
КонецПроцедуры

&НаСервере
Функция ПолучитьДанныеДС()
	з = Новый Запрос;
	з.Текст = Продажи.ТекстЗапроса;
	з.УстановитьПараметр("ДатаНачала",ДатаНачала);
	Если ЗначениеЗаполнено(ДатаКонец) Тогда 
		з.УстановитьПараметр("ДатаКонец",КонецДня(ДатаКонец));
	Иначе
		з.УстановитьПараметр("ДатаКонец",КонецДня(ТекущаяДата()));
	КонецЕсли;
	
	тз = з.Выполнить().Выгрузить();
	тз.Свернуть(,"СуммаПартнера,СуммаПродажи,Прибыль");
	Если тз.Количество() Тогда 
		св = Новый Структура;
		св.Вставить("СуммаПартнера",тз[0].СуммаПартнера);
		св.Вставить("СуммаПродажи",тз[0].СуммаПродажи);
		св.Вставить("Прибыль",тз[0].Прибыль);
	Иначе
		св = Новый Структура;
		св.Вставить("СуммаПартнера",0);
		св.Вставить("СуммаПродажи",0);
		св.Вставить("Прибыль",0);		
	КонецЕсли;
	Возврат св;
КонецФункции


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ДатаНачала = НачалоДня(ТекущаяДата());
	ДатаКонец = КонецДня(ТекущаяДата());
	Продажи.Параметры.УстановитьЗначениеПараметра("ДатаНачала",ДатаНачала);
	Продажи.Параметры.УстановитьЗначениеПараметра("ДатаКонец",КонецДня(ДатаКонец));
	ОбновитьИтоги();
КонецПроцедуры

