
Процедура Пактум_Контрагенты_ПриОткрытии(пФорма) Экспорт
	
	пФорма.ЭлементыФормы.ДекорацияЗаполнитьПоЕГРПОУ.Ширина=пФорма.ЭлементыФормы.ЗаполнитьПоЕГРПОУ.Ширина;
	пФорма.ЭлементыФормы.ДекорацияЗаполнитьПоЕГРПОУ.Лево=пФорма.ЭлементыФормы.ЗаполнитьПоЕГРПОУ.Лево;
	пФорма.ЭлементыФормы.ДекорацияЗаполнитьПоЕГРПОУ1.Ширина=пФорма.ЭлементыФормы.ЗаполнитьПоЕГРПОУ1.Ширина;	
	пФорма.ЭлементыФормы.ДекорацияЗаполнитьПоЕГРПОУ1.Лево=пФорма.ЭлементыФормы.ЗаполнитьПоЕГРПОУ1.Лево;	
	пФорма.ЭлементыФормы.ДекорацияЗаполнитьПоЕГРПОУ.Видимость=Ложь;
	пФорма.ЭлементыФормы.ДекорацияЗаполнитьПоЕГРПОУ1.Видимость=Ложь;
	пФорма.КнопкаОткрыть=НСтр("ru = 'Открыть'; uk = 'Відкрити'");
	пФорма.КнопкаОбновить=НСтр("ru = 'Заполнить'; uk = 'Заповнити'");
	пФорма.КнопкаОтмена=НСтр("ru = 'Отменить'; uk = 'Відмінити'");
	
КонецПроцедуры

Процедура РазблокироватьФорму(Парам) Экспорт
	
	Если Парам.ФизЛицо Тогда
		Парам.Форма.ЭлементыФормы.ЗаполнитьПоЕГРПОУ1.Видимость=Истина;
		Парам.Форма.ЭлементыФормы.ДекорацияЗаполнитьПоЕГРПОУ1.Видимость=Ложь;
	Иначе
		Парам.Форма.ЭлементыФормы.ЗаполнитьПоЕГРПОУ.Видимость=Истина;
		Парам.Форма.ЭлементыФормы.ДекорацияЗаполнитьПоЕГРПОУ.Видимость=Ложь;
	КонецЕсли;
	
	Парам.Форма.Обновить();
	
КонецПроцедуры

Процедура Лого_Нажатие() Экспорт
	ЗапуститьПриложение("http://pactumsys.com");
КонецПроцедуры

Процедура Sleep(сек) Экспорт
	нач=ТекущаяДата();
	Пока ТекущаяДата() - нач < сек Цикл
	КонецЦикла;    
КонецПроцедуры
