Перем мОснование;
Перем мОбменАндроид Экспорт;


// Обработчик события ПриКопировании
//
Процедура ПриКопировании(ОбъектКопирования)

	Если НЕ ЭтотОбъект.ЭтоГруппа Тогда
		ЭтотОбъект.ОсновнойДоговорКонтрагента = Неопределено;
		ЭтотОбъект.ОсновнойБанковскийСчет     = Неопределено;
	КонецЕсли;

КонецПроцедуры

// Функция возвращает результат запроса по справочнику контрагентов с заданным головным контрагентом
//
// Параметры:
//  ГоловнойКонтрагент - заданный головной контрагент
//
// Возвращаемое значение:
//  Результат - результат работы запроса
// 
Функция ПолучитьКонтрагентовПоЗаданномуГоловномуКонтрагенту(ГоловнойКонтрагент) Экспорт
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("ГоловнойКонтрагент", ГоловнойКонтрагент);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Контрагенты.Ссылка КАК Контрагент
	|ИЗ
	|	Справочник.Контрагенты КАК Контрагенты
	|
	|ГДЕ
	|	Контрагенты.ГоловнойКонтрагент = &ГоловнойКонтрагент
	|
	|УПОРЯДОЧИТЬ ПО
	|	Контрагент";
	
	Результат = Запрос.Выполнить();
	
	Возврат Результат;
	
КонецФункции // ПолучитьКонтрагентовПоЗаданномуГоловномуКонтрагенту()

// Процедура - обработчик события "ОбработкаЗаполнения".
//
Процедура ОбработкаЗаполнения(Основание)

	Если ТипЗнч(Основание) = Тип("СправочникСсылка.Организации") Тогда
		
		Наименование           = Основание.Наименование;
		ЮрФизЛицо              = Основание.ЮрФизЛицо;
		НаименованиеПолное     = Основание.НаименованиеПолное;
		ОсновнойБанковскийСчет = Основание.ОсновнойБанковскийСчет;
		ИНН                    = Основание.ИНН;
		КодПоЕДРПОУ			   = Основание.КодПоЕДРПОУ;
		мОснование             = Основание;
		
	КонецЕсли;

КонецПроцедуры // ОбработкаЗаполнения()

Процедура ПередЗаписью(Отказ)
	Перем мСсылкаНового;
	
	ДополнительныеСвойства.Вставить("ЭтоНовый", ЭтоНовый());

	Если НЕ ОбменДанными.Загрузка Тогда
		
		// Проверим основной вид деятельности контрагента
		Если ЗначениеЗаполнено(ОсновнойВидДеятельности) И ВидыДеятельности.Найти(ОсновнойВидДеятельности, "ВидДеятельности") = Неопределено Тогда
			ОсновнойВидДеятельности = Справочники.ВидыДеятельностиКонтрагентов.ПустаяСсылка();
		КонецЕсли;
		
		НастройкаПравДоступа.ПередЗаписьюНовогоОбъектаСПравамиДоступаПользователей(ЭтотОбъект, Отказ, Родитель, мСсылкаНового);
		
		// установим головного контрагента если он не заполнен
		Если НЕ ЭтоГруппа Тогда
			Если НЕ ЗначениеЗаполнено(ГоловнойКонтрагент) Тогда
				Если ЭтоНовый() Тогда
					ГоловнойКонтрагент = мСсылкаНового;
				Иначе
					ГоловнойКонтрагент = Ссылка;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		Если НЕ ЭтоГруппа Тогда 
			НомерТелефона = ОбработкаНомераТелефона(НомерТелефона);
			Если НЕ мОбменАндроид И ЗначениеЗаполнено(НомерТелефона) Тогда 
//ЗаписьЖурналаРегистрации("НОМЕР_ТЕЛЕФОНА", УровеньЖурналаРегистрации.Информация, ,,НомерТелефона);
				УникальностьНомераТелефона(НомерТелефона, Отказ);
			КонецЕсли;
			
			Для Каждого Стр Из ДополнительныеНомераТелефонов Цикл
				Стр.Номер = ОбработкаНомераТелефона(Стр.Номер);
				Если НЕ мОбменАндроид И ЗначениеЗаполнено(НомерТелефона) Тогда
					//ЗаписьЖурналаРегистрации("НОМЕР_ТЕЛЕФОНА", УровеньЖурналаРегистрации.Информация, ,,НомерТелефона);

					УникальностьНомераТелефона(Стр.Номер, Отказ);
				КонецЕсли;	
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЕсли;
	
	//++
	Если ЭтоНовый()
		И НЕ ЭтоГруппа
		И Не ЗначениеЗаполнено(ДатаСоздания) Тогда
		ДатаСоздания = ТекущаяДата();
	КонецЕсли;	
	//++
	
	Если НЕ Отказ Тогда 
		Если ЗначениеЗаполнено(Ссылка) Тогда 
			Общий.ЗаписЖурналРеєстраціїЗіСтекомВикликів("ЗмінаНазвиКонтрагента", "" +  Ссылка.Наименование + " - " + Наименование + " + " + Ссылка.ДатаОновлення + " - " + ДатаОновлення);			
			Если НЕ ЭтоНовый() Тогда 
				КонтрольВерсийПерезапису();
			КонецЕсли;		
		КонецЕсли;	
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	
	Если НЕ ОбменДанными.Загрузка Тогда
		Если ЗначениеЗаполнено(НомерТелефона) Тогда 
			Отказ = НЕ Общий.КонтрольУникальностиПоРеквизиту(ЭтотОбъект, "НомерТелефона");
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ГоловнойКонтрагент) И ГоловнойКонтрагент <> Ссылка Тогда
			
			Если ЗначениеЗаполнено(ГоловнойКонтрагент.ГоловнойКонтрагент) И ГоловнойКонтрагент.ГоловнойКонтрагент <> ГоловнойКонтрагент Тогда
				ОбщегоНазначения.СообщитьОбОшибке("Контрагент "+СокрЛП(ГоловнойКонтрагент)+" не может быть выбран головным, 
								|так как для него уже был назначен головной контрагент "+СокрЛП(ГоловнойКонтрагент.ГоловнойКонтрагент)+"!");
				Отказ = Истина;
				Возврат;
			Иначе
				
				// надо проверить, что если указываем головного контрагента, то этот элемент уже не был установлен
				// в качестве головного у другого контрагента.
				ВыборкаПоГоловномуКонтрагенту = ПолучитьКонтрагентовПоЗаданномуГоловномуКонтрагенту(Ссылка).Выбрать();
				Если ВыборкаПоГоловномуКонтрагенту.Количество() <> 0 Тогда
					
					СообщениеОНевозможностиЗаписи = "Контрагент "+СокрЛП(ЭтотОбъект)+" не может иметь головного контрагента!
													|Этот контрагент уже установлен головным для: ";
					Пока ВыборкаПоГоловномуКонтрагенту.Следующий() Цикл
						СообщениеОНевозможностиЗаписи = СообщениеОНевозможностиЗаписи + Символы.ПС + СокрЛП(ВыборкаПоГоловномуКонтрагенту.Контрагент);
					КонецЦикла;
					
					ОбщегоНазначения.СообщитьОбОшибке(СообщениеОНевозможностиЗаписи);
					Отказ = Истина;
					Возврат;
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(мОснование) Тогда
			НаборЗаписей = РегистрыСведений.СобственныеКонтрагенты.СоздатьНаборЗаписей();
			ЗаписьРегистра = НаборЗаписей.Добавить();
			ЗаписьРегистра.Контрагент = Ссылка;
			ЗаписьРегистра.ВидСвязи   = Перечисления.ВидыСобственныхКонтрагентов.Организация;
			ЗаписьРегистра.Объект     = мОснование;
			НаборЗаписей.Записать(Ложь);
			мОснование = "";
		КонецЕсли;
		
		
	КонецЕсли;
	
	Если Не ОбменДанными.Загрузка И Не ЭтоГруппа И НЕ Отказ Тогда
		ЭтоНовый = Ложь;
		
		Если ДополнительныеСвойства.Свойство("ЭтоНовый", ЭтоНовый) 
				И ЭтоНовый = Истина Тогда 
			Продавец = Неопределено;
		Иначе
			ДополнительныеСвойства.Свойство("ТорговыйАгент", Продавец);
		КонецЕсли;
		
		ОбменАндроид.ЗарегистрироватьОбъектОбменАндроид(Ссылка,, Продавец);

	КонецЕсли;
	Если НЕ Отказ И НЕ ЭтоГруппа Тогда 
		ОновитиНомераТелефонівКонтрагента();
	КонецЕсли;
	
	
КонецПроцедуры

Процедура ОновитиНомераТелефонівКонтрагента()
	нз = РегистрыСведений.РеєстрНомерівТелефонів.СоздатьНаборЗаписей();
	нз.Отбор.Контрагент.Установить(Ссылка);
	нз.Прочитать();
	НомериВідповідають = Истина;
	СЗ = Новый Массив;
	Для Каждого Стр Из нз Цикл
		СЗ.Добавить(Стр.Телефон);
		Если Стр.Телефон <> НомерТелефона И ДополнительныеНомераТелефонов.Найти(Стр.Телефон, "Номер") = Неопределено Тогда 
			НомериВідповідають = Ложь;
			Прервать;
		КонецЕсли;	
	КонецЦикла;
	
	Если НомериВідповідають И ЗначениеЗаполнено(НомерТелефона) Тогда 
		Если СЗ.Найти(НомерТелефона) = Неопределено Тогда 
			НомериВідповідають = Ложь;
		КонецЕсли;	
	КонецЕсли;
	
	Если НомериВідповідають Тогда
		Для Каждого Стр Из ДополнительныеНомераТелефонов Цикл
			Если СЗ.Найти(Стр.Номер) = Неопределено Тогда 
				НомериВідповідають = Ложь;
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Если НЕ НомериВідповідають Тогда 
		нз.Очистить();
		Если ЗначениеЗаполнено(НомерТелефона) Тогда 
			НовСтр = нз.Добавить();
			НовСтр.Контрагент = Ссылка;
			НовСтр.Телефон = НомерТелефона;
		КонецЕсли;
		Для Каждого Стр Из ДополнительныеНомераТелефонов Цикл
			Если Стр.Номер <> НомерТелефона Тогда 
				НовСтр = нз.Добавить();
				НовСтр.Контрагент = Ссылка;
				НовСтр.Телефон = Стр.Номер;
			КонецЕсли;
		КонецЦикла;
		нз.Записать();
	КонецЕсли;
	

	
	
КонецПроцедуры

Процедура УникальностьНомераТелефона(НомерДляПроверки, Отказ) Экспорт
	
	Если ЭтоГруппа Тогда 
		Возврат;
	КонецЕсли;	
	
	НовыйТелефон = ОбработкаНомераТелефона(НомерДляПроверки);
	ЗапросНомеров = Новый Запрос;
	Если ЭтоНовый() Тогда 
		ЗапросНомеров.Текст = 
		"ВЫБРАТЬ
		|	Контрагенты.НомерТелефона,
		|	Контрагенты.Ссылка КАК Контрагент
		|ИЗ
		|	Справочник.Контрагенты КАК Контрагенты
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	КонтрагентыДополнительныеНомераТелефонов.Номер,
		|	КонтрагентыДополнительныеНомераТелефонов.Ссылка
		|ИЗ
		|	Справочник.Контрагенты.ДополнительныеНомераТелефонов КАК КонтрагентыДополнительныеНомераТелефонов";
	Иначе 
		ЗапросНомеров.Текст = 
		"ВЫБРАТЬ
		|	Контрагенты.НомерТелефона,
		|	Контрагенты.Ссылка КАК Контрагент
		|ИЗ
		|	Справочник.Контрагенты КАК Контрагенты
		|ГДЕ
		|	Контрагенты.Ссылка <> &Ссылка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	КонтрагентыДополнительныеНомераТелефонов.Номер,
		|	КонтрагентыДополнительныеНомераТелефонов.Ссылка
		|ИЗ
		|	Справочник.Контрагенты.ДополнительныеНомераТелефонов КАК КонтрагентыДополнительныеНомераТелефонов
		|ГДЕ
		|	КонтрагентыДополнительныеНомераТелефонов.Ссылка <> &Ссылка";
		ЗапросНомеров.УстановитьПараметр("Ссылка", Ссылка);
	КонецЕсли;
	
	ТЗНомера = ЗапросНомеров.Выполнить().Выгрузить();
	Для Каждого СтрНомер Из ТЗНомера Цикл 
		Если (НовыйТелефон <> "") И (НовыйТелефон = СтрНомер.НомерТелефона) Тогда 
			Отказ = Истина;
			ВызватьИсключение "Номер телефону контрагента не унікальний! " + СтрНомер.Контрагент + " ,Номер: " + НовыйТелефон;
		КонецЕсли;	
	КонецЦикла;	
	
КонецПроцедуры	

Функция ОбработкаНомераТелефона(Телефон) Экспорт 
	
	Если ЭтоГруппа Тогда
		Возврат "";
	КонецЕсли;		
	
	Телефон = СтрЗаменить(Телефон,")","");
	Телефон = СтрЗаменить(Телефон,"(","");
	Телефон = СтрЗаменить(Телефон,"+38","");
	Телефон = СтрЗаменить(Телефон,"-","");
	Телефон = СтрЗаменить(Телефон,"_","");
	Телефон = СтрЗаменить(Телефон,".","");
	Телефон = СтрЗаменить(Телефон,",","");
	Телефон = СтрЗаменить(Телефон,"}","");
	Телефон = СтрЗаменить(Телефон,"{","");
	Телефон = СтрЗаменить(Телефон,"=","");
	Телефон = СтрЗаменить(Телефон," ","");
	Телефон = СтрЗаменить(Телефон,":","");
	Если СтрДлина(Телефон) > 13 Тогда 
		Если Сред(СокрЛП(Телефон),1,3) = "+38" Тогда
			Телефон = Сред(СокрЛП(Телефон),3);
		КонецЕсли;	
	ИначеЕсли СтрДлина(Телефон) = 12 Тогда 		
		Телефон = Прав(Телефон, 10); 
	КонецЕсли;
	
	Возврат СокрЛП(Телефон);
	
КонецФункции

Процедура КонтрольВерсийПерезапису()
	Если НЕ ЭтоНовый() И Не ЭтоГруппа И Ссылка.ДатаОновлення > ДатаОновлення Тогда 
		СтрСохр = Новый Структура;
		СтрСохр.Вставить("КоличествоДнейОтПоследнейПокупки", КоличествоДнейОтПоследнейПокупки);		
			
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, Ссылка, , "Владелец");
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, СтрСохр);
		
		Наименование = Ссылка.Наименование;
		
		ДополнительныеНомераТелефонов.Очистить();
		Для Каждого Стр Из Ссылка.ДополнительныеНомераТелефонов Цикл
			НовСтр = ДополнительныеНомераТелефонов.Добавить();
			ЗаполнитьЗначенияСвойств(НовСтр, Стр);
		КонецЦикла;
		
		Маршруты.Очистить();
		Для Каждого Стр Из Ссылка.Маршруты Цикл
			НовСтр = Маршруты.Добавить();
			ЗаполнитьЗначенияСвойств(НовСтр, Стр);
		КонецЦикла;
		
		Асортимент.Очистить();
		Для Каждого Стр Из Ссылка.Асортимент Цикл
			НовСтр = Асортимент.Добавить();
			ЗаполнитьЗначенияСвойств(НовСтр, Стр);
		КонецЦикла;

		БанковскиеСчетаДляОплаты.Очистить();
		Для Каждого Стр Из Ссылка.БанковскиеСчетаДляОплаты Цикл
			НовСтр = БанковскиеСчетаДляОплаты.Добавить();
			ЗаполнитьЗначенияСвойств(НовСтр, Стр);
		КонецЦикла;

		АсортиментПрезентацій.Очистить();
		Для Каждого Стр Из Ссылка.АсортиментПрезентацій Цикл
			НовСтр = АсортиментПрезентацій.Добавить();
			ЗаполнитьЗначенияСвойств(НовСтр, Стр);
		КонецЦикла;		
		
	КонецЕсли;
	
КонецПроцедуры



мОбменАндроид = Ложь;