Перем мПериод          Экспорт; // Период движений
Перем мТаблицаДвижений Экспорт; // Таблица движений
Перем мКонтрольАкций   Экспорт;
Перем мДопСекунд	   Экспорт;
Перем ОчисткаРегистра;

// Выполняет движения по регистру.
//
// Параметры:
//  Нет.
//
Процедура ВыполнитьДвижения() Экспорт

	мТаблицаДвижений.ЗаполнитьЗначения( мПериод, "Период");
	мТаблицаДвижений.ЗаполнитьЗначения( Истина,  "Активность");

	ОбщегоНазначения.ВыполнитьДвижениеПоРегистру(ЭтотОбъект);

КонецПроцедуры // ВыполнитьДвижения()

Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ДополнительныеСвойства.Свойство("УстановкаАкций") Тогда 
		Возврат;
	КонецЕсли;
	
	Если Не ЭтотОбъект.Количество() Тогда 
		
		ЭтотОбъект.Прочитать();
		ОчисткаРегистра = ЭтотОбъект.Выгрузить();
		ЭтотОбъект.Очистить();
		Возврат;
	КонецЕсли;
	
		
	
	//НаборЗаписей = ЭтотОбъект.Выгрузить();	
	//
	//ЦенаПродажиВес = Справочники.ТипыЦенНоменклатуры.ЦенаПродажиВес;
	//ПродажБезАкций = Справочники.ТипыЦенНоменклатуры.ПродажБезАкций;
	//
	//
	//Для Каждого Строка Из НаборЗаписей Цикл 
	//	
	//	Если Строка.ТипЦен <> ЦенаПродажиВес Тогда 
	//		Продолжить;
	//	КонецЕсли;
	//	
	//	нСтр = ЭтотОбъект.Добавить();
	//	ЗаполнитьЗначенияСвойств(нСтр,Строка);
	//	нСтр.ТипЦен = ПродажБезАкций;
	//	
	//КонецЦикла;
	
	//КонтрольАкцій(ЭтотОбъект.Выгрузить());
	
КонецПроцедуры


//Процедура ПерезаписатиАкції(ЦеныНоменклатуры)
//	
//	Запрос = Новый Запрос;
//	Запрос.Текст = 
//	"ВЫБРАТЬ
//	|	ЦеныНоменклатуры.ТипЦен,
//	|	ЦеныНоменклатуры.Номенклатура,
//	|	ЦеныНоменклатуры.Период
//	|ПОМЕСТИТЬ Цены
//	|ИЗ
//	|	&ЦеныНоменклатуры КАК ЦеныНоменклатуры
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|ВЫБРАТЬ
//	|	УстановкаАкцийТовары.Номенклатура КАК Номенклатура,
//	|	УстановкаАкцийТовары.Номенклатура.Артикул КАК Артикул,
//	|	УстановкаАкцийТовары.Ссылка КАК Ссылка,
//	|	КОНЕЦПЕРИОДА(УстановкаАкцийТовары.Ссылка.ДатаОкончания, ДЕНЬ) КАК ДатаОкончания
//	|ИЗ
//	|	Документ.УстановкаАкций.Товары КАК УстановкаАкцийТовары
//	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Цены КАК Цены
//	|		ПО  УстановкаАкцийТовары.Номенклатура = Цены.Номенклатура
//	|			И (КОНЕЦПЕРИОДА(УстановкаАкцийТовары.Ссылка.ДатаОкончания, ДЕНЬ) > Цены.Период) И (Цены.ТипЦен = &ТипЦен)

//	|ГДЕ
//	|	УстановкаАкцийТовары.Ссылка.Проведен
//	|
//	|СГРУППИРОВАТЬ ПО
//	|	УстановкаАкцийТовары.Номенклатура,
//	|	УстановкаАкцийТовары.Номенклатура.Артикул,
//	|	УстановкаАкцийТовары.Ссылка,
//	|	КОНЕЦПЕРИОДА(УстановкаАкцийТовары.Ссылка.ДатаОкончания, ДЕНЬ)
//	|ИТОГИ
//	|	МАКСИМУМ(ДатаОкончания)
//	|ПО
//	|	Ссылка";
//	
//	Запрос.УстановитьПараметр("ЦеныНоменклатуры", ЦеныНоменклатуры);
//	Запрос.УстановитьПараметр("ТипЦен", Справочники.ТипыЦенНоменклатуры.ПродажБезАкций);

//	Выборка = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
//	ТекстОшибки = ""; 	
//	Пока Выборка.Следующий() Цикл
//		ДокументУстановкаАкции = Выборка.Ссылка.ПолучитьОбъект();
//		ВыборкаДетали = Выборка.Выбрать();
//		Пока ВыборкаДетали.Следующий() Цикл 
//			Строка = ДокументУстановкаАкции.товары.Найти(ВыборкаДетали.Номенклатура, "Номенклатура");
//			Если Строка = Неопределено Тогда 
//				Продолжить;
//			КонецЕсли;
//			Строка.Цена = Ценообразование.ПолучитьЦенуНоменклатуры(ВыборкаДетали.Номенклатура,, Справочники.ТипыЦенНоменклатуры.ПродажБезАкций, ВыборкаДетали.ДатаОкончания); 
//		КонецЦикла;
//		ДокументУстановкаАкции.ЗАписать(РежимЗаписиДокумента.Проведение);		
//	КонецЦикла;

//КонецПроцедуры


//Процедура КонтрольАкцій(ЦеныНоменклатуры)
//	Удалить = Новый Массив;
//	Запрос = Новый Запрос;
//	Запрос.Текст = 
//	"ВЫБРАТЬ
//	|	ЦеныНоменклатуры.ТипЦен,
//	|	ЦеныНоменклатуры.Номенклатура,
//	|	ЦеныНоменклатуры.Период
//	|ПОМЕСТИТЬ Цены
//	|ИЗ
//	|	&ЦеныНоменклатуры КАК ЦеныНоменклатуры
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|ВЫБРАТЬ
//	|	УстановкаАкцийТовары.Номенклатура КАК Номенклатура,
//	|	Цены.ТипЦен,
//	|	УстановкаАкцийТовары.Ссылка.ДатаНачала
//	|ИЗ
//	|	Документ.УстановкаАкций.Товары КАК УстановкаАкцийТовары
//	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Цены КАК Цены
//	|		ПО УстановкаАкцийТовары.Ссылка.ТипЦен = Цены.ТипЦен
//	|			И УстановкаАкцийТовары.Номенклатура = Цены.Номенклатура
//	|			И (КОНЕЦПЕРИОДА(УстановкаАкцийТовары.Ссылка.ДатаОкончания, ДЕНЬ) > Цены.Период) И УстановкаАкцийТовары.Ссылка.ДатаНачала <  Цены.Период

//	|			И (Цены.ТипЦен = &ТипЦен)
//	|ГДЕ
//	|	УстановкаАкцийТовары.Ссылка.Проведен
//	|
//	|СГРУППИРОВАТЬ ПО
//	|	УстановкаАкцийТовары.Номенклатура,
//	|	УстановкаАкцийТовары.Ссылка,
//	|	КОНЕЦПЕРИОДА(УстановкаАкцийТовары.Ссылка.ДатаОкончания, ДЕНЬ),
//	|	Цены.ТипЦен";
//	
//	Запрос.УстановитьПараметр("ЦеныНоменклатуры", ЦеныНоменклатуры);
//	Запрос.УстановитьПараметр("ТипЦен", Справочники.ТипыЦенНоменклатуры.ЦенаПродажиВес);

//	Выборка = Запрос.Выполнить().Выбрать();
//	ТекстОшибки = ""; 	
//	
//	Пока Выборка.Следующий() Цикл
//		
//		Для Каждого Стр Из ЦеныНоменклатуры.НайтиСтроки(Новый Структура("ТипЦен, Номенклатура", Выборка.ТипЦен, Выборка.Номенклатура)) Цикл	
//			Удалить.Добавить(Стр);
//		КонецЦикла;
//		
//	КонецЦикла;
//	
//	Для Каждого Стр Из Удалить Цикл 
//		ЦеныНоменклатуры.Удалить(Стр);
//	КонецЦикла;
//	ЭтотОбъект.Загрузить(ЦеныНоменклатуры);
//КонецПроцедуры


Процедура ПриЗаписи(Отказ, Замещение)
	
	Если ДополнительныеСвойства.Свойство("УстановкаАкций") Тогда 
		Возврат;
	КонецЕсли;

	Данные = ?(ТипЗнч(ОчисткаРегистра) = Тип("ТаблицаЗначений") , ОчисткаРегистра, ЭтотОбъект.Выгрузить());
	
	//ПерезаписатиАкції(Данные);
	
КонецПроцедуры


мКонтрольАкций = Ложь;
мДопСекунд = 1;