

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)

	Если НЕ ЭтоНовый() И Дата < НачалоДня(ТекущаяДата()) Тогда 
		Отказ = Истина;
		Предупреждение("Можна міняти лише сьогоднышный документ. Створіть новий!");
	КонецЕсли;
	
	
	Если ПараметрыСеанса.ТекущийПользователь = Справочники.Пользователи.НайтиПоКоду("Intrata                                           ") Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ПометкаУдаления Тогда 
		Для Каждого Строка Из Товары Цикл
			
			БылоВидеоДоЗаписи = Строка.ХарактеристикаНоменклатуры.ЕстьВидео;
		
			Объект 				   = Строка.ХарактеристикаНоменклатуры.Ссылка.ПолучитьОбъект();
			Объект.ЕстьВидео 	   = Строка.ЕстьВидео;
			Объект.Открыт 		   = Строка.Открыт;
			Объект.Целевой         = Строка.Целевой;
			Объект.СсылкаНаYouTube = Строка.СсылкаНаYouTube;
			Объект.Описание        = Строка.Описание;
			Объект.Бронь           = Строка.Бронь;
			Объект.ПериодБрони     = КонецДня(Строка.ПериодБрони);
			Объект.Контрагент      = Строка.Контрагент;
			Объект.СекторНаСкладі  = Строка.СекторНаСкладі;
			Объект.Коментар		   = Строка.Коментар;
			Объект.Ефір            = Строка.Ефір;
			Объект.ЕфірНаДоставку  = Строка.ЕфірНаДоставку;
			
			ОбЪект.Записать();  			
			
			Если Строка.ЕстьВидео Тогда
				Если Не БылоВидеоДоЗаписи Тогда
					Если ЗначениеЗаполнено(Строка.Контрагент) Тогда		
						Если ЗначениеЗаполнено(Строка.Бронь) Тогда							
							ЗаписьОчереди = РегистрыСведений.ОчередьНапоминанийСДействием.СоздатьМенеджерЗаписи();
							ЗаписьОчереди.ТорговыйАгент = Строка.Бронь;
							ЗаписьОчереди.КонтрагентДляДействий	= Строка.Контрагент;							
							ЗаписьОчереди.ХарактеристикаДляДействий = Строка.ХарактеристикаНоменклатуры;
							ЗаписьОчереди.ТипДействяПриНапоминании = Перечисления.ТипыДействийПриНапоминании.ОтправкаСообщенияВайберОВидео;
							ЗаписьОчереди.ПериодДобавления = ТекущаяДата();
							ЗаписьОчереди.Записать();
							ТекстСообщения = "Додано нагадування що з'явилось відео по " + Строка(Строка.Бронь) + " артикулу " + Строка(Строка.ХарактеристикаНоменклатуры.Владелец.Артикул) + " мішка " + Строка(Строка.ХарактеристикаНоменклатуры) + " на контрагента " + Строка(Строка.Контрагент);
							Сообщить(ТекстСообщения); 
   							ЗаписьЖурналаРегистрации("Добавлено нагадування", УровеньЖурналаРегистрации.Информация,,,ТекстСообщения, РежимТранзакцииЗаписиЖурналаРегистрации.Транзакционная);							
						КонецЕсли;	
					КонецЕсли; 					
				КонецЕсли;	
			КонецЕсли;	
			
			
		КонецЦикла;		
	    Проведен = Истина;
	КонецЕсли;
	
	
КонецПроцедуры


Процедура ПриЗаписи(Отказ)
	
	Если ПараметрыСеанса.ТекущийПользователь = Справочники.Пользователи.НайтиПоКоду("Intrata                                           ") Тогда
		Возврат;
	КонецЕсли;

	
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	
		Движения.ІсторіяЗміниСтануМішка.Записывать = Истина;
		Движения.ІсторіяЗміниСтануМішка.Очистить();
		Для Каждого Ряд Из Товары Цикл
			Рух = Движения.ІсторіяЗміниСтануМішка.Добавить();
			Рух.Активность = Истина;
			Рух.Период = ТекущаяДата();
			Рух.Бронь = Ряд.Бронь;
			Рух.ЕстьВидео = Ряд.ЕстьВидео;
			Рух.Ефір = Ряд.Ефір;
			Рух.ЕфірНаДоставку = Ряд.ЕфірНаДоставку;
			Рух.Коментар = Ряд.Коментар;
			Рух.Контрагент = Ряд.Контрагент;
			Рух.Описание = Ряд.Описание;
			Рух.Открыт = Ряд.Открыт;
			Рух.ПериодБрони = Ряд.ПериодБрони;
			Рух.Регистратор = Ссылка;
			Рух.СекторНаСкладі = Ряд.СекторНаСкладі;
			Рух.СсылкаНаYouTube = Ряд.СсылкаНаYouTube;
			Рух.ХарактеристикаНоменклатури = Ряд.ХарактеристикаНоменклатуры;
			Рух.Целевой = Ряд.Целевой;
			Рух.Штрихкод = Ряд.Штрихкод;
			Рух.Дата = Дата;
			Рух.Відповідальний = ПараметрыСеанса.ТекущийПользователь;
		КонецЦикла;
		Движения.ІсторіяЗміниСтануМішка.Записать();

	
		// Сектори
	Движения.Сектори.Записывать = Истина;
	Движения.Сектори.Очистить();

	Для Каждого Стр Из Товары Цикл
			Если ПустаяСтрока(Стр.СекторНаСкладі) Тогда 
				Продолжить;
			КонецЕсли;

		Движение = Движения.Сектори.Добавить();
		Движение.Период = Дата;
		Движение.ХарактеристикаНоменклатуры = Стр.ХарактеристикаНоменклатуры;
		Движение.Сектор =  ОблікСекторів.ОтриматиСектор(Стр.СекторНаСкладі);
	КонецЦикла;

КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	Для Каждого Объект Из Товары Цикл
			Строка 				   = Объект.ХарактеристикаНоменклатуры;
			Объект.ЕстьВидео 	   = Строка.ЕстьВидео;
			Объект.Открыт 		   = Строка.Открыт;
			Объект.Целевой         = Строка.Целевой;
			Объект.СсылкаНаYouTube = Строка.СсылкаНаYouTube;
			Объект.Описание        = Строка.Описание;
			Объект.Бронь           = Строка.Бронь;
			Объект.ПериодБрони     = КонецДня(Строка.ПериодБрони);
			Объект.Контрагент      = Строка.Контрагент;
			Объект.СекторНаСкладі  = Строка.СекторНаСкладі;
			Объект.Коментар		   = Строка.Коментар;
			Объект.Ефір            = Строка.Ефір;
			Объект.ЕфірНаДоставку  = Строка.ЕфірНаДоставку;
	КонецЦикла;	
КонецПроцедуры




