
Процедура ПриЗаписи(Отказ, Замещение)
	
	Для Каждого Элемент из ЭтотОбъект Цикл
		
		Данные = Новый Структура;
		Данные.Вставить("УИДСообшения", Элемент.Уид_Сообщения);
		Данные.Вставить("Получатель", Элемент.Одержувач);
		Данные.Вставить("Отправитель", Элемент.Відправник);
		Данные.Вставить("ТекстСообщения", Элемент.Повідомлення);
		
		Параметры = Новый Массив;
		Параметры.Добавить("НовоеСообщение");
		Параметры.Добавить(Данные);
		
		ФоновоеЗадания = ФоновыеЗадания.Выполнить("МодульPushУведомлений.ОтправитьPushУведомления", Параметры, Элемент.Уид_Сообщения); 		
		// МодульPushУведомлений.ОтправитьPushУведомления("НовоеСообщение", Данные);

	КонецЦикла;
	
	
КонецПроцедуры
