
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Контрагенты")Тогда
		Для Каждого Стр из Параметры.Контрагенты Цикл
			Нстр = СписокКонтрагентов.Добавить();
			Нстр.Контрагент = Стр;
		КонецЦикла;
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьВайбер(Команда)
	
	Если НЕ ЗначениеЗаполнено(НовоеСообщение) И Не ЗначениеЗаполнено(ВыбратьФайл) Тогда
		 #Если МобильноеПриложениеКлиент Тогда
			 Текст = "Вкажіть файл або введіть текст";  
			 СредстваМультимедиа.ВоспроизвестиТекст(Текст,,,,,Истина);
		 #Иначе
			 Текст = "Вкажіть файл або введіть текст";
			 Сообщить(Текст);
		 #КонецЕсли
	Иначе	 
		
		СписокПолучателей = ПолучитьСписокКлиентов();
		ViberОбновлениеКлиент.ОтправитьСообщенияСКлиента(СписокПолучателей, НовоеСообщение, ВыбратьФайл);			
	КонецЕсли;
	
	Закрыть();
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСписокКлиентов()
	
	МассивКонтрагентов = Новый Массив;
	
	Для Каждого Строка из СписокКонтрагентов Цикл
		МассивКонтрагентов.Добавить(Строка.Контрагент);		
    КонецЦикла;
	
	Возврат МассивКонтрагентов;
	
КонецФункции	

&НаКлиенте
Процедура ВыбратьФайлНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	
	Если Диалог.Выбрать() Тогда
    	ВыбратьФайл = Диалог.ПолноеИмяФайла;
	КонецЕсли; 	
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьФайлОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	
	
	Если НЕ ЗначениеЗаполнено(НовоеСообщение) И Не ЗначениеЗаполнено(ВыбратьФайл) Тогда
		 #Если МобильноеПриложениеКлиент Тогда
			 Текст = "Вкажіть файл або введіть текст";  
			 СредстваМультимедиа.ВоспроизвестиТекст(Текст,,,,,Истина);
		 #Иначе
			 Текст = "Вкажіть файл або введіть текст";
			 Сообщить(Текст);
		 #КонецЕсли
	Иначе	 
		
		СписокПолучателей = ПолучитьСписокКлиентов();
		ViberОбновлениеКлиент.ОтправитьСообщенияСКлиента(СписокПолучателей, НовоеСообщение, ВыбратьФайл);			
	КонецЕсли;
	
	
	
КонецПроцедуры

&НаКлиенте
Процедура НовоеСообщениеОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	
	
	Если НЕ ЗначениеЗаполнено(НовоеСообщение) И Не ЗначениеЗаполнено(ВыбратьФайл) Тогда
		 #Если МобильноеПриложениеКлиент Тогда
			 Текст = "Вкажіть файл або введіть текст";  
			 СредстваМультимедиа.ВоспроизвестиТекст(Текст,,,,,Истина);
		 #Иначе
			 Текст = "Вкажіть файл або введіть текст";
			 Сообщить(Текст);
		 #КонецЕсли
	Иначе	 
		
		СписокПолучателей = ПолучитьСписокКлиентов();
		ViberОбновлениеКлиент.ОтправитьСообщенияСКлиента(СписокПолучателей, НовоеСообщение, ВыбратьФайл);			
	КонецЕсли;
	
	
КонецПроцедуры

&НаКлиенте
Процедура НовоеСообщениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Оповещение = Новый ОписаниеОповещения("ОткрытьПараметрыЗавершениеПроцент", ЭтотОбъект);
    ОткрытьФорму("Справочник.ШаблоныСообщений.Форма.ФормаВыбора", , , , , , Оповещение, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьПараметрыЗавершениеПроцент(Результат, ДополнительныеПараметры) Экспорт

	Если ЗначениеЗаполнено(Результат) Тогда
		НовоеСообщение = ПолучитьТекст(Результат);
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция ПолучитьТекст(Результат)
	
	Возврат Результат.Текст;
	
КонецФункции	

