Перем мЭтоОбмен Экспорт;



Процедура ПриЗаписи(Отказ)
	
	Если мЭтоОбмен <> Истина Тогда 
		//Если ДополнительныеСвойства.ЭтоНовый Тогда 
			Общий.ЗарегистрироватьИзменения(ЭтотОбъект.Ссылка);
		//КонецЕсли;
	КонецЕсли;

	
КонецПроцедуры


Процедура ПередЗаписью(Отказ)
	Если ЭтоНовый() Тогда
		Если Не ЗначениеЗаполнено(ДатаСоздания) Тогда
			ДатаСоздания = ТекущаяДата();
		КонецЕсли;	
	КонецЕсли;
	ДополнительныеСвойства.Вставить("ЭтоНовый", ЭтоНовый());
	
	
	//////////////////////////////                   оновим останню роботу з клієнтом    
	Если НЕ ЭтоНовый() Тогда  
		з = Новый Запрос;
		з.Текст = "ВЫБРАТЬ
		|	РаботаСКлиентомСрезПоследних.Период КАК Период,
		|	РаботаСКлиентомСрезПоследних.Запись КАК Запись
		|ИЗ
		|	РегистрСведений.РаботаСКлиентом.СрезПоследних(, Клиент = &Клиент) КАК РаботаСКлиентомСрезПоследних";
		з.УстановитьПараметр("Клиент", Ссылка);
		Виборка = з.Выполнить().Выбрать();
		
		
		Если Виборка.Следующий() Тогда 
			РаботаСКлиентомПериод =  Виборка.Период;
			РаботаСКлиентомЗапись = Виборка.Запись;
		иначе
			РаботаСКлиентомПериод =  '00010101';
			РаботаСКлиентомЗапись = "";		
		КонецЕсли;
		КонтрольВерсийПерезапису();
	КонецЕсли;
	
	Общий.ЗарегистрироватьИзмененияКонтрагента(Ссылка, Ссылка.Наименование, Наименование, Ссылка.ДатаОновлення, ДатаОновлення);

КонецПроцедуры

Процедура КонтрольВерсийПерезапису()
	Если НЕ ЭтоНовый() И Ссылка.ДатаОновлення > ДатаОновлення Тогда 
		СтрСохр = Новый Структура;
		СтрСохр.Вставить("РаботаСКлиентомПериод", РаботаСКлиентомПериод);
		СтрСохр.Вставить("РаботаСКлиентомЗапись", РаботаСКлиентомЗапись);
		СтрСохр.Вставить("Борг", Борг);
		СтрСохр.Вставить("ОстатокСесия", ОстатокСесия);
		СтрСохр.Вставить("СтатусДиалога", СтатусДиалога);
		СтрСохр.Вставить("КоличествоДнейОтПоследнейПокупки", КоличествоДнейОтПоследнейПокупки);
		СтрСохр.Вставить("КонтактВайбер", КонтактВайбер);
		СтрСохр.Вставить("ПодписанийВВайбере", ПодписанийВВайбере);
		СтрСохр.Вставить("НовоеСообщение", НовоеСообщение);
		
			
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, Ссылка);
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, СтрСохр);
		ЭтотОбъект.Наименование = Ссылка.Наименование;
		
		Телефоны.Очистить();
		Для Каждого Стр Из Ссылка.Телефоны Цикл
			НовСтр = Телефоны.Добавить();
			ЗаполнитьЗначенияСвойств(НовСтр, Стр);
		КонецЦикла;
		
		Маршруты.Очистить();
		Для Каждого Стр Из Ссылка.Маршруты Цикл
			НовСтр = Маршруты.Добавить();
			ЗаполнитьЗначенияСвойств(НовСтр, Стр);
		КонецЦикла;
		
		Асортимент.Очистить();
		Для Каждого Стр Из Ссылка.Асортимент Цикл
			НовСтр = Асортимент.Добавить();
			ЗаполнитьЗначенияСвойств(НовСтр, Стр);
		КонецЦикла;

		БанковскиеСчета.Очистить();
		Для Каждого Стр Из Ссылка.БанковскиеСчета Цикл
			НовСстр = БанковскиеСчета.Добавить();
			ЗаполнитьЗначенияСвойств(НовСтр, Стр);
		КонецЦикла;

		АсортиментПрезентацій.Очистить();
		Для Каждого Стр Из Ссылка.АсортиментПрезентацій Цикл
			НовСтр = АсортиментПрезентацій.Добавить();
			ЗаполнитьЗначенияСвойств(НовСтр, Стр);
		КонецЦикла;		
		
	КонецЕсли;
	
	з = Новый Запрос;
	з.Текст = "ВЫБРАТЬ
	          |	РегистрацияИзмененияКонтрагента.НаименованиеНов КАК НаименованиеНов
	          |ИЗ
	          |	РегистрСведений.РегистрацияИзмененияКонтрагента КАК РегистрацияИзмененияКонтрагента
	          |ГДЕ
	          |	РегистрацияИзмененияКонтрагента.Контрагент = &Контрагент
	          |	И (РегистрацияИзмененияКонтрагента.НаименованиеСтар = &Наименование
	          |			ИЛИ РегистрацияИзмененияКонтрагента.НаименованиеНов = &Наименование)";
	з.УстановитьПараметр("Контрагент", Ссылка);
	з.УстановитьПараметр("Наименование", Наименование);
	Выборка = з.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда 
		Наименование = Ссылка.Наименование; 
	КонецЕсли;
	
	
	
	
КонецПроцедуры


Процедура ОновитиСтатусиЗакаів(Ответ) Экспорт 
	Ответ = Новый Структура;
	Ответ.Вставить("Успех", Истина);
	
	Пароль = Константы.ПарольВхода.Получить();
	ПараметрыКоманды = Новый Структура;
	ПараметрыКоманды.Вставить("Контрагент", Ссылка.УникальныйИдентификатор());

	Данные = Новый Структура;
	Данные.Вставить("Команда", "ПолучитьСтатусыЗаказовПоКонтрагенту");
	Данные.Вставить("Параметры", ПараметрыКоманды);
	
	Попытка 
		Прокси = СоединениеСБазой.ПолучитьПрокси();
		СтруктураОтветаПоЗаказам = Прокси.ВыполнитьКоманду(Пароль, Обмен_УправлениеОбменом.Сериализовать(Данные)).Получить();
	Исключение
		СтруктураОтветаПоЗаказам = Новый Структура;
		СтруктураОтветаПоЗаказам.Вставить("Успешно", Ложь);
		СтруктураОтветаПоЗаказам.Вставить("Ошибка", ОписаниеОшибки());
	КонецПопытки;

	Если Не СтруктураОтветаПоЗаказам.Успешно Тогда
		Ответ.Вставить("СтруктураОтветаПоЗаказам",Ложь);
		Ответ.Вставить("Ошибка", СтруктураОтветаПоЗаказам.Ошибка);
		Возврат;
	КонецЕсли;
	
	ТЗАктуальныхЗаказов = СтруктураОтветаПоЗаказам.Данные;	
	
	ТЗАктуальныхЗаказов.Колонки.Добавить("Заказ");

	Для Каждого стрОтчета Из ТЗАктуальныхЗаказов Цикл
		стрОтчета.Заказ = Документы.Заказ.ПолучитьСсылку(стрОтчета.УИДЗаказ);
		Если Общий.ОбъектБДСуществует(стрОтчета.Заказ) Тогда
			Если Не стрОтчета.Заказ.Актуальный = стрОтчета.Актуальный Тогда 
				ЗаказДляОбрабткиОбъект = стрОтчета.Заказ.ПолучитьОбъект();			
				ЗаказДляОбрабткиОбъект.Актуальный = стрОтчета.Актуальный;
				ЗаказДляОбрабткиОбъект.Записать(РежимЗаписиДокумента.Запись);	
			КонецЕсли;	
		КонецЕсли;	
	КонецЦикла;	

	
КонецПроцедуры
