&НаКлиенте
Перем ОткрытиеОшибки;

&НаКлиенте
Перем УникальностьФормыУведомлений;


//&НаСервере
//Процедура ВыполнитьОбменНаСервере()
//	// Вставить содержимое обработчика.
//КонецПроцедуры

//&НаКлиенте
//Процедура ВыполнитьОбмен(Команда)
//	ВыполнитьОбменНаСервере();
//КонецПроцедуры




&НаСервере
Процедура ПриОткрытииНаСервере()
	//ОбновитьЗаголвок();	
	Общий.ПроверитьЗаполненостьДаннихКонтрагентов();
	
	ПослДата = Константы.ПоследняяДатаВхода.Получить();
	Если Не ЗначениеЗаполнено(ПослДата) ИЛИ ПослДата < НачалоДня(ТекущаяДата()) Тогда
		Константы.ЭтоНеПервыйОбмен.Установить(Ложь);
		Константы.ПоследняяДатаВхода.Установить(НачалоДня(ТекущаяДата()));
	КонецЕсли;
	
	Если Константы.ВідображатиВсіхКлієнтів.Получить() Тогда 
		юзер = ПользователиИнформационнойБазы.НайтиПоИмени("Пользователь");
		юзер.Роли.Добавить(Метаданные.Роли.ВидимістьВсіхКлієнтів);
		юзер.Записать();
	Иначе
		юзер = ПользователиИнформационнойБазы.НайтиПоИмени("Пользователь");
		юзер.Роли.Удалить(Метаданные.Роли.ВидимістьВсіхКлієнтів);
		юзер.Записать();
	КонецЕсли;
	

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	
	
	ОткрытьНеПросмотренныеНапоминания();

	
	ПриОткрытииНаСервере();
	
	ОткрытиеОшибки = 0;
	
	ОбновитьДанныеПартнера();
	
	Если ОбменВыполняется() Тогда //  И Ложь 
		ФормаОбмена = ПолучитьФорму("ОбщаяФорма.ФормаОбмена");
		Если НЕ ФормаОбмена.Открыта() Тогда
			ФормаОбмена.ОткрытьМодально();
		КонецЕсли;
	КонецЕсли;

	
	ПодключитьОбработчикОжидания("ОткрытьНеПросмотренныеНапоминания", 60);
	
	ПодключитьОбработчикОжидания("ОбновитьОтображениеКурсовВалют",5);
	
	ПодключитьОбработчикОжидания("АвтоОбновлениеЧата1с", 5);

	//ПодключитьОбработчикОжидания("АвтоОбновлениеИнформацииОБрони", 1);
	//
	//ПодключитьОбработчикОжидания("АвтоОбновлениеАвтоматичнийОбмінБоргиТаЦіни", 1);
	//Обмен_УправлениеОбменом.ФоновыйОбмен();
	
	ЗапуститьФоновыйОбмен();
	
	ОбновитьИдентификатор();
	
	ОбновитьНапоминания();
	
	//ПодключитьОбработчикОжидания("ЗагрузитьОчередьНапоминанийСДействием", 60);
	//ЗагрузитьОчередьНапоминанийСДействием();
	
	ПодключитьОбработчикОжидания("ПроверкаФоновогоОбмена", 300);
	//АвтоОбновлениеСтатусовЗаказов();	
	
КонецПроцедуры

&НаКлиенте
Процедура ВідкритиФормуКілометраж(Заголовок, Статус, Період, ДозволитиЗакритяФорми=ложь) 
	Повідомлення = "";
	Если Кілометраж.ВідкритиФормуКілометражНаСервере(Статус, Заголовок, Повідомлення) Тогда
		Форма = ПолучитьФорму("ОбщаяФорма.ФормаВводаКілометражу",Новый Структура("СтатусДня,ДозволитиЗакритяФорми,Заголовок,Период",Статус,ДозволитиЗакритяФорми,Повідомлення,Період));
		Форма.ОткрытьМодально();
		Если Статус = СтатусПочатокДня() И НЕ Общий.АвтообмінВключений() Тогда				
			//ФормаОбмена = ПолучитьФорму("ОбщаяФорма.ФормаОбмена");				
			//ФормаОбмена.ОткрытьМодально();			
		КонецЕсли;		
	КонецЕсли;	
КонецПроцедуры

&НаСервереБезКонтекста
Функция СтатусПочатокДня()
	Возврат  Перечисления.СтатусДня.ПочатокДня;
КонецФункции

Функция СтатусКінецьДня()
	Возврат  Перечисления.СтатусДня.КінецьДня;
КонецФункции


&НаКлиенте
Процедура ОбновитьДанныеПартнера()  
	ДанныеПартнера = ПолучитьДанныеПартнера();
	
	//Партнер =  "111111111";
	ОбновитьОтображениеКурсовВалют();
	Партнер = "Мобільний агент v"+ПолучитьВерсиюПриложения() +Символы.ПС + ДанныеПартнера.СкладПартнера+Символы.ПС+ДанныеПартнера.ПродавецПартнера + Символы.ПС + "Напрямок: "+ДанныеПартнера.Партнер;
	Если НЕ ЗначениеЗаполнено(Партнер) Тогда
		Партнер = "";
	КонецЕсли;
	
	Элементы.ЗмінитиКурси.Видимость =  ДанныеПартнера.ПравоМінятиКурсиВалют;
	//Склад = ДанныеПартнера.СкладПартнера;
	//Если НЕ ЗначениеЗаполнено(Склад) Тогда
	//	Склад = "";
	//КонецЕсли;
	//Продавец = ДанныеПартнера.ПродавецПартнера;
	//Если НЕ ЗначениеЗаполнено(Продавец) Тогда
	//	Партнер = "";
	//КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьВерсиюПриложения()
	Возврат Метаданные.Версия;
КонецФункции





&НаКлиенте
Процедура ОбновитьЗаголовок()
	
	ОткрытиеОшибки = 0;
	ОбновитьДанныеПартнера();

	Если Общий.АвтообмінВключений() Тогда
		УстановитьЗаголовокПриложения("Автообмін: "+Общий.ОтриматиДатуОстанньогоОбміну());
	Иначе 	
		УстановитьЗаголовокПриложения("Обмін: "+Общий.ОтриматиДатуОстанньогоОбміну());
	КонецЕсли;
	
	
	ЭтаФорма.ОбновитьОтображениеДанных();
	
КонецПроцедуры



&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	//Если ИмяСобытия = "СобытиеОбновленДолг" Тогда 
	//	ОбновитьЗаголвок();
	//	ОбновитьДанныеПартнера();
	//	//ОбщийКлиент.ОтобразитьЗаголовокСисетмы();
	//КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьПоследнююОшибку(Команда)
	Возврат;
	Если ОткрытиеОшибки = 9 Тогда 
		ОткрытиеОшибки = 0;
		ФормаПоследнейОшибки = ПолучитьФорму("ОбщаяФорма.ФормаПросмотраПоследнейОшибки");
		ФормаПоследнейОшибки.Открыть();
		ФормаПоследнейОшибки = ПолучитьФорму("РегистрСведений.Лог.ФормаСписка");
		ФормаПоследнейОшибки.Открыть();

	КонецЕсли;
	ОткрытиеОшибки = ОткрытиеОшибки + 1;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьДанныеПартнера()
	св = Новый Структура;
	св.Вставить("СкладПартнера",Константы.СкладПартнера.Получить());
	св.Вставить("Партнер",Константы.Партнер.Получить());
	св.Вставить("ПродавецПартнера",Константы.ПродавецПартнера.Получить());
	св.Вставить("ПравоМінятиКурсиВалют",Константы.ПравоМінятиКурсиВалют.Получить());

	Возврат св;
КонецФункции

&НаСервереБезКонтекста
Функция ОбменВыполняется()
	Возврат Константы.ОбменВыполняется.Получить();
КонецФункции

&НаКлиенте
Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)
	ЗавершитьРаботуСистемы(Ложь);
КонецПроцедуры




#Если МобильноеПриложениеКлиент Тогда
	


&НаКлиенте
Процедура ОпросКоординат(ИмяПровайдера, ДанныеМестоположения, ДополнительныеДанные) Экспорт 
    //РаботаСГеоданнымиСервер.ЗафиксироватьКоординаты(ИмяПровайдера, ДанныеМестоположения); // Тут запись в регистр сведений

	Если ДанныеМестоположения.Координаты.Широта > 0 Тогда 
		Геопозиціювання.ЗаписатьКоординаты(ДанныеМестоположения.Координаты.Широта,ДанныеМестоположения.Координаты.Долгота);

	КонецЕсли;
КонецПроцедуры // ОпросКоординат


&НаКлиенте
Процедура ТЕСТ(Команда)
	
	НовВз=Новый ЗапускПриложенияМобильногоУстройства();
	//Отправить текст по вайберу, предлагает выбрать, кому отправлять, потом сразу отправляет
	НовВз.Действие = "android.intent.action.SEND";
	НовВз.Приложение = "com.viber.voip"; 
	НовВз.ИмяКласса = "com.viber.voip.WelcomeShareActivity"; 
	НовВз.Тип = "text/plain";
	НовВз.ДополнительныеДанные.Добавить("android.intent.extra.TEXT","ТЕКСТ: Теекст-текст-текст");
	
	НовВз.Запустить(Истина);
	//НовВз.ДополнительныеДанныеЦикл

КонецПроцедуры
#КонецЕсли


&НаКлиенте
Процедура ФіксаціяКілометражу(Команда)
	ВідкритиФормуКілометраж("КонецДня",СтатусКінецьДня(), ТекущаяДата(), Истина);
КонецПроцедуры

&НаКлиенте
Процедура Оплати(Команда)
	ПолучитьФормуСпискаОплат().Открыть();
КонецПроцедуры

&НаСервере
Функция ПолучитьФормуСпискаОплат()
	 Возврат Документы.КассовыйОрдер.ПолучитьФормуСписка()
КонецФункции

&НаКлиенте
Процедура ОбновитьОтображениеКурсовВалют() Экспорт
	
	Элементы.ДекорацияEUR.Заголовок = "EUR: " + Общий.ПолучитьЗначениеКонстанты("КурсEUR");
	Элементы.ДекорацияUSD.Заголовок = "USD: " + Общий.ПолучитьЗначениеКонстанты("КурсUSD");
	
КонецПроцедуры


&НаКлиенте
Процедура ЗмінаКурсу(Команда)

ПолучитьФорму("ОбщаяФорма.ФормаВстановленняКурсуВалют").Открыть();

КонецПроцедуры


&НаКлиенте
 Процедура ОткрытьЧат(Команда)
	ОткрытьФорму("Обработка.Чат1с.Форма.Форма");
	
КонецПроцедуры

&НаКлиенте
Процедура АвтоОбновлениеЧата1с()
	Непрочитано = 0;
	АвтоОбновлениеЧата1сНаСервере(Непрочитано);
	
	УстановитьЗаголовокПриложения("Обмін: "+Формат(Общий.ОтриматиДатуОстанньогоОбміну(),"ДФ=ЧЧ:мм") +  
	Формат(Непрочитано, "ЧН=' '; ЧФ=' Непрочитаних повідомлень: Ч'"));
	
	Элементы.Непрочитанные.Заголовок = Формат(Непрочитано, "ЧН=' '; ЧФ='Непрочитаних повідомлень: Ч'");
	
	#Если Не МобильноеПриложениеКлиент Тогда 
		//ПоказатьОповещениеПользователя("Тест");
		
	#КонецЕсли
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура АвтоОбновлениеЧата1сНаСервере(Непрочитано) Экспорт 
	
	//Если ЗначениеЗаполнено(КлючФЗ) Тогда 
	//	ФоновоеЗадания = ФоновыеЗадания.НайтиПоУникальномуИдентификатору(КлючФЗ);
	//	Если ФоновоеЗадания <> Неопределено И  ФоновоеЗадания.Состояние = СостояниеФоновогоЗадания.Активно Тогда 
	//		Если ФоновоеЗадания.Начало < ТекущаяДата() - 300 Тогда 
	//			ФоновоеЗадания.Отменить();
	//		КонецЕсли;
	//		Возврат;
	//	КонецЕсли;
	//КонецЕсли;	
	////Обмен_УправлениеОбменом.ОновитьЧат();
	//ФоновоеЗадания = ФоновыеЗадания.Выполнить("Обмен_УправлениеОбменом.ОновитьЧат",,"АвтоОбновлениеЧата1с"); 
	//КлючФЗ = ФоновоеЗадания.УникальныйИдентификатор;
	//
	//КонстКолНепрочит = Константы.КолНепрочитанихПовідомлень.Получить();
	
	//Если КонстКолНепрочит <= 0 Тогда 
	//	
	//	Запрос = Новый Запрос;
	//	Запрос.Текст = 
	//	"ВЫБРАТЬ
	//	|	СУММА(НепрочитаныеСообщения.кол) КАК кол
	//	|ИЗ
	//	|	РегистрСведений.НепрочитаныеСообщения КАК НепрочитаныеСообщения";
	//	
	//	РезультатЗапроса = Запрос.Выполнить();
	//	
	//	Выборка = РезультатЗапроса.Выбрать();
	//	
	//	Если Выборка.Следующий() Тогда 
	//		Непрочитано = Выборка.Кол;
	//	Иначе
	//		Непрочитано = 0;
	//	КонецЕсли;
	//	Константы.КолНепрочитанихПовідомлень.Установить(Непрочитано);
	//Иначе 
	//	Непрочитано = Константы.КолНепрочитанихПовідомлень.Получить();
	//КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура АвтоОбновлениеИнформацииОБрони()
	АвтоОбновлениеИнформацииОБрониНаСервере();
КонецПроцедуры

&НаСервере
Процедура АвтоОбновлениеИнформацииОБрониНаСервере() Экспорт 
	
	Если ЗначениеЗаполнено(КлючФЗОбновлениеБрони) Тогда 
		ФоновоеЗадания = ФоновыеЗадания.НайтиПоУникальномуИдентификатору(КлючФЗОбновлениеБрони);
		Если ФоновоеЗадания = Неопределено Тогда
			Возврат; // вероятно уже вытеснено из памяти
		КонецЕсли;
	
		Если ФоновоеЗадания.Состояние = СостояниеФоновогоЗадания.Активно Тогда 
			Возврат;
		КонецЕсли;
	КонецЕсли;	
	
	ФоновоеЗадания = ФоновыеЗадания.Выполнить("Обмен_УправлениеОбменом.ОбновлениеИнфоОБрониМешков",,"АвтоОбновлениеИнформацииОБрони"); 
	КлючФЗОбновлениеБрони = ФоновоеЗадания.УникальныйИдентификатор;
	
КонецПроцедуры

&НаКлиенте
Процедура АвтоОбновлениеАвтоматичнийОбмінБоргиТаЦіни()

АвтоОбновлениеАвтоматичнийОбмінБоргиТаЦіниНаСервере();
КонецПроцедуры

&НаСервере
Процедура АвтоОбновлениеАвтоматичнийОбмінБоргиТаЦіниНаСервере() Экспорт 
	Если Не Константы.АвтоматичнийОбмінБоргиТаЦіни.Получить() Тогда 
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(КлючФЗБоргиТаЦіни) Тогда 
		ФоновоеЗадания = ФоновыеЗадания.НайтиПоУникальномуИдентификатору(КлючФЗБоргиТаЦіни);
		Если ФоновоеЗадания = Неопределено Тогда
			Возврат; // вероятно уже вытеснено из памяти
		КонецЕсли;

		Если ФоновоеЗадания.Состояние = СостояниеФоновогоЗадания.Активно Тогда 
			Возврат;
		КонецЕсли;
	КонецЕсли;	
	
	ФоновоеЗадания = ФоновыеЗадания.Выполнить("Обмен_УправлениеОбменом.ОбмінБоргиТаЦіни",,"ОбмінБоргиТаЦіни"); 
	КлючФЗБоргиТаЦіни = ФоновоеЗадания.УникальныйИдентификатор;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьНеПросмотренныеНапоминания() Экспорт 
	
	Напоминания = Общий.ПолучитьНеПросмотренныеНапоминания();
	
	Если Напоминания.Количество() Тогда 
		Если УникальностьФормыУведомлений = Неопределено Тогда 
			УникальностьФормыУведомлений = Новый УникальныйИдентификатор;
		КонецЕсли;
		Форма = ПолучитьФорму("Обработка.Нагадування.Форма.ФормаОтриманихНагадувань",,,УникальностьФормыУведомлений);
		ОткрытьФорму(Форма);
		
	КонецЕсли;
	
	Возврат;
	Для Каждого ПараметрыФормы Из Напоминания Цикл 
	
		Форма = ПолучитьФорму("Обработка.Нагадування.Форма.ФормаПерегляду", ПараметрыФормы,,ПараметрыФормы.Ключ);
		Если Не (Форма = Неопределено Или Форма.Открыта()) Тогда 
			
			Если Не МассивОткрытыхОконНапоминаний.Найти(ПараметрыФормы.УИД_Уведомления) = Неопределено Тогда
		        Продолжить;
			КонецЕсли;			
			МассивОткрытыхОконНапоминаний.Добавить(ПараметрыФормы.УИД_Уведомления);
				
			
			//ОткрытьФормуМодально(Форма);
			ОткрытьФорму(Форма);
			
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры



Функция _ПолучитьНеПросмотренныеНапоминания()
		
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаУведомления", ТекущаяДата());
	
	Запрос.Текст = "ВЫБРАТЬ
	|	ЗапланированыеУведомления.УИД_Уведомления КАК УИД_Уведомления
	|ИЗ
	|	РегистрСведений.ЗапланированыеУведомления КАК ЗапланированыеУведомления
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ЗапланированыеУведомления.ДатаУведомления КАК ДатаУведомления,
	|			ЗапланированыеУведомления.ОбъектУведомления КАК ОбъектУведомления
	|		ИЗ
	|			РегистрСведений.ЗапланированыеУведомления КАК ЗапланированыеУведомления
	|		ГДЕ
	|			НЕ ЗапланированыеУведомления.Выполнено
	|			И НЕ ЗапланированыеУведомления.ОбъектУведомления.НагадатиПроТовар
	|			И ЗапланированыеУведомления.ДатаУведомления < &ДатаУведомления) КАК ВложенныйЗапрос
	|		ПО ЗапланированыеУведомления.ОбъектУведомления = ВложенныйЗапрос.ОбъектУведомления
	|			И ЗапланированыеУведомления.ДатаУведомления < ВложенныйЗапрос.ДатаУведомления
	|			И (НЕ ЗапланированыеУведомления.Выполнено)";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Массив = Новый Массив;
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Набор = РегистрыСведений.ЗапланированыеУведомления.СоздатьНаборЗаписей();
		Набор.Отбор.УИД_Уведомления.Установить(ВыборкаДетальныеЗаписи.УИД_Уведомления);
		Набор.Записать();
	КонецЦикла;
	
	
	
	Запрос.Текст = 	"ВЫБРАТЬ
	|	ЗапланированыеУведомления.УИД_Уведомления КАК УИД_Уведомления,
	|	ЗапланированыеУведомления.ДанныеУведомления КАК ДанныеУведомления
	|ИЗ
	|	РегистрСведений.ЗапланированыеУведомления КАК ЗапланированыеУведомления
	|ГДЕ
	|	НЕ ЗапланированыеУведомления.Выполнено
	|	И ЗапланированыеУведомления.ДатаУведомления < &ДатаУведомления
	|";
	
	
	
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Массив = Новый Массив;
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Уведомление = ВыборкаДетальныеЗаписи.ДанныеУведомления.Получить();
		ДанныеУведомления = Уведомление.Данные;
		ПараметрыФормы = Новый Структура("ТекстНагадування",  Уведомление.Текст);
		ПараметрыФормы.Вставить("ДатаНагадування",  ДанныеУведомления["Дата"]);
		ПараметрыФормы.Вставить("УИД_Уведомления",  ДанныеУведомления["УИД_Уведомления"]);
		ПараметрыФормы.Вставить("УИД_Напоминание", ДанныеУведомления["УИД_Напоминание"]); 
		ПараметрыФормы.Вставить("Ключ", ДанныеУведомления["УИД_Напоминание"]); 
		Если ДанныеУведомления["НапоминаниеОТоваре"] = "1" Тогда
			
			ПараметрыФормы.Вставить("УИД_Номенклатура", ДанныеУведомления["УИД_Номенклатуры"]);
			
		КонецЕсли;
		
		Массив.Добавить(ПараметрыФормы);
		
	КонецЦикла;

	Возврат Массив;
КонецФункции


&НаСервере
Процедура ОбновитьИдентификаторНаСервере(Уведомление)
	
	Константы.КлючПодписчикаУведомлений.Установить(Новый ХранилищеЗначения(Уведомление));

	ФоновыеЗадания.Выполнить("Обмен_УправлениеОбменом.ОбновитьИдентификаторПолучателя",,"ОбновитьИдентификаторПолучателя"); 
	
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьИдентификатор()
	
	#Если МобильноеПриложениеКлиент тогда 
		Попытка 
			Идентификатор = ДоставляемыеУведомления.ПолучитьИдентификаторПодписчикаУведомлений();
			ОбновитьИдентификаторНаСервере(Идентификатор);
		//	Сообщить(Идентификатор.ИдентификаторИнформационнойБазы);
		Исключение
		КонецПопытки;
	#КонецЕсли
	 
	
КонецПроцедуры


 &НаКлиенте
 Процедура ОбновитьНапоминания()
	 Перем Данные;
	
	 #Если МобильноеПриложениеКлиент Тогда
		 
		 ДоставляемыеУведомления.ОтменитьЛокальныеУведомления();
		 
	 #КонецЕсли 
	 
	 Общий.ПолучитьДанныеУведомленийНаНеделю(Данные);
	 
	 #Если  МобильноеПриложениеКлиент Тогда
		 
		 Для Каждого ДанныеУведомления Из Данные Цикл 
			 Уведомление = Новый ДоставляемоеУведомление;
			 ЗаполнитьЗначенияСвойств(Уведомление, ДанныеУведомления, ,"Данные");
			 Уведомление.Данные = Общий.ПолучитьСтрокуИзДанных(ДанныеУведомления["Данные"]);
			 
			 Уведомление.ДатаПоявленияУниверсальноеВремя = ДатаОтправки(ДанныеУведомления["Данные"]["Дата"]);
			 
			 ДоставляемыеУведомления.ДобавитьЛокальноеУведомление(Уведомление);		 
			 
		 КонецЦикла;
	 #КонецЕсли


 КонецПроцедуры
 
&НаСервереБезКонтекста
Функция  ДатаОтправки(Дата)
	
	Возврат Дата  + (ТекущаяУниверсальнаяДата() - ТекущаяДата()); 
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьДанныеИзХранилища(ХранилищеЗначений)
	Возврат ХранилищеЗначений.Получить();
КонецФункции

&НаКлиенте
Процедура НепрочитанныеНажатие(Элемент)
	
	ОткрытьФорму("Обработка.Чат1с.Форма.Форма");

КонецПроцедуры


&НаКлиенте
Процедура ЗагрузитьОчередьНапоминанийСДействием()
	Общий.ЗагрузитьОчередьНапоминанийСДействием();	
КонецПроцедуры 

&НаКлиенте
Процедура АвтоОбновлениеСтатусовЗаказов()
	АвтоОбновлениеСтатусовЗаказовНаСервере();	
КонецПроцедуры 

&НаСервере
Процедура АвтоОбновлениеСтатусовЗаказовНаСервере() Экспорт 
	
	Если ЗначениеЗаполнено(КлючФЗОбновлениеСтатусовЗаказов) Тогда 
		ФоновоеЗадания = ФоновыеЗадания.НайтиПоУникальномуИдентификатору(КлючФЗОбновлениеСтатусовЗаказов);
		Если ФоновоеЗадания = Неопределено Тогда
			Возврат; // вероятно уже вытеснено из памяти
		КонецЕсли;

		Если ФоновоеЗадания.Состояние = СостояниеФоновогоЗадания.Активно Тогда 
			Возврат;
		КонецЕсли;
	КонецЕсли;	
	
	ФоновоеЗадания = ФоновыеЗадания.Выполнить("Обмен_УправлениеОбменом.ОбновлениеСтатусовЗаказов",,"АвтоОбновлениеСтатусовЗаказов"); 
	КлючФЗОбновлениеСтатусовЗаказов = ФоновоеЗадания.УникальныйИдентификатор;
	
КонецПроцедуры


&НаСервере
Процедура ЗапуститьФоновыйОбмен()
	
	ФоновыеЗадания.Выполнить("Обмен_УправлениеОбменом.ФоновыйОбмен",,"ФоновыйОбмен"); 
	   
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверкаФоновогоОбмена() Экспорт
	
	Сообщение = "";
	ПроверкаФоновогоОбменаНаСервере(Сообщение);

	Если Не ПустаяСтрока(Сообщение) Тогда 
		Предупреждение(Сообщение, 300);
	КонецЕсли;
	
		
	

	
КонецПроцедуры

&НаСервере
Процедура ПроверкаФоновогоОбменаНаСервере(Сообщение)
	
	ДатаОбновления = Константы.ДатаПоследнегоФоновогоОбновления.Получить();
	
	Если ДатаОбновления + 600 < ТекущаяДата()  Тогда 
		
		Сообщение = "Перезайдіть в додаток! Останнє оновлення відбулося " + Цел((ТекущаяДата() - ДатаОбновления)/60) + " хвилин тому";
	КонецЕсли;
	
	
	ФЗ = ФоновыеЗадания.ПолучитьФоновыеЗадания(Новый Структура("Ключ", "ФоновыйОбмен"))[0];
	Сообщения = ФЗ.ПолучитьСообщенияПользователю(Истина);

	МассивОшибок = Новый Массив;
	Для Каждого Элемент Из Сообщения Цикл 
		Если МассивОшибок.Найти(Элемент.Текст) = Неопределено Тогда 
			МассивОшибок.Добавить(Элемент.Текст);
			Элемент.Сообщить();
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры


&НаКлиенте
Процедура ОткрытьХарактеристику(Команда)
	
	#Если МобильноеПриложениеКлиент Тогда
		
		ОбработчикСканирования = Новый ОписаниеОповещения("НайтиИОткрытьХарактеристику", ЭтаФорма);	
		СредстваМультимедиа.ПоказатьСканированиеШтрихКодов("Сканируйте штрихкоды",ОбработчикСканирования);
		
	#Иначе
		СтрокаШК = "";
		Если ВвестиСтроку(СтрокаШК, "Введите ШК вручную") Тогда 
			НайтиИОткрытьХарактеристику(СтрокаШК, Истина, "",);	
		КонецЕсли;
		
	#КонецЕсли

	
КонецПроцедуры


&НаКлиенте
Процедура НайтиИОткрытьХарактеристику(Штрихкод, Результат, Сообщение, ДополнительныеПараметры) Экспорт
	Перем ТекстСообщения;
	
	#Если МобильноеПриложениеКлиент Тогда
		СредстваМультимедиа.ЗакрытьСканированиеШтрихКодов();
	#КонецЕсли
	
	СтруктураТовара = Общий.ПолучитьДанныеТовараПоШК(СокрЛП(Штрихкод), );
	Если ТипЗнч(СтруктураТовара) = Тип("Структура") Тогда 
		
		ОткрытьЗначение(СтруктураТовара.Характеристика);
	Иначе
		
		Сообщить("Не найден товар " + Штрихкод);

	КонецЕсли;
	
	
	
КонецПроцедуры

