
Процедура  ИнфоБорг(Объект, ЭлементБоргу) Экспорт
	БоргиКлієнта = Общий.ОтриматиБоргиКлієнта(Объект.Контрагент);
	Текст = "";
	//если Не Объект.ПершаФорма  тогда
		Борг = БоргиКлієнта.Борг;
		ПростроченийБорг = БоргиКлієнта.ПросроченийБорг; 
	//иначе
	//	Борг = БоргиКлієнта.БоргТзОВ;
	//	ПростроченийБорг = БоргиКлієнта.ПросроченийБоргТзОВ;
	//КонецЕсли;
	
	если Борг > 0 Тогда 
		ЭлементБоргу.ЦветТекста = WebЦвета.Красный;
		Попытка
			Текст = ?(Объект.Наложка, "Наложка: ", "Борг: ") +Борг+" EUR";
		Исключение
			Текст = "Борг: " +Борг+" EUR";
		КонецПопытки;
	иначеЕсли Борг < 0 Тогда 
		ЭлементБоргу.ЦветТекста = WebЦвета.Зеленый;
		Текст = "Переплата: " + (-Борг) + " EUR";
	КонецЕсли;
	если ПростроченийБорг > 0 И Борг > 0 Тогда
		если текст = "" тогда 
			ТекстПР =  "Прострочений борг: " + ПростроченийБорг+" EUR."; 
		иначе		
			ТекстПР =  ", прострочений борг: " + ПростроченийБорг+" EUR.";
		КонецЕсли;
	иначе 
		текстПр= "";
	КонецЕсли;
	ЭлементБоргу.Заголовок = Текст +ТекстПР;
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьЧат(Параметры) Экспорт 
	
	форма = ПолучитьФорму("Обработка.Чат1с.Форма.Форма");
	форма.Открыть();
КонецПроцедуры

&НаКлиенте
Процедура СкинутиУВайберЗаказВидео(Номенклатура) Экспорт

	Контрагент = Неопределено;
	КоличествоШтук = 0;
	Если Не ВвестиЗначение(Контрагент, "Виберіть контрагента", Тип("СправочникСсылка.Контрагенты")) Тогда
		Возврат;
	КонецЕсли;
	Если Не ВвестиЗначение(КоличествоШтук, "Введіть кількість") Тогда
		Возврат;
	КонецЕсли;	
		

	ТекстСообщения =  Общий.СофрмроватьСообщениеНаВайберЗаказВидео(Номенклатура, Контрагент, КоличествоШтук);
	
	#Если МобильноеПриложениеКлиент Тогда
		
		НовВз = Новый ЗапускПриложенияМобильногоУстройства();
		
		НовВз.Действие = "android.intent.action.SEND";
		НовВз.Приложение = "com.viber.voip"; 
		НовВз.ИмяКласса = "com.viber.voip.WelcomeShareActivity"; 
		НовВз.Тип = "text/plain";
		НовВз.ДополнительныеДанные.Добавить("android.intent.extra.TEXT", СокрЛП(ТекстСообщения));
		
		НовВз.Запустить(Истина);
	#Иначе 
		Сообщить(ТекстСообщения);
	#КонецЕсли

	
	форма = ПолучитьФорму("Обработка.Нагадування.Форма.Форма");
	форма.КонтрагентВидео = Контрагент;
	форма.НоменклатураВидео = Номенклатура;
    форма.ДатаНагадування = ТекущаяДата() +  3 * 24 * 60 * 60;
	
	//форма.Открыть();
	
	
	форма.Элементы.ОсновнаяПанель.ТекущаяСтраница = форма.Элементы.Напоминание;	
	форма.ТипНапоминания = форма.Элементы.ТипНапоминания.СписокВыбора[0].Значение; 
	форма.Нагадування = ТекстСообщения;
	форма.ЗаказВидео = Истина;
	
	Форма.ВстановитиНагадування(Неопределено, Ложь);

КонецПроцедуры
