
&НаКлиенте
Процедура ТоварыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура КнСохранить(Команда)
	Закрыть();
КонецПроцедуры


&НаКлиенте
Процедура ТоварыПередНачаломИзменения(Элемент, Отказ)
	Отказ = Истина;
	Если Элемент.ТекущийЭлемент.Имя = "ТоварыНомерСтроки" ИЛИ Элемент.ТекущийЭлемент.Имя = "ТоварыПринял" Тогда 
		Элемент.ТекущиеДанные.Принял = НЕ Элемент.ТекущиеДанные.Принял;
	Иначе 
		ОткрытьЗначение(Элемент.ТекущиеДанные.Номенклатура);
	КонецЕсли;
	
КонецПроцедуры


&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	Для Каждого Строка Из Объект.Товары Цикл
		Строка.Цена = Общий.ПолучитьЦенуНоменклатуры(Строка.Номенклатура,Строка.ХарактеристикаНоменклатуры);		
	КонецЦикла;
	
КонецПроцедуры


&НаКлиенте
Процедура ТоварыПриАктивизацииСтроки(Элемент)
	//Если Элементы.Товары.ТекущийЭлемент = Неопределено Тогда 
	//	Возврат;
	//КонецЕсли;
	//Если Элементы.Товары.ТекущийЭлемент.Имя = "ТоварыНомерСтроки" ИЛИ Элементы.Товары.ТекущийЭлемент.Имя = "ТоварыПринял" Тогда 
	//	Элементы.Товары.ТекущиеДанные.Принял = НЕ Элементы.Товары.ТекущиеДанные.Принял;
	//Иначе 
	//	ОткрытьЗначение(Элементы.Товары.ТекущиеДанные.Номенклатура);
	//КонецЕсли;
КонецПроцедуры

