
&НаКлиенте
Процедура Добавить(Команда)
	
	Форма = ПолучитьФорму("Документ.Презентація.ФормаОбъекта");
	Если Форма = Неопределено Тогда 
		Возврат
	КонецЕсли;
   Форма.Открыть();
КонецПроцедуры


&НаКлиенте
Процедура ВідображатиАрхівніПриИзменении(Элемент)
	Отбор =  Список.КомпоновщикНастроек.Настройки.Отбор.Элементы[0];
	Отбор.Использование = НЕ ВідображатиАрхівні;
	
	
	
КонецПроцедуры

&НаСервере
Процедура ВилучитиЗамовленняНаСервере()
	// Вставити вміст обробника.
КонецПроцедуры

&НаКлиенте
Процедура ВилучитиЗамовлення(Команда)
	ВилучитиЗамовленняНаСервере();
КонецПроцедуры
