&НаКлиенте
Перем глТекстПошуку;

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Запрос = Новый Запрос;
	
		Запрос.Текст = "ВЫБРАТЬ
		               |	Номенклатура.Ссылка
		               |ИЗ
		               |	Справочник.Номенклатура КАК Номенклатура
		               |ГДЕ
		               |	Номенклатура.Просмотр
		               |	И НЕ Номенклатура.ЭтоГруппа";
		
	ТЗТовары = Запрос.Выполнить().Выгрузить();
	МассивОтбора = ТЗТовары.ВыгрузитьКолонку("Ссылка"); 
	
	ТЗРодителей = ПолучитьРодителейНоменклатуры(ТзТовары, Новый Массив);
	Пока ЗначениеЗаполнено(ТЗРодителей) Цикл	
		Для Каждого Строка Из ТЗРодителей Цикл
			Если МассивОтбора.Найти(Строка.Ссылка) = Неопределено  Тогда 
				//НовСтрока = ТзНоменклатура.Вставить(0);
				МассивОтбора.Добавить(Строка.Ссылка);
			КонецЕсли;
			//ЗаполнитьЗначенияСвойств(НовСтрока,Строка);
		КонецЦикла;
		ТЗРодителей = ПолучитьРодителейНоменклатуры(ТЗРодителей,МассивОтбора);
	КонецЦикла;

	// ТзНоменклатура
	//ОтборПоГруппе = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	//ОтборПоГруппе.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Ссылка");
	//ОтборПоГруппе.ВидСравнения = ВидСравненияКомпоновкиДанных.НеВСписке;
	//ОтборПоГруппе.ПравоеЗначение = МассивОтбора;
	//ОтборПоГруппе.Использование = Истина;

	ЭлементОформления = Список.УсловноеОформление.Элементы.Добавить();
    ЭлементОформления.Оформление.УстановитьЗначениеПараметра("Видимость", Ложь);

	ЭлементОформления = Список.УсловноеОформление.Элементы.Добавить();
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("Видимость", Истина );
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("Отображать",Истина );
	
    ОтборПоГруппе = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
    ОтборПоГруппе.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Ссылка");
    ОтборПоГруппе.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
    ОтборПоГруппе.ПравоеЗначение = МассивОтбора;
	
	РежимВыбора = Параметры.РежимВыбора;
	ТипЦен = ?(ЗначениеЗаполнено(Параметры.ТипЦен), Параметры.ТипЦен, Справочники.ТипыЦенНоменклатуры.НайтиПоНаименованию("Цена продажи (кг)"));
	Товары = Параметры.Товары;
	УИД = Параметры.УИД;
	Список.Параметры.УстановитьЗначениеПараметра("ТипЦенПродажи", ТипЦен);
	
	//ОтборКатегория = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	////ОтборКатегория.Родитель = ГруппаОтбор;
	//ОтборКатегория.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("КатегорияВСписке");
	//ОтборКатегория.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	//ОтборКатегория.Использование = СписокКатегорий.Количество() > 0;
	//ОтборКатегория.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
	//ОтборКатегория.ПравоеЗначение = Истина;
	
	Список.Параметры.УстановитьЗначениеПараметра("СписокКатегорий", СписокКатегорий);
	Список.Параметры.УстановитьЗначениеПараметра("СписокКатегорийИспользование", Ложь);
	Список.Параметры.УстановитьЗначениеПараметра("ЦенаОт", 0);
	Список.Параметры.УстановитьЗначениеПараметра("ЦенаДО", 0);
	Список.Параметры.УстановитьЗначениеПараметра("ЦенаИспользование", Ложь);
	Список.Параметры.УстановитьЗначениеПараметра("СОстатками", ложь);
	Список.Параметры.УстановитьЗначениеПараметра("Целевой", отборЦелевый);
	Список.Параметры.УстановитьЗначениеПараметра("СВидео", отборВидео);
	Список.Параметры.УстановитьЗначениеПараметра("НетВидео", отборНетВидео);
	Список.Параметры.УстановитьЗначениеПараметра("Акции", ОтборАкции);
	Список.Параметры.УстановитьЗначениеПараметра("Новые", ОтборНовые);
	Список.Параметры.УстановитьЗначениеПараметра("Дата", НачалоДня(ТекущаяДата()));
	Список.Параметры.УстановитьЗначениеПараметра("ДатаНачала", Дата(1,1,1));
	Список.Параметры.УстановитьЗначениеПараметра("ДатаОкончание",  Дата(1,1,1));
	Список.Параметры.УстановитьЗначениеПараметра("МасивПоиска", ПолучитьПустуюСсылкуНоменклатуры());
	Список.Параметры.УстановитьЗначениеПараметра("КоличествоВМасиве", 0);


	
	//Список.Параметры.УстановитьЗначениеПараметра("Дата", ТекущаяДата());
	
	ЭлементОформления = Список.УсловноеОформление.Элементы.Добавить();
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("ЦветФона", Новый Цвет(250,200,200) );
	//ЭлементОформления.Оформление.УстановитьЗначениеПараметра("Отображать",Истина );
	

    ОтборЦвета = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
    ОтборЦвета.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Ссылка");
    ОтборЦвета.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
    ОтборЦвета.ПравоеЗначение = Товары.ВыгрузитьЗначения();

	
	//Список.УсловноеОформление.Элементы[1].Отбор.Элементы[0].ПравоеЗначение = Товары.ВыгрузитьЗначения();
	
	//Элемент = Список.УсловноеОформление.Элементы[1];
	//
	//Элемент.Значение = Товары;   
	//ЗапросПоКатегориям = Новый Запрос;
	//ЗапросПоКатегориям.Текст = "ВЫБРАТЬ
	//                           |	КатегорииОбъектов.Ссылка КАК Значение
	//                           |ИЗ
	//                           |	Справочник.КатегорииОбъектов КАК КатегорииОбъектов
	//                           |ГДЕ
	//                           |	НЕ КатегорииОбъектов.ПометкаУдаления";
	//СписокКатегорий.ЗагрузитьЗначения(ЗапросПоКатегориям.Выполнить().Выгрузить().ВыгрузитьКолонку("Значение"));
	
	Отбор = Список.Отбор;
	Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));

	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьПустуюСсылкуНоменклатуры()
	Возврат Справочники.Номенклатура.ПустаяСсылка();
КонецФункции


Функция ПолучитьРодителейНоменклатуры(ТзНоменклатура,СписокГрупп)
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	|	Номенклатура.Родитель.Ссылка КАК Ссылка,
	|	Номенклатура.Родитель.Наименование КАК Наименование,
	|	Номенклатура.Родитель.ЭтоГруппа КАК ЭтоГруппа,
	|	Номенклатура.Родитель.Родитель КАК Родитель
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	Номенклатура.Ссылка В(&СписокРодителей)
	|	И НЕ Номенклатура.Родитель.ПометкаУдаления
	|	И НЕ Номенклатура.Родитель.Ссылка В (&СписокГрупп)
	|
	|СГРУППИРОВАТЬ ПО
	|	Номенклатура.Родитель.Ссылка,
	|	Номенклатура.Родитель.Наименование,
	|	Номенклатура.Родитель.ЭтоГруппа,
	|	Номенклатура.Родитель.Родитель";
	
	Запрос.УстановитьПараметр("СписокРодителей",ТзНоменклатура.ВыгрузитьКолонку("Ссылка"));
	Запрос.УстановитьПараметр("СписокГрупп",СписокГрупп);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если ЭтоГруппа(ВыбраннаяСтрока) Тогда 
		Возврат;
	КонецЕсли;
	

	Попытка
		Если ЭтаФорма.ВладелецФормы.Имя = "Напоминание_Товары_Номенклатура" Тогда 
			СтандартнаяОбработка = Ложь;
			ОповеститьОВыборе(ВыбраннаяСтрока);
			ОбработкаОповещения("ДоданоТовар", ВыбраннаяСтрока, ЭтаФорма);
			Возврат;
		КонецЕсли;
	Исключение
	КонецПопытки;
	
		
	Если РежимВыбора Тогда 
		СтандартнаяОбработка = Ложь;
		ФормаНоменклатуры = ПолучитьФорму("Справочник.Номенклатура.Форма.ФормаЭлементаВыбор",Новый Структура("Ключ, ТипЦен, УИД",ВыбраннаяСтрока,ТипЦен, УИД),ЭтаФорма);
		ФормаНоменклатуры.Открыть();
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЭтоГруппа(Номенклатура)
	Возврат Номенклатура.ЭтоГруппа;
КонецФункции

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	ОповеститьОВыборе(ВыбранноеЗначение);
КонецПроцедуры


&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "ДоданоТовар" Тогда 

		ОбновитьУсловноеОформление(Параметр);
		ЭтаФорма.ОбновитьОтображениеДанных();
		Элементы.Список.Обновить();
		
	ИначеЕсли ИмяСобытия = "ДОбавитьУРассылку" Тогда 

		ДобавитьВГруповуюОтправкуНаСервере(Параметр);

		
	КонецЕсли;

		 
КонецПроцедуры

&НаСервере
Процедура ОбновитьУсловноеОформление(Параметр)
	Список.УсловноеОформление.Элементы[2].Отбор.Элементы[0].ПравоеЗначение.Добавить(Параметр);
	
КонецПроцедуры

&НаКлиенте
Процедура Закрити(Команда)
	Закрыть();
КонецПроцедуры

&НаСервере
Процедура ОновитиЗалишкиТаЦіниНаСервере()
	//Обмен_УправлениеОбменом.ОновитиЗалишкиТаЦіни();
	
	ФоновоеЗадания = ФоновыеЗадания.Выполнить("Обмен_УправлениеОбменом.ОновитиЗалишкиТаЦіни",,Строка(КлючФоновогоЗадания)); 
	КлючФоновогоЗадания = ФоновоеЗадания.УникальныйИдентификатор;

КонецПроцедуры

&НаКлиенте
Процедура ОновитиЗалишкиТаЦіни(Команда)

	ОновитиЗалишкиТаЦіниНаСервере();
	ПодключитьОбработчикОжидания("ОжиданиеЗавершенияФоновогоЗадания", 15);
	
КонецПроцедуры


&НаКлиенте
Процедура ОжиданиеЗавершенияФоновогоЗадания()
	Виполнено = Ложь;
	ОжиданиеЗавершенияФоновогоЗаданияНаСервере(Виполнено);
	Если Виполнено Тогда 
		ОтключитьОбработчикОжидания("ОжиданиеЗавершенияФоновогоЗадания");
	КонецЕсли;
КонецПроцедуры


&НаСервере
Процедура ОжиданиеЗавершенияФоновогоЗаданияНаСервере(Виполнено)
	
	ФоновоеЗадания =  ФоновыеЗадания.НайтиПоУникальномуИдентификатору(КлючФоновогоЗадания);
	Если ФоновоеЗадания = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	 
	Если ФоновоеЗадания.Состояние = СостояниеФоновогоЗадания.Завершено
		или ФоновоеЗадания.Состояние = СостояниеФоновогоЗадания.Отменено Тогда 
		Элементы.Список.Обновить();	
		Сообщить("Залишки оновлено!");
		Виполнено = Истина;
	ИначеЕсли ФоновоеЗадания.Состояние = СостояниеФоновогоЗадания.ЗавершеноАварийно Тогда 
		Сообщить("Невдалося оновити залишки");
		Виполнено = Истина;
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
Процедура СписокКатегорийПриИзмененииНаСервере()
	
	Список.Параметры.УстановитьЗначениеПараметра("СписокКатегорий", СписокКатегорий);
	Список.Параметры.УстановитьЗначениеПараметра("СписокКатегорийИспользование", СписокКатегорий.Количество()>0);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокКатегорийПриИзменении(Элемент)
	
	СписокКатегорийПриИзмененииНаСервере();
	ИзменитьОтображениеДерева();
	Элементы.Список.Обновить();
	
КонецПроцедуры

&НаСервере
Процедура ЦенаИспользованиеПриИзмененииНаСервере()
	
	Если ЦенаДо < ЦенаОт Тогда 
		ЦенаДо = 100000;
	КонецЕсли;
	
	Список.Параметры.УстановитьЗначениеПараметра("ЦенаИспользование", ЦенаИспользование);
	Список.Параметры.УстановитьЗначениеПараметра("ЦенаОт", ЦенаОт);
	Список.Параметры.УстановитьЗначениеПараметра("ЦенаДо", ЦенаДо);
	
КонецПроцедуры

&НаКлиенте
Процедура ЦенаИспользованиеПриИзменении(Элемент)
	
	ЦенаИспользованиеПриИзмененииНаСервере();
	ИзменитьОтображениеДерева();
	Элементы.Список.Обновить();
	
КонецПроцедуры

&НаКлиенте
Процедура ЦенаДоПриИзменении(Элемент)
	
	ЦенаИспользование = Истина;
	ЦенаИспользованиеПриИзмененииНаСервере();
	ИзменитьОтображениеДерева();
	Элементы.Список.Обновить();
	
КонецПроцедуры

&НаКлиенте
Процедура ЦенаОтПриИзменении(Элемент)
	
	ЦенаИспользование = Истина;
	ЦенаИспользованиеПриИзмененииНаСервере();
	ИзменитьОтображениеДерева();
	Элементы.Список.Обновить();
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьОтображениеДерева()
	
	Если СписокКатегорий.Количество()>0 ИЛИ ЦенаИспользование Тогда
		Элементы.Список.Отображение = ОтображениеТаблицы.Список;
	Иначе
		Элементы.Список.Отображение = ОтображениеТаблицы.Дерево;
	КонецЕсли;
	
КонецПроцедуры


&НаСервере
Процедура СОстаткамиПриИзмененииНаСервере()
	Список.Параметры.УстановитьЗначениеПараметра("СОстатками", СОстатками);
КонецПроцедуры


&НаКлиенте
Процедура СОстаткамиПриИзменении(Элемент)
	СОстаткамиПриИзмененииНаСервере();
КонецПроцедуры


&НаСервере
Процедура кмСкинутиНоменклатуруУВайберНаСервере()
	
КонецПроцедуры


&НаКлиенте
Процедура кмСкинутиНоменклатуруУВайбер(Команда)
	ТекущаяСтрока = Элементы.Список.ТекущаяСтрока;
	Если ТекущаяСтрока = Неопределено Тогда 
		Возврат;
	КонецЕсли;


	ТекстСообщения =  Общий.ПолучитьТекстОписанияНоменклатуры(ТекущаяСтрока);
	
	#Если МобильноеПриложениеКлиент Тогда
		
		НовВз = Новый ЗапускПриложенияМобильногоУстройства();
		
		НовВз.Действие = "android.intent.action.SEND";
		НовВз.Приложение = "com.viber.voip"; 
		НовВз.ИмяКласса = "com.viber.voip.WelcomeShareActivity"; 
		НовВз.Тип = "text/plain";
		НовВз.ДополнительныеДанные.Добавить("android.intent.extra.TEXT", СокрЛП(ТекстСообщения));
		
		НовВз.Запустить(Истина);
	#Иначе 
		Сообщить(ТекстСообщения);
	#КонецЕсли

	
КонецПроцедуры


&НаКлиенте
Процедура ДобавитьВГруповуюОтправку(Команда)
	ТекущиеДанные = Элементы.Список.ТекущаяСтрока;
	Если ТекущиеДанные = Неопределено Тогда 
		Возврат;
	КонецЕсли;

	Данные = Новый Структура("Номенклатура", ТекущиеДанные);

	ДобавитьВГруповуюОтправкуНаСервере(Данные);
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьВГруповуюОтправкуНаСервере(Данные)
	Перем СтрокаРассылки;
	Элементы.Рассылка.Видимость = истина;
	элементы.ОтправитьРассылку.Видимость = Истина;
	
	Если Данные.Свойство("Характеристика") Тогда 
		Отбор = Новый Структура("Номенклатура, Характеристика", Данные.Номенклатура, Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка());
		Строки = ТоварыДляРассылки.НайтиСтроки(Отбор);
		Если Строки.Количество() Тогда 
			Строки[0].Характеристика = Данные.Характеристика;
			Возврат;
		КонецЕсли;
		
	Иначе
		
		//Если Не Данные.Свойство("Характеристика") Тогда 
		Данные.вставить("Характеристика", Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка())
	КонецЕсли;	
	
	Если ТоварыДляРассылки.НайтиСтроки(Данные).Количество() Тогда 
		Возврат;
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(ТоварыДляРассылки.Добавить(), Данные);
		
КонецПроцедуры


&НаКлиенте
Процедура ДеталиПоМешках(Команда)
	Форма = ПолучитьФорму("Справочник.Номенклатура.Форма.ФормаДеталиХарактеристик");
	форма.Открыть();
КонецПроцедуры


&НаКлиенте
Процедура отборЦелевыйПриИзменении(Элемент)
	Список.Параметры.УстановитьЗначениеПараметра("Целевой", отборЦелевый);

КонецПроцедуры


&НаКлиенте
Процедура отборВидеоПриИзменении(Элемент)
	отборНетВидео = Ложь;
	Список.Параметры.УстановитьЗначениеПараметра("СВидео", отборВидео);
	Список.Параметры.УстановитьЗначениеПараметра("НетВидео", отборНетВидео);

КонецПроцедуры


&НаСервере
Процедура ОтправитьРассылкуНаСервере()
	// Вставить содержимое обработчика.
КонецПроцедуры


&НаКлиенте
Процедура ОтправитьРассылку(Команда)
	Перем мКонтрагент;
	
	Если Не ТоварыДляРассылки.Количество() Тогда 
		Возврат;
	КонецЕсли;
	
	//мКонтрагент = Справочники.Контрагенты.ПустаяСсылка();
	//ВвестиЗначение(мКонтрагент, "Кому відправити?", Тип("СправочникСсылка.Контрагенты"));
	//Если мКонтрагент.Пустая() Тогда 
	//	Возврат;
	//КонецЕсли;
	ТекстСообщения = "";
	Для Каждого Элемент Из ТоварыДляРассылки Цикл 
		Если Элемент.Характеристика.Пустая() Тогда 
			Продолжить;
		КонецЕсли;
		
		ТекстСообщения = ТекстСообщения + Символы.ПС + Общий.ОтправитьНоменклатуруУВайбер(Элемент.Характеристика);
		//Если ТекстСообщения = Ложь Тогда 
		//	Сообщить("Не вдалося сформувати текст повідомлення");
		//КонецЕсли;
	КонецЦикла;

	#Если МобильноеПриложениеКлиент Тогда
		
		НовВз = Новый ЗапускПриложенияМобильногоУстройства();
		
		НовВз.Действие = "android.intent.action.SEND";
		НовВз.Приложение = "com.viber.voip"; 
		НовВз.ИмяКласса = "com.viber.voip.WelcomeShareActivity"; 
		НовВз.Тип = "text/plain";
		НовВз.ДополнительныеДанные.Добавить("android.intent.extra.TEXT", СокрЛП(ТекстСообщения));
		
		НовВз.Запустить(Истина);
	#Иначе 
		Сообщить(ТекстСообщения);
	#КонецЕсли

	 ТоварыДляРассылки.Очистить();
	 Элементы.ТоварыДляРассылки.Видимость = Ложь;
	 Элементы.ОтправитьРассылку.Видимость = Ложь;
	 
КонецПроцедуры


&НаКлиенте
Процедура ТоварыДляРассылкиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	мПараметры = Новый Структура;
	мПараметры.Вставить("Объект", Элемент.ТекущиеДанные.Номенклатура);
	мПараметры.Вставить("СтрокаРассылки", ВыбраннаяСтрока);
	ОткрытьЗначение(Элемент.ТекущиеДанные.Номенклатура);
	//ПолучитьФорму("Справочник.Номенклатура.Форма.ФормаЭлемента", мПараметры).Открыть();
	
КонецПроцедуры


&НаКлиенте
Процедура отборНетВидеоПриИзменении(Элемент)
	отборВидео = Ложь;
	Список.Параметры.УстановитьЗначениеПараметра("СВидео", отборВидео);
	Список.Параметры.УстановитьЗначениеПараметра("НетВидео", отборНетВидео);
	
КонецПроцедуры


&НаКлиенте
Процедура ОтборАкцииПриИзменении(Элемент)
	
		Список.Параметры.УстановитьЗначениеПараметра("Акции", ОтборАкции);

КонецПроцедуры


&НаКлиенте
Процедура ОтборНовыеПриИзменении(Элемент)
		Список.Параметры.УстановитьЗначениеПараметра("Новые", ОтборНовые);

КонецПроцедуры

&НаКлиенте
Процедура кмСкинутиУВайберЗаказВидео(Команда)
    Клієнтський.СкинутиУВайберЗаказВидео(Элементы.Список.ТекущаяСтрока);
КонецПроцедуры

&НаКлиенте
Процедура ОтборДатаПоступленняПриИзменении(Элемент)
	
	ДатаНачала = ОтборДатаПоступлення.ДатаНачала;
	ДатаОкончания = ОтборДатаПоступлення.ДатаОкончания;
	
	Список.Параметры.УстановитьЗначениеПараметра("ДатаНачала", ДатаНачала);
	Список.Параметры.УстановитьЗначениеПараметра("ДатаОкончание",  ДатаОкончания);

	
КонецПроцедуры

&НаКлиенте
Процедура СортуванняПриИзменении(Элемент)
	ЭлПорядок = Список.Порядок.Элементы[1];
	ЭлПорядок.Использование = Сортування;
	Список.Порядок.Элементы[0].Использование = Не Сортування;
	Если Сортування Тогда 
		Если ЭлПорядок.ТипУпорядочивания = НаправлениеСортировкиКомпоновкиДанных.Возр Тогда 
			Элементы.Возр.Видимость = Истина;
		Иначе
			Элементы.Убыв.Видимость = Истина;
		КонецЕсли;
	Иначе
		Элементы.Возр.Видимость = Ложь;
		Элементы.Убыв.Видимость = Ложь;
	КонецЕсли;
	
		
КонецПроцедуры

&НаКлиенте
Процедура УбывНажатие(Элемент)
	Элементы.Возр.Видимость = Истина;
	Элементы.Убыв.Видимость = Ложь;

	ЭлПорядок = Список.Порядок.Элементы[1];
	ЭлПорядок.ТипУпорядочивания = НаправлениеСортировкиКомпоновкиДанных.Возр
КонецПроцедуры

&НаКлиенте
Процедура ВозрНажатие(Элемент)
	Элементы.Возр.Видимость = Ложь;
	Элементы.Убыв.Видимость = Истина;

	ЭлПорядок = Список.Порядок.Элементы[1];
	ЭлПорядок.ТипУпорядочивания = НаправлениеСортировкиКомпоновкиДанных.Убыв

КонецПроцедуры

&НаКлиенте
Процедура ПошукПоЧастиніРядкаПриИзменении(Элемент)
	глТекстПошуку = ПошукПоЧастиніРядка;
	ЗдійснитиПошук();
КонецПроцедуры



&НаКлиенте
Процедура ПриОткрытии(Отказ)
	//Элементы.Список.Отображение = ОтображениеТаблицы.Список
КонецПроцедуры

&НаКлиенте
Процедура ПошукПоЧастиніРядкаИзменениеТекстаРедактирования(Элемент, Текст, СтандартнаяОбработка)
	глТекстПошуку = Текст;
	СтандартнаяОбработка = Ложь;
	ОтключитьОбработчикОжидания("ЗдійснитиПошук");
	ПодключитьОбработчикОжидания("ЗдійснитиПошук", 0.7, Истина);	
КонецПроцедуры

&НаКлиенте
Процедура ЗдійснитиПошук()
	ОтключитьОбработчикОжидания("ЗдійснитиПошук");
	
	
	
	
	МассивПоиска = СтрРазделить(глТекстПошуку, " ", Ложь);
	Если НЕ МассивПоиска.Количество() Тогда 
		Список.Параметры.УстановитьЗначениеПараметра("КоличествоВМасиве", 0);
		Список.Параметры.УстановитьЗначениеПараметра("МасивПоиска", ПолучитьПустуюСсылкуНоменклатуры());
		Возврат;
	КонецЕсли;
	
	ТаблицаРезультатов = ПолучитьРезультати(МассивПоиска[0]);
	

	
	МасивРезультатов = Новый Массив;
	
	Для Каждого Стр Из ТаблицаРезультатов Цикл
		РезультатПоАртикулу = Истина;
		РезультатПоНаименованию = Истина;

		Для ИтМас = 1 По МассивПоиска.Количество() -1 Цикл
			Если Найти(нрег(Стр.Артикул), нрег(МассивПоиска[ИтМас])) = 0 Тогда 
				РезультатПоАртикулу = Ложь;
			КонецЕсли;
			
			Если Найти(нрег(Стр.Наименование), нрег(МассивПоиска[ИтМас])) = 0 Тогда 
				РезультатПоНаименованию = Ложь;
			КонецЕсли;			
		КонецЦикла;
		Если РезультатПоАртикулу ИЛИ РезультатПоНаименованию Тогда 
			МасивРезультатов.Добавить(Стр.Ссылка);
		КонецЕсли;		
	КонецЦикла;
	
	Список.Параметры.УстановитьЗначениеПараметра("МасивПоиска", МасивРезультатов);
	Список.Параметры.УстановитьЗначениеПараметра("КоличествоВМасиве", 1);
	
	
	//Список.Параметры.УстановитьЗначениеПараметра("СтрокаПоиска", СтрЗаменить(ПошукПоЧастиніРядка," ","%"));

	
	
	
	//Список.Параметры.УстановитьЗначениеПараметра("СтрокаПоиска", СтрЗаменить(глТекстПошуку," ","%"));	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьРезультати(СтрокаПоиска)
		з = новый Запрос;
	з.Текст = "ВЫБРАТЬ
	          |	Номенклатура.Ссылка КАК Ссылка,
	          |	Номенклатура.Наименование КАК Наименование,
	          |	Номенклатура.Артикул КАК Артикул
	          |ИЗ
	          |	Справочник.Номенклатура КАК Номенклатура
	          |ГДЕ
	          |	(Номенклатура.Наименование ПОДОБНО &Наименование
	          |			ИЛИ Номенклатура.Артикул ПОДОБНО &Наименование)";
	з.УстановитьПараметр("Наименование", "%" + СтрокаПоиска + "%");
	МассивРезультатов = Новый Массив;
	Выборка =  з.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		МассивРезультатов.Добавить(Новый Структура("Ссылка, Наименование, Артикул", Выборка.Ссылка, Выборка.Наименование, Выборка.Артикул));
	КонецЦикла;
	Возврат МассивРезультатов;

КонецФункции



&НаКлиенте
Процедура ПошукПоЧастиніРядкаОчистка(Элемент, СтандартнаяОбработка)
	Список.Параметры.УстановитьЗначениеПараметра("КоличествоВМасиве", 0);
	Список.Параметры.УстановитьЗначениеПараметра("МасивПоиска", ПолучитьПустуюСсылкуНоменклатуры());
	глТекстПошуку = ПолучитьПустуюСсылкуНоменклатуры();
КонецПроцедуры




глТекстПошуку = ПолучитьПустуюСсылкуНоменклатуры();


