
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если Не ЗначениеЗаполнено(Ответственный) Тогда
		Ответственный = ПараметрыСеанса.ТекущийПользователь;
	КонецЕсли;	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	Если Не ЗначениеЗаполнено(ДатаПланирования) Тогда
		Предупреждение("Заполните дату планирования!");
		Отказ = Истина;
		Возврат;
	КонецЕсли;	   
	Если Не ЗначениеЗаполнено(ТорговыеАгент) Тогда
		Предупреждение("Заполните торгового агента!");
		Отказ = Истина;
		Возврат;
	КонецЕсли;		
	    
	// регистр ПланПродажПоТорговым 
	Движения.ПланПродажПоТорговым.Записывать = Истина;
	Движения.ПланПродажПоТорговым.Очистить();
	ПериодДень = ДатаПланирования;                                  
	КоличествоДнейВПериоде = ((КонецМесяца(ДатаПланирования) + 1) - ДатаПланирования) / (60 * 60 * 24);
	Пока ПериодДень < КонецМесяца(ДатаПланирования) Цикл
		Для Каждого ТекСтрокаСоставПлана Из СоставПлана Цикл
			Движение = Движения.ПланПродажПоТорговым.Добавить();
			Движение.Период = ПериодДень;
			Движение.ТорговыеАгент = ТорговыеАгент;
			Движение.Область = ТекСтрокаСоставПлана.Область;
			Движение.ВыручкаПлан = ТекСтрокаСоставПлана.ВыручкаПлан / КоличествоДнейВПериоде;
			Движение.Прогноз = ТекСтрокаСоставПлана.Прогноз / КоличествоДнейВПериоде;
			Движение.ТонажПлан = ТекСтрокаСоставПлана.ТонажПлан / КоличествоДнейВПериоде;
			Движение.ТорговыеТочкиПлан = ТекСтрокаСоставПлана.ТорговыеТочкиПлан / КоличествоДнейВПериоде;
			Движение.НовыеТорговыеТочкиПлан = ТекСтрокаСоставПлана.НовыеТорговыеТочкиПлан / КоличествоДнейВПериоде;
			Движение.SKUПлан = ТекСтрокаСоставПлана.SKUПлан / КоличествоДнейВПериоде;
			Движение.SKUЦіліПлан = ТекСтрокаСоставПлана.SKUЦіліПлан / КоличествоДнейВПериоде;
			Движение.АктивніОП = ТекСтрокаСоставПлана.АктивніОП / КоличествоДнейВПериоде;
			Движение.НеактивніОП = ТекСтрокаСоставПлана.НеактивніОП / КоличествоДнейВПериоде;
			Движение.МалоактивніОП = ТекСтрокаСоставПлана.МалоактивніОП / КоличествоДнейВПериоде;
		КонецЦикла;  
		
		ПериодДень = ПериодДень + (60 * 60 * 24);
	КонецЦикла;
КонецПроцедуры
