Перем мЭтоОбмен Экспорт;



Процедура ПриЗаписи(Отказ)
	Если мЭтоОбмен <> Истина И ВивантажуватиВ1С Тогда 
		Общий.ЗарегистрироватьИзменения(ЭтотОбъект.Ссылка);		
	КонецЕсли;
	Если Не ВивантажуватиВ1С Тогда 
		НаборЗаписей = РегистрыСведений.РегистрацияОбмена.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Объект.Установить(Ссылка);
		НаборЗаписей.Записать();
	КонецЕсли;
	
	
	

	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если Не Архив Тогда 
		Архив = ЭтотОбъект.ПометкаУдаления;
	КонецЕсли;
	Для Каждого Стр Из Товары Цикл
		Если Стр.Цена = 0 Тогда 
			Стр.Цена = Стр.ЦенаПродажиВес * Стр.ХарактеристикаНоменклатуры.Вага;
		КонецЕсли;
		Если Стр.Сума = 0 Тогда 
			Стр.Сума = Стр.Цена * Стр.Количество;
		КонецЕсли;
	КонецЦикла;
	
	
	Сума = Товары.Итог("Сума");
	
КонецПроцедуры



мЭтоОбмен = Ложь;

