


&НаКлиенте
Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)
	если не  ДозволитиЗакритяФорми тогда 
		отказ = истина;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатиНаСервере()
Запис = РегистрыСведений.Кілометраж.СоздатьМенеджерЗаписи();
запис.Кілометраж = Кілометри;
Запис.Период = Период;
запис.СтатусДня = СтатусДня;
Запис.Записать();
ДозволитиЗакритяФорми = Истина;
КонецПроцедуры

&НаКлиенте
Процедура Записати(Команда)
	Если Не Кілометри Тогда 
		Возврат;
	КонецЕсли;
	Если Не ЕстьПароль() Тогда 
		Предупреждение("Введіть пароль та зробіть обмін");
		Возврат;
	КонецЕсли;
	
	
	ЗаписатиНаСервере();
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	//Если Заголовок = "НачалоДня" Тогда
	//	Элементы.Заголовок.Заголовок = "Введіть кілометраж на початок дня!";
	//ИначеЕсли 
	//	Элементы.Заголовок.Заголовок = "Введіть кілометраж на кінець дня!";
	//КонецЕсли;
	Элементы.Заголовок.Заголовок =  Заголовок;
	ЭтаФорма.Заголовок = СтатусДня;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	СтатусДня = Параметры.СтатусДня;
	ДозволитиЗакритяФорми = Параметры.ДозволитиЗакритяФорми;
	Заголовок = Параметры.Заголовок;
	Период = Параметры.Период;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЕстьПароль() 
	Возврат НЕ ПустаяСтрока(Константы.ПарольВхода.Получить());
КонецФункции


	
