
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	Если Общий.АвтообмінВключений() Тогда
		
		Возврат;
	КонецЕсли;
	
			ФормаОбмена = ПолучитьФорму("ОбщаяФорма.ФормаОбмена",Новый Структура("РежимВыполненияОбмена",2));
		//Для Каждого Строка Из Объект.Товары Цикл
		//	НовСтрока = ФормаДобавления.ТаблицаВыбора.Добавить();
		//	ЗаполнитьЗначенияСвойств(НовСтрока,Строка);
		//КонецЦикла;
	 УстановитьНеПервыйОбмен();
	ФормаОбмена.ОткрытьМодально();

	
КонецПроцедуры

&НаСервере
Процедура УстановитьНеПервыйОбмен()
	Константы.ЭтоНеПервыйОбмен.Установить(Ложь);
КонецПроцедуры

