
&НаСервере
Функция  ЗаписатьНаСервере()
	Структура = Новый Структура;
	Структура.Вставить("В978", Евро);
	Структура.Вставить("В840", Долар);
	Ответ = Обмен_УправлениеОбменом.ВыполнитьОбменДаннымиКурсиВалют(Структура);
	
	Если Ответ.Результат Тогда 
		Константы.КурсUSD.Установить(Долар);
		Константы.КурсEUR.Установить(Евро);
		СообщениеПользователю = "Курси оновлено успішно";
	Иначе
		СообщениеПользователю = Ответ.Ошибка;
	КонецЕсли;
	
	Возврат СообщениеПользователю; 

КонецФункции

&НаКлиенте
Процедура Записать(Команда)
	Сообщить(ЗаписатьНаСервере());
	Закрыть();
КонецПроцедуры

&НаСервере
Процедура ПриОткрытииНаСервере()
	Долар = Константы.КурсUSD.Получить();
	Евро =  Константы.КурсEUR.Получить();

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПриОткрытииНаСервере();
КонецПроцедуры
