Перем мЭтоОбмен Экспорт;



Процедура ПриЗаписи(Отказ)
	Если мЭтоОбмен <> Истина И ВивантажуватиВ1С Тогда 
		Общий.ЗарегистрироватьИзменения(ЭтотОбъект.Ссылка);
	КонецЕсли;
	Если Не ВивантажуватиВ1С Тогда 
		НаборЗаписей = РегистрыСведений.РегистрацияОбмена.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Объект.Установить(Ссылка);
		НаборЗаписей.Записать();
	КонецЕсли;
	
	Если ЗначениеЗаполнено(МаршрутныйЛист) И Общий.ОбъектБДСуществует(МаршрутныйЛист) Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	МаршрутныйЛистЗаказы.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.МаршрутныйЛист.Заказы КАК МаршрутныйЛистЗаказы
		|ГДЕ
		|	МаршрутныйЛистЗаказы.ЗаказПокупателя = &ЗаказПокупателя";
		
		Запрос.УстановитьПараметр("ЗаказПокупателя", Ссылка);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Если ВыборкаДетальныеЗаписи.Следующий() Тогда
			//
		Иначе
			МаршрутныйЛистОбъект = МаршрутныйЛист.ПолучитьОбъект();
			НоваяСтрока = МаршрутныйЛистОбъект.Заказы.Добавить();
			НоваяСтрока.ЗаказПокупателя = Ссылка;
			НоваяСтрока.Город = Контрагент.Город;
			НоваяСтрока.Контрагент = Контрагент;
			МаршрутныйЛистОбъект.Записать(РежимЗаписиДокумента.Запись, РежимПроведенияДокумента.Неоперативный);		
		КонецЕсли; 	
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если Не Архив Тогда 
		Архив = ЭтотОбъект.ПометкаУдаления;
	КонецЕсли;
	
	Сума = Товары.Итог("Сума");
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	Архив = Ложь;
	МаршрутныйЛист = Неопределено;

КонецПроцедуры

мЭтоОбмен = Ложь;

