 Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь; // отключаем стандартный вывод отчета - будем выводить программно 

	Настройки = КомпоновщикНастроек.ПолучитьНастройки() ;// Получаем настройки отчета 
	
	//Настройки.Структура[0].Отбор.Элементы[0]
	Если ТорговыеАгентыОтбор.Количество() > 0 Тогда
		Настройки.Структура[0].Отбор.Элементы[0].Использование = Истина;
		Настройки.Структура[0].Отбор.Элементы[0].ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
		Настройки.Структура[0].Отбор.Элементы[0].ПравоеЗначение = ТорговыеАгентыОтбор;
	Иначе
		Настройки.Структура[0].Отбор.Элементы[0].Использование = Ложь;
	КонецЕсли;	
	
	ДанныеРасшифровки = Новый ДанныеРасшифровкиКомпоновкиДанных; // Создаем данные расшифровки 
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных; // Создаем компоновщик макета 
	// Инициализируем макет компоновки используя схему компоновки данных 
	// и созданные ранее настройки и данные расшифровки
	СхемаКомпоновкиДанных = ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, Настройки, ДанныеРасшифровки);
	
	
	// Скомпонуем результат
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки, , ДанныеРасшифровки);
	
	ДокументРезультат.Очистить();
	
	// Выводим результат в табличный документ
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);	
	ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	
	// Устанавливаем фиксацию в табличном документе
	ДокументРезультат.ФиксацияСлева = 1;	
	
	Попытка
		Если Настройки.ПараметрыДанных.Элементы.Найти("СворачиватьСтроки").Использование Тогда
			Если Настройки.ПараметрыДанных.Элементы.Найти("СворачиватьСтроки").Значение Тогда	
				// Установим уровень группировки
				ДокументРезультат.ПоказатьУровеньГруппировокСтрок(0);
			КонецЕсли;	
		КонецЕсли;	
	Исключение
	КонецПопытки;

КонецПроцедуры