
Функция ПолучитьПоследнююХарактеристикуТовара(Номенклатура) Экспорт  // + <Пляшко Т. І., Intrata, 08.12.2020, JIRA LS-15>
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ВложенныйЗапрос.Ссылка,
		|	ВложенныйЗапрос.Характеристика
		|ИЗ
		|	(ВЫБРАТЬ
		|		Товар.Ссылка КАК Ссылка,
		|		ВЫБОР
		|			КОГДА ЕСТЬNULL(ПоступлениеТоваровУслугТовары.ХарактеристикаНоменклатуры, ЗаказПоставщикуТовары.ХарактеристикаНоменклатуры) ЕСТЬ NULL
		|					ИЛИ ЕСТЬNULL(ПоступлениеТоваровУслугТовары.ХарактеристикаНоменклатуры, ЗаказПоставщикуТовары.ХарактеристикаНоменклатуры) = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.Пустаяссылка)
		|				ТОГДА ХарактеристикиНоменклатуры.Ссылка
		|			ИНАЧЕ ЕСТЬNULL(ПоступлениеТоваровУслугТовары.ХарактеристикаНоменклатуры, ЗаказПоставщикуТовары.ХарактеристикаНоменклатуры)
		|		КОНЕЦ КАК Характеристика
		|	ИЗ
		|		Справочник.Номенклатура КАК Товар
		|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПоступлениеТоваровУслуг.Товары КАК ПоступлениеТоваровУслугТовары
		|			ПО (ПоступлениеТоваровУслугТовары.Номенклатура = Товар.Ссылка)
		|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказПоставщику.Товары КАК ЗаказПоставщикуТовары
		|			ПО (ЗаказПоставщикуТовары.Номенклатура = Товар.Ссылка)
		|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
		|			ПО Товар.Ссылка = ХарактеристикиНоменклатуры.Владелец
		|	ГДЕ
		|		Товар.Ссылка = &Ссылка
		|	
		|	СГРУППИРОВАТЬ ПО
		|		Товар.Ссылка,
		|		ВЫБОР
		|			КОГДА ЕСТЬNULL(ПоступлениеТоваровУслугТовары.ХарактеристикаНоменклатуры, ЗаказПоставщикуТовары.ХарактеристикаНоменклатуры) ЕСТЬ NULL
		|					ИЛИ ЕСТЬNULL(ПоступлениеТоваровУслугТовары.ХарактеристикаНоменклатуры, ЗаказПоставщикуТовары.ХарактеристикаНоменклатуры) = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.Пустаяссылка)
		|				ТОГДА ХарактеристикиНоменклатуры.Ссылка
		|			ИНАЧЕ ЕСТЬNULL(ПоступлениеТоваровУслугТовары.ХарактеристикаНоменклатуры, ЗаказПоставщикуТовары.ХарактеристикаНоменклатуры)
		|		КОНЕЦ) КАК ВложенныйЗапрос
		|ГДЕ
		|	НЕ ВложенныйЗапрос.Характеристика ЕСТЬ NULL
		|	И ВложенныйЗапрос.Характеристика.Вага > 0";
	
	Запрос.УстановитьПараметр("Ссылка", Номенклатура);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий()Тогда 
	   	Характеристика = Выборка.Характеристика;
	Иначе 
		НачатьТранзакцию();
		Характеристика = Справочники.ХарактеристикиНоменклатуры.СоздатьЭлемент();
		Характеристика.Владелец = Номенклатура;
		Характеристика.Вага = Константы.ВагаМішкаПоЗамовчуванню.Получить();
		Характеристика.Наименование = Характеристика.Вага;
		Характеристика.Записать();
		ЗафиксироватьТранзакцию();
	КонецЕсли;
	Возврат Характеристика.Ссылка;
	
КонецФункции
