Перем мСписокВозможныхРеквизитов Экспорт;
Перем мРеквизитыКонтрольУникальности Экспорт;

Перем мЭтоНеНовый;

// Обработчик события элемента ПриКопировании.
//
Процедура ПриКопировании(ОбъектКопирования)

	Если Не ЭтоГруппа Тогда
		ЕдиницаХраненияОстатков = Неопределено;
		ЕдиницаДляОтчетов       = Неопределено;
		ЕдиницаИзмеренияМест    = Неопределено;
		ОсновноеИзображение     = Неопределено;
		НазначениеИспользования = Неопределено;
		НоменклатураГТД     = Неопределено;
	КонецЕсли;
	
КонецПроцедуры // ПриКопировании()

// Обработчик события ПередЗаписью формы.
//
Процедура ПередЗаписью(Отказ)

	Если ЭтоГруппа Тогда 
		Возврат;
	КонецЕсли;	
	
	//Если мЭтоНеНовый = Неопределено Тогда
	
	мЭтоНеНовый = Не ЭтоНовый();

	//КонецЕсли;

	Если ЭтоНовый() Тогда 
		ДатаСозданияЭлемента = ТекущаяДата();
	КонецЕсли;
	
	
	Если Не ОбменДанными.Загрузка И Не ЭтоГруппа Тогда
		
		
	
			
		Если Не Услуга И НЕ ЗначениеЗаполнено(БазоваяЕдиницаИзмерения) Тогда
			#Если Клиент Тогда
			РаботаСДиалогами.СообщитьПользователюНезаполненРеквизит(Ссылка, "базовая единица");
			#КонецЕсли
			Отказ = Истина;
		Иначе
			// Надо проверить владельца единицы хранения остатков.
			Если ЗначениеЗаполнено(ЕдиницаХраненияОстатков)
			   И ЕдиницаХраненияОстатков.Владелец <> Ссылка Тогда
				ТекстСообщения = "У единицы хранения остатков номенклатуры """ + СокрЛП(Ссылка) + """ неверно указан владелец!";
				ОбщегоНазначения.СообщитьОбОшибке(ТекстСообщения, Отказ);
			КонецЕсли;
		КонецЕсли;

		Если НЕ ЗначениеЗаполнено(ЕдиницаДляОтчетов) Тогда
			ЕдиницаДляОтчетов = ЕдиницаХраненияОстатков;
		КонецЕсли;

		// Надо проверить владельца единицы для отчетов.
		Если ЗначениеЗаполнено(ЕдиницаДляОтчетов)
		   И ЕдиницаДляОтчетов.Владелец <> Ссылка Тогда
			ТекстСообщения = "У единицы для отчетов номенклатуры """ + СокрЛП(Ссылка) + """ неверно указан владелец!";
			ОбщегоНазначения.СообщитьОбОшибке(ТекстСообщения, Отказ);
		КонецЕсли;

		Если мЭтоНеНовый Тогда
			СуществуютСсылки = Неопределено;

			Если Не Услуга И Ссылка.ЕдиницаХраненияОстатков <> ЕдиницаХраненияОстатков И ПолныеПрава.Номенклатура_СуществуютСсылки(Ссылка, СуществуютСсылки) Тогда
				ТекстСообщения = "Единица """ + СокрЛП(Ссылка.ЕдиницаХраненияОстатков) + """ является единицей хранения остатков для """ + Наименование + """
				|и уже участвует в товародвижении. 
				|Изменить эту единицу уже нельзя!";
				ОбщегоНазначения.СообщитьОбОшибке(ТекстСообщения, Отказ);
			КонецЕсли;

			Если (Услуга <> Ссылка.Услуга Или Комплект <> Ссылка.Комплект Или Набор <> Ссылка.Набор)
			   И ПолныеПрава.Номенклатура_СуществуютСсылки(Ссылка, СуществуютСсылки) Тогда
				ТекстСообщения = "Номенклатура """ + СокрЛП(Ссылка) + """ участвует в товародвижении.
				|Нельзя изменить тип номенклатуры (Услуга, товар, набор-комплект), если позиция номенклатуры участвует в товародвижении!";
				ОбщегоНазначения.СообщитьОбОшибке(ТекстСообщения, Отказ);
			КонецЕсли;

			Если Не ВестиУчетПоСериям И Ссылка.ВестиУчетПоСериям И ПолныеПрава.Номенклатура_СуществуютСсылкиНаСерииВРегистрахНакопления(Ссылка) Тогда
				ТекстСообщения = "Номенклатура """ + СокрЛП(Ссылка) + """ участвует в товародвижении.
				|признак учета по сериям не может быть изменен!";
				ОбщегоНазначения.СообщитьОбОшибке(ТекстСообщения, Отказ);
			КонецЕсли;
		КонецЕсли;

		Если НЕ ЗначениеЗаполнено(ВидНоменклатуры) Тогда
			#Если Клиент Тогда
			РаботаСДиалогами.СообщитьПользователюНезаполненРеквизит(Ссылка, "вид номенклатуры");
			#КонецЕсли
			Отказ = Истина;
		КонецЕсли;
	ИначеЕсли Не ОбменДанными.Загрузка И ЭтоГруппа Тогда
		ПрошлыйИзмененныйРодительОбъектаДоступа = ?(Не ЭтоНовый() и Не Ссылка.Родитель = Родитель, Ссылка.Родитель, Неопределено);
		НастройкаПравДоступа.ПередЗаписьюНовогоОбъектаСПравамиДоступаПользователей(ЭтотОбъект, Отказ, Родитель);
	КонецЕсли;
	
КонецПроцедуры // ПередЗаписью()


Процедура ПриЗаписи(Отказ)
	
	Если НЕ ПометкаУдаления Тогда 
		Отказ = НЕ Общий.КонтрольУникальностиПоРеквизиту(ЭтотОбъект, "Артикул");
	КонецЕсли;
	
	
	Если Не ОбменДанными.Загрузка И Не ЭтоГруппа И НЕ Отказ Тогда
		
		ТЗ = ОбменАндроид.ПолучитьТорговыхЗаданнойНоменклатуры(Ссылка);
		//Если Не Удаление И Родитель <> мСтарыйРодитель Тогда 
		//	
		//	// Перевіряэм якщо новий родитель не входить в вигрузку, то Удаление = Истина
		//	Для Каждого ТорговийАгент Из мСписокТорговыхДляВыгрузки Цикл
		//		Если ТЗ.Найти(ТорговийАгент) = Неопределено Тогда 
		//			ОбменАндроид.ЗарегистрироватьОбъектОбменАндроидДляПродавца(Ссылка, ТорговийАгент, Ложь, Ложь, Истина);
		//		КонецЕсли;			
		//	КонецЦикла;			
		//КонецЕсли;	
		
		Для Каждого ТорговийАгент ИЗ ТЗ Цикл
			ОбменАндроид.ЗарегистрироватьОбъектОбменАндроидДляПродавца(Ссылка, ТорговийАгент, Ложь);
		КонецЦикла;
		
		Если Не мЭтоНеНовый Тогда 
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	ГруппыЧатаУчасники.Ссылка КАК Ссылка,
			|	ГруппыЧатаУчасники.Пользователь
			|ИЗ
			|	Справочник.ГруппыЧата.Учасники КАК ГруппыЧатаУчасники
			|ГДЕ
			|	ГруппыЧатаУчасники.Ссылка.действиеНоваяНоменклатура
			|ИТОГИ ПО
			|	Ссылка";
			
			РезультатЗапроса = Запрос.Выполнить();
			
			ВыборкаСсылка = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Организация = Справочники.Организации.НайтиПоКоду("000000001");
			
			Пока ВыборкаСсылка.Следующий() Цикл
				
				МенеджерЗаписи 					= РегистрыСведений.Чат1С.СоздатьМенеджерЗаписи();	
				МенеджерЗаписи.Уид_Сообщения 	= Новый УникальныйИдентификатор;
				МенеджерЗаписи.Організація 		= Организация;
				МенеджерЗаписи.Відправник  		= Справочники.Пользователи.ПустаяСсылка();
				
				//Если НовоеСообщение.ПолучательГруппа Тогда 
				МенеджерЗаписи.Одержувач  = ВыборкаСсылка.Ссылка;
				//Иначе
				//	МенеджерЗаписи.Одержувач   = Справочники.Пользователи.ПолучитьСсылку(НовоеСообщение.УИД_Получатель);
				//КонецЕсли;
				
				МенеджерЗаписи.Повідомлення 	= "Створена нова номенклатура:" + Символы.ПС + ВРег("(" + Артикул + ") " + Ссылка);
				МенеджерЗаписи.Период       	= ТекущаяДата();
				МенеджерЗаписи.ДатаНаСервере 	= ТекущаяДата();
				МенеджерЗаписи.Записать();
				
				ВыборкаДетальныеЗаписи = ВыборкаСсылка.Выбрать();
				
				Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
					РегНепрочитані = РегистрыСведений.НепрочитаніПовідомлення.СоздатьМенеджерЗаписи();			
					РегНепрочитані.Одержувач = ВыборкаДетальныеЗаписи.Пользователь;
					РегНепрочитані.Відправник =  ВыборкаСсылка.Ссылка;
					РегНепрочитані.ГруппаЧата  = ВыборкаСсылка.Ссылка;
					РегНепрочитані.Кол = 1;
					РегНепрочитані.Период = ТекущаяДата();
					РегНепрочитані.Записать(); 		
				КонецЦикла;
			КонецЦикла;		
		КонецЕсли;
		
	КонецЕсли;
	
	
КонецПроцедуры

