#Область Програмный_Интерфейс  

Функция СтрокаJSON(ОбъектJSON)Экспорт
	
	ПараметрыЗаписи = Новый ПараметрыЗаписиJSON(, Символы.Таб);
	
	Запись = Новый ЗаписьJSON;
	Запись.УстановитьСтроку(ПараметрыЗаписи);
	ЗаписатьJSON(Запись, ОбъектJSON);
	
	Возврат Запись.Закрыть();
	
КонецФункции 

Функция ОбъектJSON(СтрокаJSON)Экспорт
	
	Чтение = Новый ЧтениеJSON;
	Чтение.УстановитьСтроку(СтрокаJSON);
	ОбъектJSON = ПрочитатьJSON(Чтение);
	Чтение.Закрыть();
	
	Возврат ОбъектJSON;	
	
КонецФункции

Функция ОтветJSON(Объект, КодСостояния = 200)Экспорт
	
	Ответ = Новый HTTPСервисОтвет(КодСостояния);
	Ответ.УстановитьТелоИзСтроки(СтрокаJSON(Объект), КодировкаТекста.UTF8, ИспользованиеByteOrderMark.НеИспользовать);
	Ответ.Заголовки.Вставить("Content-Type", ТипКонтентаJSON());
	
	Возврат Ответ;	
	
КонецФункции 

Функция ПростойУспешныйОтвет()Экспорт  
	
	Результат = Новый Структура;
	Результат.Вставить("Result", "Ok");
	
	Возврат ОтветJSON(Результат);
	
КонецФункции

Функция ОтветОбОшибке(ИнформацияОбОшибке)Экспорт
	
	ЗаписьЖурналаРегистрации("НТТРСервисы.Ошибка", УровеньЖурналаРегистрации.Ошибка,,,
		ПодробноеПредставлениеОшибки(ИнформацияОбОшибке));
		
	Результат = Новый Структура;
	Результат.Вставить("Result", "Error");
	Результат.Вставить("ErrorText", КраткоеПредставлениеОшибки(ИнформацияОбОшибке));

	Возврат ОтветJSON(Результат, 500);	
	
КонецФункции	

Процедура ЗаписьЛогированияЗапросов(ИмяМетода, Запрос, Ответ)Экспорт

	Лог = РегистрыСведений.ВходящийНТТРЗапрос.СоздатьМенеджерЗаписи();
	Лог.ИмяМетода    = ИмяМетода;
	ТелоЗапроса  = Запрос.ПолучитьТелоКакСтроку();
		
	Попытка
		ТелоЗапроса = СтрокаJSON(ОбъектJSON(ТелоЗапроса));	
	Исключение
	КонецПопытки;
	
	Лог.ИсточникПривлечения = Справочники.НастройкиViber.НайтиПоРеквизиту("Метод", "Send"); 
	Лог.ТелоЗапроса  = ТелоЗапроса;	
	Лог.КодСостояния = Ответ.КодСостояния;
	Лог.Дата         = ТекущаяДатаСеанса();
	
	Лог.Записать();
	

	
КонецПроцедуры

Процедура ЗаписьЛогированияЗапросовВторойМетод(ИмяМетода, Запрос, Ответ)Экспорт
	
	Лог = РегистрыСведений.ВходящийНТТРЗапрос.СоздатьМенеджерЗаписи();
	Лог.ИмяМетода    = ИмяМетода;
	ТелоЗапроса  = Запрос.ПолучитьТелоКакСтроку();
		
	Попытка
		ТелоЗапроса = СтрокаJSON(ОбъектJSON(ТелоЗапроса));	
	Исключение
	КонецПопытки;
	
	Лог.ИсточникПривлечения = Справочники.НастройкиViber.НайтиПоРеквизиту("Метод", "SendSecond"); 
	Лог.ТелоЗапроса  = ТелоЗапроса;	
	Лог.КодСостояния = Ответ.КодСостояния;
	Лог.Дата         = ТекущаяДатаСеанса();
	
	Лог.Записать();

	
КонецПроцедуры


#КонецОбласти




#Область Служебные_Процедуры_И_Функции 

Функция ТипКонтентаJSON()
	
	 Возврат "application/json";
	
КонецФункции	

#КонецОбласти
