
Функция ОтриматиСектор(НазваСектора) Экспорт 
	Если ТипЗнч(НазваСектора)= Тип("СправочникСсылка.Сектори") Тогда 
		Возврат НазваСектора;
	КонецЕсли;
	
	ЗнайдСектор = Справочники.Сектори.НайтиПоКоду(СокрЛП(НазваСектора));
	Если ЗнайдСектор.Пустая() Тогда 
		НовСпр = Справочники.Сектори.СоздатьЭлемент();
		НовСпр.Код =  СокрЛП(НазваСектора);
		НовСпр.Записать();
		ЗнайдСектор = НовСпр.Ссылка;
	КонецЕсли;
	Возврат ЗнайдСектор;
КонецФункции

Процедура РучнаЗмінаСектораНаСкладі(ХарактеристикиНоменклатуры, Сектор)     Экспорт 
	
	з = Новый Запрос;
	з.Текст = "ВЫБРАТЬ
	|	СекториСрезПоследних.Сектор
	|ИЗ
	|	РегистрСведений.Сектори.СрезПоследних КАК СекториСрезПоследних
	|ГДЕ
	|	СекториСрезПоследних.ХарактеристикаНоменклатуры = &ХарактеристикаНоменклатуры";
	з.УстановитьПараметр("ХарактеристикаНоменклатуры", ХарактеристикиНоменклатуры);
	Выборка = з.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда 
		Если Выборка.Сектор = Сектор Тогда 
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	
	
	ДокОб = Документы.РучнаЗмінаСектора.СоздатьДокумент();
	ДокОб.Дата = ТекущаяДата();
	ДокОб.ХарактеристикаНоменклатуры = ХарактеристикиНоменклатуры;
	ДокОб.Сектор = Сектор;
	ДокОб.Записать(РежимЗаписиДокумента.Проведение,РежимПроведенияДокумента.Оперативный);
	
КонецПроцедуры
