
&НаСервере
Процедура ПометкаПриИзмененииНаСервере(КодТовара)
	нз = РегистрыСведений.ОтметкиНаличия.СоздатьНаборЗаписей();
	нз.Отбор.Штрихкод.Установить(КодТовара);
	нз.Прочитать();
	Если нз.Количество() Тогда 
		нз.Очистить();
		нз.Записать();
	Иначе
		з = нз.Добавить();
		з.Штрихкод = КодТовара;
		нз.Записать();
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура ОстаткиПриАктивизацииСтроки(Элемент)
	Если Элементы.Остатки.ТекущийЭлемент <> Неопределено Тогда 
		Если Элементы.Остатки.ТекущийЭлемент.Имя = "Штрихкод" ИЛИ Элементы.Остатки.ТекущийЭлемент.Имя =  "Пометка" Тогда 
			ПометкаПриИзмененииНаСервере(Элементы.Остатки.ТекущиеДанные.Штрихкод);
			Элементы.Остатки.Обновить();
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПриОткрытииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриОткрытииНаСервере()
	нз = РегистрыСведений.ОтметкиНаличия.СоздатьНаборЗаписей();
	нз.Записать();
КонецПроцедуры
