
&НаКлиенте
Процедура ВстановитиНагадування(Команда, СообщатьОДобавленииНапоминания = Истина) Экспорт
	Перем Напоминание;

	Если ТипНапоминания = "Звичайне" Тогда 
		

		ЗаписатьНапоминаниеНаСервере(Напоминание);

		
		Если Розклад =  ПолучитьЗначениеПериода("НеПовторювати") Тогда 
			
			УИД = Новый УникальныйИдентификатор; 
			
			ДанныеУведомления = Новый Структура;;
			ДанныеУведомления.Вставить("Заголовок", "Нагадування!");
			ДанныеУведомления.Вставить("Текст", Нагадування);
			ДанныеУведомления.Вставить("Данные"); 
			
			ДанныеУведомления["Данные"] = Новый Соответствие;
			ДанныеУведомления["Данные"]["Действие"] = "Напоминание";
			ДанныеУведомления["Данные"]["Дата"] = ДатаНагадування;
			ДанныеУведомления["Данные"]["УИД_Уведомления"] = Строка(УИД); 
			ДанныеУведомления["Данные"]["УИД_Напоминание"] = Строка(Напоминание.УникальныйИдентификатор()); 

			Общий.ЗапланироватьУведомление(ДанныеУведомления, Ложь, УИД, ДатаНагадування, Напоминание); 
			
			
			#Если  МобильноеПриложениеКлиент Тогда
				Уведомление = Новый ДоставляемоеУведомление;
				ЗаполнитьЗначенияСвойств(Уведомление, ДанныеУведомления, ,"Данные");
				Уведомление.Данные = Общий.ПолучитьСтрокуИзДанных(ДанныеУведомления["Данные"]);
				
				Уведомление.ДатаПоявленияУниверсальноеВремя = ДатаОтправки(ДатаНагадування);
				ДоставляемыеУведомления.ДобавитьЛокальноеУведомление(Уведомление);
				
				//		#Иначе
				//			Предупреждение("Для вашого пристрою не можливо встановити нагадування");
				//			Возврат;
			#КонецЕсли
		КонецЕсли;
		
		
			
	Иначе
		ЗаписатьНапоминаниеПостпленияТовару()
	КонецЕсли;           
	
	Если ТипНапоминания = "Нагадати про товар" Тогда
		Если КоличествоДоданыхПозицийНапоминаиеОТовраре = 0 Тогда
			СообщатьОДобавленииНапоминания = Ложь;
		КонецЕсли;		
	КонецЕсли;
	
    Если СообщатьОДобавленииНапоминания Тогда
		Предупреждение("Нагадування додано!");
	КонецЕсли;	
	Если Открыта() Тогда
		Закрыть();
	КонецЕсли;	
	
КонецПроцедуры


&НаСервереБезКонтекста
Функция  ДатаОтправки(Дата)
	
	Возврат Дата  + (ТекущаяУниверсальнаяДата() - ТекущаяДата()); 
	
КонецФункции

&НаКлиенте
Процедура РозкладПриИзменении(Элемент)
	ПолучитьИмяЭлемента(Розклад);
	Элементы.ГруппаПеріоди.ТекущаяСтраница = Элементы[ПолучитьИмяЭлемента(Розклад)];
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьИмяЭлемента(Розклад)
	Индекс = Перечисления.Періоди.Индекс(Розклад);
	Возврат Розклад.Метаданные().ЗначенияПеречисления[Индекс].Имя;
КонецФункции

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ДатаНагадуванняПриИзменении(1);
	ТипНапоминания = "Звичайне";
КонецПроцедуры

&НаКлиенте
Процедура ДатаНагадуванняПриИзменении(Элемент)
	Элементы.Декорация1.Заголовок = "Кожен " + ДеньТижня + " о " + Формат(ДатаНагадування,"ДФ=ЧЧ:мм"); 
	Элементы.Декорация2.Заголовок = "Кожен день о " + Формат(ДатаНагадування,"ДФ=ЧЧ:мм"); 
	Элементы.Декорация3.Заголовок = "Кожен " + Формат(ДатаНагадування,"ДФ=д") +" день місяця о " + Формат(ДатаНагадування,"ДФ=ЧЧ:мм");
	Элементы.Декорация4.Заголовок = "Кожен рік " + Формат(ДатаНагадування,"ДФ='d MMMM'; ДЛФ=DD") +" о " + Формат(ДатаНагадування,"ДФ=ЧЧ:мм");
КонецПроцедуры

&НаКлиенте
Процедура ДеньТижняПриИзменении(Элемент)
	
	Элементы.Декорация1.Заголовок = "Кожен " + ДеньТижня + " о " + Формат(ДатаНагадування,"ДФ=ЧЧ:мм"); 

КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ДатаНагадування = ТекущаяДата();
	Розклад = Перечисления.Періоди.НеПовторювати;
	ДеньТижня = Элементы.ДеньТижня.СписокВыбора[ДеньНедели(ТекущаяДата())-1].Значение;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьЗначениеПериода(Переменая)

	Возврат Перечисления.Періоди[Переменая];

КонецФункции

&НаСервере
Функция ЗаписатьНапоминаниеНаСервере(Напоминание)
	
	СписокВыбора = Элементы.ДеньТижня.СписокВыбора;
	
	мОбъект = Справочники.Нагадування.СоздатьЭлемент();
	мОбъект.Нагадування = Нагадування;
	мОбъект.Наименование = "Нагадування!";
	мОбъект.Періодичність = Розклад;
	мОбъект.ДатаНапоминания = ДатаНагадування;
	мОбъект.Активне = Истина;
	
	мОбъект.ЗаказВидео = ЗаказВидео;
	мОбъект.НоменклатураВидео = НоменклатураВидео;
	мОбъект.КонтрагентВидео = КонтрагентВидео;
	
	
	мОбъект.ДеньНедели = СписокВыбора.Индекс(СписокВыбора.НайтиПоЗначению(ДеньТижня)) + 1;
	мОбъект.Записать();
	Напоминание = мОбъект.Ссылка;
КонецФункции

&НаКлиенте
Процедура ТипНапоминанияПриИзменении(Элемент)
	
	Если ТипНапоминания = "Звичайне" Тогда 
		Элементы.ОсновнаяПанель.ТекущаяСтраница = Элементы.Напоминание;
	Иначе
		Элементы.ОсновнаяПанель.ТекущаяСтраница = Элементы.НапоминаниеОТоваре;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьНапоминаниеПостпленияТовару() 

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НагадуванняТовары.Номенклатура КАК Номенклатура
		|ИЗ
		|	Справочник.Нагадування.Товары КАК НагадуванняТовары
		|ГДЕ
		|	НагадуванняТовары.Ссылка.Активне = ИСТИНА
		|	И НагадуванняТовары.Ссылка.НагадатиПроТовар = ИСТИНА
		|	И НагадуванняТовары.Ссылка.Контрагент = &Контрагент";
	
	
	
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	
	
	МассивНоменклатурыПоКоторымУжеЕстьНапоминание = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Номенклатура");;
	
	мОбъект = Справочники.Нагадування.СоздатьЭлемент();

	мОбъект.Наименование = "Нагадати про поступлення товарів на склад";
	мОбъект.Нагадування = "Для " + Контрагент + " потрібні товари"; 
	Для Каждого Элемент Из Товары Цикл 
		Если МассивНоменклатурыПоКоторымУжеЕстьНапоминание.Найти(Элемент.Товар) = Неопределено Тогда
			мОбъект.Нагадування = мОбъект.Нагадування + Символы.ПС + Элемент.Товар.Артикул + " (" +  Элемент.Кількість + " міш.)";
		КонецЕсли;	
	КонецЦикла;
	мОбъект.Періодичність = Перечисления.Періоди.ПоПодії;
	мОбъект.Активне = Истина;
	мОбъект.Контрагент = Контрагент;
	мОбъект.НагадатиПроТовар = Истина;
	мОбъект.ИзЗаказа = ИзЗаказа;
	Для Каждого Элемент Из Товары Цикл 
		Если МассивНоменклатурыПоКоторымУжеЕстьНапоминание.Найти(Элемент.Товар) = Неопределено Тогда
			Строка = мОбъект.Товары.Добавить();
			Строка.Номенклатура = Элемент.Товар;
			Строка.Кількість = Элемент.Кількість; 
		Иначе
			Сообщить("Нагадування по артикулу " + Строка(Элемент.Товар.Артикул) + " для клієнта " + Строка(Контрагент) + " вже існує. Артикул не додано повторно в нагадування");
		КонецЕсли;	
	КонецЦикла;
	
	КоличествоДоданыхПозицийНапоминаиеОТовраре = мОбъект.Товары.Количество();
	
	Если мОбъект.Товары.Количество() > 0 Тогда
		мОбъект.Записать();      
	Иначе	
		//СообщатьОДобавленииНапоминания = Ложь;
		//Предупреждение("Нагадування не додано!");
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	Товары.Добавить().Товар = ВыбранноеЗначение;
КонецПроцедуры
