&НаКлиенте
Процедура ВідображатиАрхівніПриИзменении(Элемент)
	Отбор =  Список.КомпоновщикНастроек.Настройки.Отбор.Элементы[0];
	Отбор.Использование = НЕ ВідображатиАрхівні;
	
	
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
	ПараметрыЗаполнения = Новый Структура;
	ПараметрыЗаполнения.Вставить("ОтображатьКонтрагента", Истина);
	Если Копирование Тогда 
		ПараметрыЗаполнения.Вставить("Контрагент", Элемент.ТекущиеДанные.Контрагент);
	КонецЕсли;
	
	ОткрытьФорму("Обработка.Оплата.Форма", ПараметрыЗаполнения,,,,,Новый ОписаниеОповещения("ОбновитьСписок", ЭтаФорма));
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСписок(Документ, Параметры)Экспорт 
	Элементы.Список.Обновить();	
КонецПроцедуры

&НаКлиенте
Процедура СписокПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры
