Перем мПериод          Экспорт; // Период движений
Перем мТаблицаДвижений Экспорт; // Таблица движений

// Выполняет движения по регистру.
//
// Параметры:
//  Нет.
//
Процедура ВыполнитьДвижения() Экспорт

	ОбщегоНазначения.ВыполнитьДвижениеПоРегистру(ЭтотОбъект);
	
	Если ЗначениеЗаполнено(ЭтотОбъект) И ЗначениеЗаполнено(ЭтотОбъект.Отбор.Регистратор.Значение) И ТипЗнч(ЭтотОбъект.Отбор.Регистратор.Значение) = ТИП("ДокументСсылка.РеализацияТоваровУслуг") И ЗначениеЗаполнено(ЭтотОбъект.Отбор.Регистратор.Значение.Контрагент)  Тогда 
		Если ЭтотОбъект.Отбор.Регистратор.Значение.Контрагент.ДатаПоследнейПокупки < НачалоДня(ЭтотОбъект.Отбор.Регистратор.Значение.Дата) Тогда 
			КонтрОб = ЭтотОбъект.Отбор.Регистратор.Значение.Контрагент.ПолучитьОбъект();	
			КонтрОб.ДатаПоследнейПокупки = ЭтотОбъект.Отбор.Регистратор.Значение.Дата;
			КонтрОб.Записать();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры // ВыполнитьДвижения()

