
#Область ФОРМИРОВАНИЕ_ДАННЫХ_ДЛЯ_ОТПРАВКИ

Функция СформироватьПакетДанных(ИдентификаторКлиента, ПарольВхода) Экспорт
		
	Настройка = Неопределено;
	КолНеФиксироватьЗаписиОбмена = 0;
	Данные = Новый Структура;
	КоличесвтоЗаписейДляОбмена = 0;

	ПолнаяВыгрузка = ОбменАндроид.ПолнаяВыгрузка(ПарольВхода);
	СкладПартнера = ОбменАндроид.ПолучитьСкладПартнера(ПарольВхода);
	ПродавецПартнера = ОбменАндроид.ПолучитьПродавцаПоКодуПартнера(ПарольВхода);
	//ЗаписьЖурналаРегистрации("Обмен АРМ",,,ПродавецПартнера, ИдентификаторКлиента);
	
	Данные.Вставить("Константы",		ДобавитьКонстанты(Настройка,СкладПартнера,ПродавецПартнера));	
	Данные.Вставить("Справочники",		ДобавитьСправочники(Настройка, ПарольВхода, ПолнаяВыгрузка,КоличесвтоЗаписейДляОбмена,СкладПартнера));	
	Данные.Вставить("РегистрСведений",	ДобавитьРегистрыСведений(Настройка,Данные.Справочники,СкладПартнера,КолНеФиксироватьЗаписиОбмена,ПродавецПартнера,ПолнаяВыгрузка));
	Данные.Вставить("РегистрНакопления",ДобавитьРегистрыНакопления(Настройка,КолНеФиксироватьЗаписиОбмена));
	Данные.Вставить("Документы",		ДобавитьДокументы(Настройка,Данные.Справочники,СкладПартнера,ПолнаяВыгрузка,КоличесвтоЗаписейДляОбмена,ПродавецПартнера));	 
	Данные.Вставить("ЭтоПолнаяВыгрузка",ПолнаяВыгрузка);
	
	
	Данные.Вставить("КоличествоЗаписейОбмена",КоличесвтоЗаписейДляОбмена);
	
	Возврат Сериализовать(Данные);
	
КонецФункции

Функция ВивантажитиТовари(ИдентификаторКлиента, ПарольВхода) Экспорт
		
	Настройка = Неопределено;
	КолНеФиксироватьЗаписиОбмена = 0;
	Данные = Новый Структура;
	КоличесвтоЗаписейДляОбмена = 0;

	ПолнаяВыгрузка = Ложь;
	СкладПартнера = ОбменАндроид.ПолучитьСкладПартнера(ПарольВхода);
	ПродавецПартнера = ОбменАндроид.ПолучитьПродавцаПоКодуПартнера(ПарольВхода);	
	
	СтрукрутаСправочников = Новый Структура;
	
	ДобавитьСправочникНоменклатура(СтрукрутаСправочников, Настройка, ПолнаяВыгрузка, ПродавецПартнера,КоличесвтоЗаписейДляОбмена,СкладПартнера);
	ДобавитьСправочникХарактеристики(СтрукрутаСправочников,СкладПартнера,ПродавецПартнера);
	ДобавитьСправочникЕдиницыИзмерения(СтрукрутаСправочников);	
		
	Данные.Вставить("Константы",		ДобавитьКонстанты(Настройка,СкладПартнера,ПродавецПартнера));
	Данные.Вставить("Справочники",		СтрукрутаСправочников);	
	
	
	СтруктураРегистрыСведений = Новый Структура;
	ДобавитьРегистрШтрихкоды(СтруктураРегистрыСведений, СтрукрутаСправочников, КоличесвтоЗаписейДляОбмена);

	Данные.Вставить("РегистрСведений",	СтруктураРегистрыСведений);
	Данные.Вставить("РегистрНакопления",Неопределено);
	Данные.Вставить("Документы",		Неопределено);	 
	Данные.Вставить("ЭтоПолнаяВыгрузка", Ложь);
	Данные.Вставить("КоличествоЗаписейОбмена",КоличесвтоЗаписейДляОбмена);
	
	Возврат Сериализовать(Данные);
	
КонецФункции

Функция ВивантажитиКонтрагентів(ИдентификаторКлиента, ПарольВхода) Экспорт
	
	Настройка = Неопределено;
	КолНеФиксироватьЗаписиОбмена = 0;
	Данные = Новый Структура;
	КоличесвтоЗаписейДляОбмена = 0;

	ПолнаяВыгрузка = Ложь;
	СкладПартнера = ОбменАндроид.ПолучитьСкладПартнера(ПарольВхода);
	ПродавецПартнера = ОбменАндроид.ПолучитьПродавцаПоКодуПартнера(ПарольВхода);       
	
	//ЗаписьЖурналаРегистрации("Обмен АРМ",,,ПродавецПартнера, ИдентификаторКлиента);		
	
	СтрукрутаСправочников = Новый Структура;
	ДобавитьСправочникКонтрагентов(СтрукрутаСправочников, ПродавецПартнера, КоличесвтоЗаписейДляОбмена);
	ДобавитьСправочникиДляКонтрагентов(СтрукрутаСправочников);
	
	Данные.Вставить("Константы",		ДобавитьКонстанты(Настройка,СкладПартнера,ПродавецПартнера));
	Данные.Вставить("Справочники",		СтрукрутаСправочников);	
	Данные.Вставить("РегистрСведений",	Неопределено);
	Данные.Вставить("РегистрНакопления",Неопределено);
	Данные.Вставить("Документы",		Неопределено);	 
	Данные.Вставить("ЭтоПолнаяВыгрузка", Ложь);
	Данные.Вставить("КоличествоЗаписейОбмена",КоличесвтоЗаписейДляОбмена);
	
	Возврат Сериализовать(Данные);
	
КонецФункции

Функция ВивантажитиДокументи(ИдентификаторКлиента, ПарольВхода) Экспорт
		
	Настройка = Неопределено;
	КолНеФиксироватьЗаписиОбмена = 0;
	Данные = Новый Структура;
	КоличесвтоЗаписейДляОбмена = 0;

	ПолнаяВыгрузка = Ложь;
	СкладПартнера = ОбменАндроид.ПолучитьСкладПартнера(ПарольВхода);
	ПродавецПартнера = ОбменАндроид.ПолучитьПродавцаПоКодуПартнера(ПарольВхода);
		
	Данные.Вставить("Константы",		 Неопределено);	
	Данные.Вставить("Справочники",		 Неопределено);	
	Данные.Вставить("РегистрСведений",	 Неопределено);
	Данные.Вставить("РегистрНакопления", Неопределено);
	Данные.Вставить("Документы",		 ДобавитьДокументы(Настройка, Неопределено, СкладПартнера, ПолнаяВыгрузка, КоличесвтоЗаписейДляОбмена, ПродавецПартнера));	 
	Данные.Вставить("ЭтоПолнаяВыгрузка", Ложь);
	Данные.Вставить("КоличествоЗаписейОбмена",КоличесвтоЗаписейДляОбмена);
	
	Возврат Сериализовать(Данные);
	
КонецФункции



Функция ОтриматиЗалишкиХарактеристик(ПарольВхода, Номенклатура) Экспорт
	
	Продавец = ОбменАндроид.ПолучитьПродавцаПоКодуПартнера(ПарольВхода);
	Склад = ОбменАндроид.ПолучитьСкладПартнера(ПарольВхода);
	Если Продавец = Неопределено Тогда 
		Возврат Сериализовать(Новый ТаблицаЗначений);
	КонецЕсли;
	СтруктураПараметров = Десериализовать(Номенклатура);

	Номенклатура = Справочники.Номенклатура.ПолучитьСсылку(СтруктураПараметров.Номенклатура);
		
	
	
	
	з = Новый Запрос;
	з.Текст = "ВЫБРАТЬ
	          |	СУММА(ВЫБОР
	          |			КОГДА &НеВивантажуватиЗалишки
	          |				ТОГДА 0
	          |			ИНАЧЕ ТоварыНаСкладахОстатки.КоличествоОстаток - ЕСТЬNULL(ТоварыВРезервеНаСкладахОстатки.КоличествоОстаток, 0)
	          |		КОНЕЦ) КАК Остаток,
	          |	ТоварыНаСкладахОстатки.ХарактеристикаНоменклатуры
	          |ИЗ
	          |	РегистрНакопления.ТоварыНаСкладах.Остатки(
	          |			,
	          |			Номенклатура = &Номенклатура
	          |				И Склад = &Склад) КАК ТоварыНаСкладахОстатки
	          |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВРезервеНаСкладах.Остатки(
	          |				,
	          |				Номенклатура = &Номенклатура
	          |					И Склад = &Склад) КАК ТоварыВРезервеНаСкладахОстатки
	          |		ПО ТоварыНаСкладахОстатки.Номенклатура = ТоварыВРезервеНаСкладахОстатки.Номенклатура
	          |			И ТоварыНаСкладахОстатки.Склад = ТоварыВРезервеНаСкладахОстатки.Склад
	          |			И ТоварыНаСкладахОстатки.ХарактеристикаНоменклатуры = ТоварыВРезервеНаСкладахОстатки.ХарактеристикаНоменклатуры
	          |
	          |СГРУППИРОВАТЬ ПО
	          |	ТоварыНаСкладахОстатки.ХарактеристикаНоменклатуры";
			  
	з.УстановитьПараметр("НеВивантажуватиЗалишки",Продавец.НеВивантажуватиЗалишкиВАндроїд);		  
	з.УстановитьПараметр("Номенклатура",Номенклатура);
	з.УстановитьПараметр("Склад",Склад);
	ТЗОстатков = з.Выполнить().Выгрузить();
	ТЗОстатков.Колонки.Добавить("УИДХарактеристикаНоменклатуры");
	
	Для Каждого Строка Из ТЗОстатков Цикл
		Если ЗначениеЗаполнено(Строка.ХарактеристикаНоменклатуры) Тогда 
			
			Строка.УИДХарактеристикаНоменклатуры = Строка.ХарактеристикаНоменклатуры.УникальныйИдентификатор();
			
		КонецЕсли;
	КонецЦикла;
	
	ТЗОстатков.Колонки.Удалить("ХарактеристикаНоменклатуры");	
		
		
	
	Возврат Сериализовать(ТЗОстатков);

	
	
КонецФункции

Функция ОновитиЗалишкиТаЦіниНоменклатури(ПарольВхода, Частково = Ложь) Экспорт
	Ответ = Новый Структура;
	Продавец = ОбменАндроид.ПолучитьПродавцаПоКодуПартнера(ПарольВхода);
	Склад = ОбменАндроид.ПолучитьСкладПартнера(ПарольВхода);
	Если Продавец = Неопределено Тогда 
		Возврат Сериализовать(Новый ТаблицаЗначений);
	КонецЕсли;
	
	ТипЦен = Новый  Массив;
	Ответ = Новый Структура;
	ДобавитьСправочникТипыЦен(Ответ, ПарольВхода);
	Для Каждого Элемент из Ответ.ТипыЦенНоменклатуры Цикл 
		 ТипЦен.Добавить(Элемент.Ссылка);
	КонецЦикла;
	Ответ.Вставить("ПоказыватьЦены", Продавец.ВсіЦіни);
	Ответ.Вставить("ПоказыватьЦеныПоставщиков", Продавец.ЦеныПоставщиков);

	Запрос = Новый Запрос;
	//Если Частково Тогда 
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВложенныйЗапрос.Номенклатура,
		|	ВложенныйЗапрос.ХарактеристикаНоменклатуры,
		|	ВложенныйЗапрос.Остаток,
		|	ВложенныйЗапрос.Цена,
		|	ВложенныйЗапрос.ТипЦен,
		|	ВложенныйЗапрос.НаименованиеХарактеристики,
		|	ВложенныйЗапрос.Вага,
		|	ЕСТЬNULL(ЦеныНоменклатурыСрезПоследнихАкция.Цена, 0) КАК ЦенаАкция,
		|	ВложенныйЗапрос.ХарактеристикаНоменклатуры.Целевой КАК Целевой,
		|	ВложенныйЗапрос.Цена КАК ЦенаПослеОкончаниеАкции,
		|	ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0) КАК КонецАкции,
		|	ВложенныйЗапрос.ХарактеристикаНоменклатуры.СсылкаНаYouTube КАК СсылкаНаYouTube,
		|	ВложенныйЗапрос.ХарактеристикаНоменклатуры.Описание КАК Описание,
		|	ПРЕДСТАВЛЕНИЕ(ВложенныйЗапрос.ХарактеристикаНоменклатуры.Бронь) КАК Бронь,
		|	ВложенныйЗапрос.ХарактеристикаНоменклатуры.ПериодБрони КАК ПериодБрони,
		|	ВложенныйЗапрос.ХарактеристикаНоменклатуры.Бронь = &Продавец КАК МояБронь,
		|	ЕСТЬNULL(ВложенныйЗапрос.ХарактеристикаНоменклатуры.Контрагент, ЗНАЧЕНИЕ(справочник.Контрагенты.ПустаяСсылка)) КАК Контрагент
		|ИЗ
		|	(ВЫБРАТЬ
		|		ЕСТЬNULL(ТоварыНаСкладахОстатки.Номенклатура, ЦеныНоменклатурыСрезПоследних.Номенклатура) КАК Номенклатура,
		|		ЕСТЬNULL(ТоварыНаСкладахОстатки.ХарактеристикаНоменклатуры, ЦеныНоменклатурыСрезПоследних.ХарактеристикаНоменклатуры) КАК ХарактеристикаНоменклатуры,
		|		ЕСТЬNULL(ТоварыНаСкладахОстатки.КоличествоОстаток, 0) КАК Остаток,
		|		ЕСТЬNULL(ЦеныНоменклатурыСрезПоследних.Цена, 0) КАК Цена,
		|		ЕСТЬNULL(ЦеныНоменклатурыСрезПоследних.ТипЦен, ЗНАЧЕНИЕ(Справочник.ТипыЦенНоменклатуры.ПустаяСсылка)) КАК ТипЦен,
		|		ЕСТЬNULL(ТоварыНаСкладахОстатки.ХарактеристикаНоменклатуры.Наименование, ЦеныНоменклатурыСрезПоследних.ХарактеристикаНоменклатуры.Наименование) КАК НаименованиеХарактеристики,
		|		ЕСТЬNULL(ТоварыНаСкладахОстатки.ХарактеристикаНоменклатуры.Вага, ЦеныНоменклатурыСрезПоследних.ХарактеристикаНоменклатуры.Вага) КАК Вага
		|	ИЗ
		|		РегистрНакопления.ТоварыНаСкладах.Остатки(&ДатаОкончания, ) КАК ТоварыНаСкладахОстатки
		|			ПОЛНОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(&ДатаОкончания, ТипЦен В (&ТипЦен)) КАК ЦеныНоменклатурыСрезПоследних
		|			ПО ТоварыНаСкладахОстатки.Номенклатура = ЦеныНоменклатурыСрезПоследних.Номенклатура) КАК ВложенныйЗапрос
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(&ДатаОкончания, ТипЦен = &ТипЦенАкция) КАК ЦеныНоменклатурыСрезПоследнихАкция
		|		ПО ВложенныйЗапрос.Номенклатура = ЦеныНоменклатурыСрезПоследнихАкция.Номенклатура";
	//Иначе
	//	Запрос.Текст = 
	//	"ВЫБРАТЬ
	//	|	ТоварыНаСкладахОстатки.Склад,
	//	|	ТоварыНаСкладахОстатки.Номенклатура.Артикул КАК Артикул,
	//	|	ТоварыНаСкладахОстатки.Номенклатура,
	//	|	СУММА(ТоварыНаСкладахОстатки.КоличествоОстаток) КАК КоличествоШт,
	//	|	ТоварыНаСкладахОстатки.ХарактеристикаНоменклатуры
	//	|ПОМЕСТИТЬ ВТТоварыНаСкладах
	//	|ИЗ
	//	|	РегистрНакопления.ТоварыНаСкладах.Остатки(&ДатаНачала, ) КАК ТоварыНаСкладахОстатки
	//	|
	//	|СГРУППИРОВАТЬ ПО
	//	|	ТоварыНаСкладахОстатки.Склад,
	//	|	ТоварыНаСкладахОстатки.Номенклатура.Артикул,
	//	|	ТоварыНаСкладахОстатки.Номенклатура,
	//	|	ТоварыНаСкладахОстатки.ХарактеристикаНоменклатуры
	//	|;
	//	|
	//	|////////////////////////////////////////////////////////////////////////////////
	//	|ВЫБРАТЬ
	//	|	Цены.Номенклатура,
	//	|	МАКСИМУМ(Цены.ЦенаПродажи) КАК ЦенаПродажи,
	//	|	Цены.ТипЦен
	//	|ПОМЕСТИТЬ ВТЦены
	//	|ИЗ
	//	|	(ВЫБРАТЬ
	//	|		ЦеныНоменклатурыСрезПоследних.Номенклатура КАК Номенклатура,
	//	|		ЦеныНоменклатурыСрезПоследних.Цена КАК ЦенаПродажи,
	//	|		ЦеныНоменклатурыСрезПоследних.ТипЦен КАК ТипЦен
	//	|	ИЗ
	//	|		РегистрСведений.ЦеныНоменклатуры.СрезПоследних(&ДатаНачала, ТипЦен = ЗНАЧЕНИЕ(Справочник.ТипыЦенНоменклатуры.ЦенаПродажиВес)) КАК ЦеныНоменклатурыСрезПоследних) КАК Цены
	//	|
	//	|СГРУППИРОВАТЬ ПО
	//	|	Цены.Номенклатура,
	//	|	Цены.ТипЦен
	//	|;
	//	|
	//	|////////////////////////////////////////////////////////////////////////////////
	//	|ВЫБРАТЬ
	//	|	ТовариНаСкладахУВазіОстатки.Номенклатура,
	//	|	ВТТоварыНаСкладах.ХарактеристикаНоменклатуры,
	//	|	ЕСТЬNULL(ВТТоварыНаСкладах.КоличествоШт, 0) КАК Остаток,
	//	|	ЕСТЬNULL(ВТЦены.ЦенаПродажи, 0) КАК Цена,
	//	|	ЕСТЬNULL(ВТЦены.ТипЦен, ЗНАЧЕНИЕ(Справочник.ТипыЦенНоменклатуры.ПустаяСсылка)) КАК ТипЦен
	//	|ИЗ
	//	|	РегистрНакопления.ТовариНаСкладахУВазі.Остатки(
	//	|			&ДатаНачала,
	//	|			Номенклатура.Ссылка В ИЕРАРХИИ
	//	|				(ВЫБРАТЬ
	//	|					ВыгружатьВАндроидПоСкладам.Номенклатура
	//	|				ИЗ
	//	|					РегистрСведений.ВыгружатьВАндроидПоСкладам КАК ВыгружатьВАндроидПоСкладам
	//	|				ГДЕ
	//	|					ВыгружатьВАндроидПоСкладам.ТорговийАгент = &ТорговийАгент)) КАК ТовариНаСкладахУВазіОстатки
	//	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТЦены КАК ВТЦены
	//	|		ПО ТовариНаСкладахУВазіОстатки.Номенклатура = ВТЦены.Номенклатура
	//	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТТоварыНаСкладах КАК ВТТоварыНаСкладах
	//	|		ПО ТовариНаСкладахУВазіОстатки.Склад = ВТТоварыНаСкладах.Склад
	//	|			И ТовариНаСкладахУВазіОстатки.Номенклатура = ВТТоварыНаСкладах.Номенклатура";
	//	
	//КонецЕсли;
	//Запрос.УстановитьПараметр("ТорговийАгент", Продавец);
	Запрос.УстановитьПараметр("ТипЦен", ТипЦен);
	Запрос.УстановитьПараметр("ТипЦенАкция", Справочники.ТипыЦенНоменклатуры.ПродажБезАкций);
	Запрос.УстановитьПараметр("Продавец", Продавец);

	//Запрос.УстановитьПараметр("ДатаНачала", НачалоДня(ТекущаяДата() - 86400 * 5));
	Запрос.УстановитьПараметр("ДатаОкончания", ТекущаяДата() + 1);

	ТЗТоваров = Запрос.Выполнить().Выгрузить();
	ТипУИД = Новый ОписаниеТипов("УникальныйИдентификатор");
	ТЗТоваров.Колонки.Добавить("УИДХарактеристикаНоменклатуры", ТипУИД);
	ТЗТоваров.Колонки.Добавить("УИДНоменклатуры", ТипУИД);
	ТЗТоваров.Колонки.Добавить("УИДТипЦен", ТипУИД);
	ТЗТоваров.Колонки.Добавить("УИДКонтрагент", ТипУИД);
	
	Для Каждого Строка Из ТЗТоваров Цикл
		Если ЗначениеЗаполнено(Строка.Номенклатура) Тогда 
			Строка.УИДХарактеристикаНоменклатуры	= Строка.ХарактеристикаНоменклатуры.УникальныйИдентификатор();
			Строка.УИДНоменклатуры 					= Строка.Номенклатура.УникальныйИдентификатор();	
			Строка.УИДТипЦен 						= Строка.ТипЦен.УникальныйИдентификатор();
			Строка.УИДКонтрагент					= Строка.Контрагент.УникальныйИдентификатор();
		КонецЕсли;
	КонецЦикла;
	
	ТЗТоваров.Колонки.Удалить("ХарактеристикаНоменклатуры");
	ТЗТоваров.Колонки.Удалить("Номенклатура");
	ТЗТоваров.Колонки.Удалить("ТипЦен");
	ТЗТоваров.Колонки.Удалить("Контрагент");

	Ответ.Вставить("ТЗЦены", ТЗТоваров);
	Если Продавец.ЦеныПоставщиков Тогда 
		Ответ.Вставить("ЦеныПоставщиков", ПолучитьЦенныПоставщиков());
	КонецЕсли;

	Возврат Сериализовать(Ответ);

КонецФункции

Функция ПолучитьДанныеНезакрытыхЗаказов(ПарольВхода, Контрагент_уид) Экспорт //intrata_wald_02072021
	
	Продавец = ОбменАндроид.ПолучитьПродавцаПоКодуПартнера(ПарольВхода);
	Если Не ЗначениеЗаполнено(Продавец) Тогда
		Возврат Новый ХранилищеЗначения("по такому паролю входа не найден продавец");
	КонецЕсли;
	
	Контрагент = Справочники.Контрагенты.ПолучитьСсылку(Контрагент_уид.Получить());
	Если Контрагент.ПолучитьОбъект() = Неопределено ИЛИ НЕ ЗначениеЗаполнено(Контрагент) Тогда
		Возврат Новый ХранилищеЗначения("по такому уникальному идентификатору не найден контрагент");
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаказыПокупателейОстатки.ЗаказПокупателя КАК Заказ,
		|	ЗаказыПокупателейОстатки.Номенклатура КАК Номенклатура,
		|	ЗаказыПокупателейОстатки.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		|	ЗаказыПокупателейОстатки.Цена,
		|	ЗаказыПокупателейОстатки.КоличествоОстаток КАК Количество,
		|	ЗаказыПокупателейОстатки.СуммаВзаиморасчетовОстаток КАК Сумма,
		|	ПРЕДСТАВЛЕНИЕ(ЗаказыПокупателейОстатки.ЗаказПокупателя) КАК мЗаказ,
		|	ПРЕДСТАВЛЕНИЕ(ЗаказыПокупателейОстатки.Номенклатура) КАК мНоменклатура,
		|	ПРЕДСТАВЛЕНИЕ(ЗаказыПокупателейОстатки.ХарактеристикаНоменклатуры) КАК мХарактеристика
		|ИЗ
		|	РегистрНакопления.ЗаказыПокупателей.Остатки(
		|			,
		|			ЗаказПокупателя.Контрагент = &Контрагент
		|				И ЗаказПокупателя.ТорговийАгент = &Продавец) КАК ЗаказыПокупателейОстатки
		|ГДЕ
		|	ЗаказыПокупателейОстатки.КоличествоОстаток > 0";
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.УстановитьПараметр("Продавец", Продавец);
	Результат = Запрос.Выполнить().Выгрузить();
	Результат.Колонки.Добавить("Заказ_уид", Новый ОписаниеТипов("УникальныйИдентификатор"));
	Результат.Колонки.Добавить("Номенклатура_уид", Новый ОписаниеТипов("УникальныйИдентификатор"));
	Результат.Колонки.Добавить("Характеристика_уид", Новый ОписаниеТипов("УникальныйИдентификатор"));
	Для Каждого СтрокаРезультат Из Результат Цикл
		СтрокаРезультат.Заказ_уид = СтрокаРезультат.Заказ.УникальныйИдентификатор();
		СтрокаРезультат.Номенклатура_уид = СтрокаРезультат.Номенклатура.УникальныйИдентификатор();
		СтрокаРезультат.Характеристика_уид = СтрокаРезультат.ХарактеристикаНоменклатуры.УникальныйИдентификатор();
		//СтрокаРезультат.Заказ_уид = СтрокаРезультат.Заказ.УникальныйИдентификатор();

	КонецЦикла;
	
	Возврат Новый ХранилищеЗначения(Результат);
	
КонецФункции

Функция ПолучитьДанныеНезакрытыхЗаказов_v1(ПарольВхода, Контрагент_уид) Экспорт //taras
	
	Продавец = ОбменАндроид.ПолучитьПродавцаПоКодуПартнера(ПарольВхода);
	Если Не ЗначениеЗаполнено(Продавец) Тогда
		Возврат Новый ХранилищеЗначения("по такому паролю входа не найден продавец");
	КонецЕсли;
	
	Контрагент = Справочники.Контрагенты.ПолучитьСсылку(Контрагент_уид.Получить());
	Если ПустаяСтрока(Контрагент.ВерсияДанных) Тогда
		Возврат Новый ХранилищеЗначения("по такому уникальному идентификатору не найден контрагент");
	КонецЕсли;
	
	Результат = ПолучитьДанныеДляАктуализацииЗаказовПокупателя(Контрагент);

	Возврат Новый ХранилищеЗначения(Результат);
	
КонецФункции

Функция ПолучитьКурсЕвроНаДату(ПарольВхода, Дата) Экспорт
	
	Возврат Новый ХранилищеЗначения(МодульВалютногоУчета.ПолучитьКурсВалюты(Справочники.Валюты.НайтиПоКоду("978"), Дата.Получить()));
	
КонецФункции

Функция ОновитиКурси(ПарольВхода) Экспорт
	СтруктураКурсов = Новый Структура;
	СтруктураКурсов.Вставить("В978", МодульВалютногоУчета.ПолучитьКурсВалюты(Справочники.Валюты.НайтиПоКоду("978"), ТекущаяДата())); // Эвро
	СтруктураКурсов.Вставить("В840", МодульВалютногоУчета.ПолучитьКурсВалюты(Справочники.Валюты.НайтиПоКоду("840"), ТекущаяДата())); // Доллар
	
	
	ТорговийАгент = ОбменАндроид.ПолучитьПродавцаПоКодуПартнера(ПарольВхода);
	Если Не ТорговийАгент = Неопределено Тогда 
		СтруктураКурсов.Вставить("ПравоМінятиКурсиВалют", ТорговийАгент.ПравоМінятиКурсиВалют);
	КонецЕсли;
	СтруктураКурсов.Вставить("ВідображатиВсіхКлієнтів", ТорговийАгент.ВідображатиВсіхКлієнтів);

		
	Возврат Новый ХранилищеЗначения(СтруктураКурсов); 	
КонецФункции



Функция ПолучитьЦенныПоставщиков() Экспорт 
	ТЗ_Цен = Новый ТаблицаЗначений;
		Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПоступлениеТоваровУслугТовары.Номенклатура КАК Номенклатура,
	|	ПРЕДСТАВЛЕНИЕ(ПоступлениеТоваровУслугТовары.Ссылка.Контрагент) КАК Поставщик,
	|	МАКСИМУМ(ПоступлениеТоваровУслугТовары.ЦенаЗакупкиВес) КАК ЦенаЗакупкиВес
	|ИЗ
	|	Документ.ПоступлениеТоваровУслуг.Товары КАК ПоступлениеТоваровУслугТовары
	|ГДЕ
	|	ПоступлениеТоваровУслугТовары.Ссылка.Проведен
	|
	|СГРУППИРОВАТЬ ПО
	|	ПоступлениеТоваровУслугТовары.Номенклатура,
	|	ПРЕДСТАВЛЕНИЕ(ПоступлениеТоваровУслугТовары.Ссылка.Контрагент)";
	
	РезультатЗапроса = Запрос.Выполнить();
	ТЗ_Цен = РезультатЗапроса.Выгрузить();;
	ТЗ_Цен.Колонки.Добавить("УИДНоменклатуры",  Новый ОписаниеТипов("Строка", ,,,Новый КвалификаторыСтроки(36)));
	
	Для Каждого Элемент Из ТЗ_Цен Цикл 
		Элемент.УИДНоменклатуры =  Элемент.Номенклатура.УникальныйИдентификатор();
	КонецЦикла;
	
	Запрос.Текст = 
	"Выбрать * 
	|ПОМЕСТИТЬ ТЗ 
	|Из 
	|	&ТЗ как ТЗ; 
	|Выбрать 
	|	УИДНоменклатуры, 
	|	Поставщик, 
	|	ЦенаЗакупкиВес   
	|Из 
	|	ТЗ как ТЗ 
	|Итоги 
	|По
	|	УИДНоменклатуры";
	Запрос.УстановитьПараметр("ТЗ", ТЗ_Цен);
	
	Возврат Запрос.Выполнить();	
КонецФункции


#Область ЗАПОЛНЕНИЕ_КОНСТАНТ

Функция ДобавитьКонстанты(Настройка,СкладПартнера,Продавец)Экспорт 
	
	СтрукрутаКонстант = Новый Структура;
	
	СтрукрутаКонстант.Вставить("СкладПартнера",СокрЛП(СкладПартнера));
	
	СтрукрутаКонстант.Вставить("ПродавецПартнера",СокрЛП(Продавец));
	
	СтрукрутаКонстант.Вставить("ПорогЗадолженостиEUR", Константы.ПорогЗадолженостиEUR.Получить());
	
	СтрукрутаКонстант.Вставить("ПравоМінятиКурсиВалют", Продавец.ПравоМінятиКурсиВалют);
	
	СтрукрутаКонстант.Вставить("ТипЦенПродаж", Продавец.ТипЦенПродажи.УникальныйИдентификатор());
	
	СтрукрутаКонстант.Вставить("ВідображатиВсіхКлієнтів", Продавец.ВідображатиВсіхКлієнтів);
	
	//СтрукрутаКонстант.Вставить("Пользователь1с", Продавец.Користувач.УникальныйИдентификатор());

	
	ДобавитьКурсыВалют(СтрукрутаКонстант);
	
	Возврат СтрукрутаКонстант;
	
КонецФункции

Процедура ДобавитьКурсыВалют(Структура)
	EUR = РегистрыСведений.КурсыВалют.ПолучитьПоследнее(ТекущаяДата(), Новый Структура("Валюта", Справочники.Валюты.НайтиПоКоду("978")));
	USD = РегистрыСведений.КурсыВалют.ПолучитьПоследнее(ТекущаяДата(), Новый Структура("Валюта", Справочники.Валюты.НайтиПоКоду("840")));
	Структура.Вставить("КурсUSD", USD.Курс); 
	Структура.Вставить("КурсEUR", EUR.Курс);
КонецПроцедуры

#КонецОбласти

#Область ЗАПОЛНЕНИЕ_СПРАВОЧНИКОВ

Функция ДобавитьСправочники(Настройка, ПарольВхода, ПолнаяВыгрузка,КоличесвтоЗаписейДляОбмена,СкладПартнера) Экспорт 
	
	СтрукрутаСправочников = Новый Структура;
	Продавец = ОбменАндроид.ПолучитьПродавцаПоКодуПартнера(ПарольВхода);
	ДобавитьСправочникНоменклатура(СтрукрутаСправочников, Настройка, ПолнаяВыгрузка, Продавец,КоличесвтоЗаписейДляОбмена,СкладПартнера);
	ДобавитьСправочникХарактеристики(СтрукрутаСправочников,СкладПартнера,Продавец);
	ДобавитьСправочникЕдиницыИзмерения(СтрукрутаСправочников);	
	ДобавитьСправочникТипыЦен(СтрукрутаСправочников,ПарольВхода);
	ДобавитьСправочникКонтрагентов(СтрукрутаСправочников, Продавец, КоличесвтоЗаписейДляОбмена);
	ДобавитьСправочникКатегорииОбъектов(СтрукрутаСправочников); //intrata_wald_08092021
	ДобавитьСправочникМаршруты(СтрукрутаСправочников);
	ДобавитьСправочникСтатусКонтрагента(СтрукрутаСправочников);
	ДобавитьСправочникТорговыйАгент(СтрукрутаСправочников);
	ДобавитьСправочникСтатьиДвиженийДенежныхСредств(СтрукрутаСправочников);
	ДобавитьСправочникБанковскиеСчета(СтрукрутаСправочников);
	ДобавитьСправочникНапоминание(СтрукрутаСправочников, Продавец);
	ДобавитьСправочникКатегорииТТ(СтрукрутаСправочников);
	ДобавитьСправочникСпособыДоставки(СтрукрутаСправочников);
	ДобавитьСправочникКаналиПошуку(СтрукрутаСправочников);

	
	//Если ПолнаяВыгрузка Тогда 
		ДобавитьСправочникГородаОбласти(СтрукрутаСправочников);
	//КонецЕсли;
	
	Возврат СтрукрутаСправочников;
	
КонецФункции

Процедура ДобавитьСправочникНоменклатура(СтрукрутаСправочников, Настройка, ПолнаяВыгрузка, Продавец,КоличесвтоЗаписейДляОбмена,СкладПартнера)
	
	Запрос = Новый Запрос;
			
	Запрос.Текст = "ВЫБРАТЬ
	               |	РегистрацияОбмена.Объект,
	               |	РегистрацияОбмена.Продавец,
	               |	РегистрацияОбмена.ИД,
	               |	РегистрацияОбмена.ВыгружатьФайлы
	               |ПОМЕСТИТЬ РегистрацияОбменаПодготовка
	               |ИЗ
	               |	РегистрСведений.РегистрацияОбмена КАК РегистрацияОбмена
	               |ГДЕ
	               |	РегистрацияОбмена.Продавец = &Продавец
	               |	И РегистрацияОбмена.Объект ССЫЛКА Справочник.Номенклатура
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ ПЕРВЫЕ 500
	               |	НоменклатураТовар.Ссылка КАК Ссылка,
	               |	НоменклатураТовар.Наименование,
	               |	НоменклатураТовар.ЭтоГруппа,
	               |	НоменклатураТовар.Родитель КАК Родитель,
	               |	РегистрацияОбменаПодготовка.ИД,
	               |	ИСТИНА КАК Просмотр,
	               |	ВЫБОР
	               |		КОГДА &НеВивантажуватиЗалишки
	               |			ТОГДА 0
	               |		ИНАЧЕ ТоварыНаСкладахОстатки.КоличествоОстаток
	               |	КОНЕЦ КАК Залишок,
	               |	ЕдиницыИзмерения.Коэффициент КАК ВБлоке,
	               |	ЕдиницыИзмерения.Наименование КАК ПредставлениеЕдиницыСокращенно,
	               |	НоменклатураТовар.Артикул,
	               |	НоменклатураТовар.ДополнительноеОписаниеНоменклатуры КАК ДополнительноеОписаниеНоменклатуры,
	               |	НоменклатураТовар.СсылкаНаYouTube КАК YouTube,
	               |	НоменклатураТовар.ПосиланняНаСайт,
	               |	НоменклатураТовар.ПосиланняНаНаявніЛоти КАК НаявніЛоти,
	               |	НоменклатураТовар.ДатаСозданияЭлемента,
	               |	НоменклатураТовар.ВідображатиВШтуках
	               |ИЗ
	               |	Справочник.Номенклатура КАК НоменклатураТовар
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрацияОбменаПодготовка КАК РегистрацияОбменаПодготовка
	               |		ПО НоменклатураТовар.Ссылка = РегистрацияОбменаПодготовка.Объект
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыНаСкладах.Остатки(, Склад = &Склад) КАК ТоварыНаСкладахОстатки
	               |		ПО НоменклатураТовар.Ссылка = ТоварыНаСкладахОстатки.Номенклатура
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЕдиницыИзмерения КАК ЕдиницыИзмерения
	               |		ПО НоменклатураТовар.Ссылка = ЕдиницыИзмерения.Владелец";

		
	Запрос.УстановитьПараметр("НеВивантажуватиЗалишки",Продавец.НеВивантажуватиЗалишкиВАндроїд);				   
	Запрос.УстановитьПараметр("Продавец",Продавец);


	Запрос.УстановитьПараметр("Склад",СкладПартнера);
	Запрос.УстановитьПараметр("Дата",ТекущаяДата());
	 	
	ТзТовары = Запрос.Выполнить().Выгрузить();
	ТзНоменклатура = ТзТовары.Скопировать();
	ТзНоменклатура.Очистить();	
	
	
	ТЗРодителей = ПолучитьРодителейНоменклатуры(ТзТовары, Новый Массив);
	Пока ЗначениеЗаполнено(ТЗРодителей) Цикл	
		Для Каждого Строка Из ТЗРодителей Цикл
			Если ТзНоменклатура.Найти(Строка.Ссылка,"Ссылка") = Неопределено Тогда 
				НовСтрока = ТзНоменклатура.Вставить(0);
			КонецЕсли;
			ЗаполнитьЗначенияСвойств(НовСтрока,Строка);
		КонецЦикла;
		ТЗРодителей = ПолучитьРодителейНоменклатуры(ТЗРодителей,ТзНоменклатура.ВыгрузитьКолонку("Ссылка"));
	КонецЦикла;
	
	//ТзНоменклатура.Свернуть("Ссылка,Наименование,ЭтоГруппа,Родитель,ИД");
	
	Для Каждого Строка Из ТзТовары Цикл
		НовСтрока = ТзНоменклатура.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтрока,Строка);
		КоличесвтоЗаписейДляОбмена = КоличесвтоЗаписейДляОбмена + 1;
	КонецЦикла;
	
	ТзНоменклатура.Колонки.Добавить("УИДСсылка");
	ТзНоменклатура.Колонки.Добавить("УИДРодитель");
	ТзНоменклатура.Колонки.Добавить("Рекомендация");
	мас = Новый Массив;
	Для Каждого Строка Из ТзНоменклатура Цикл
		Если Не ЗначениеЗаполнено(Строка.Ссылка) Тогда 
			мас.Добавить(Строка);
			Продолжить;
		КонецЕсли;
		
		Строка.УИДСсылка = Строка.Ссылка.УникальныйИдентификатор();
		Строка.УИДРодитель = Строка.Родитель.УникальныйИдентификатор();

		Если НЕ Продавец.Рекомендации.найти(Строка.Ссылка) = Неопределено Тогда 
			Строка.Рекомендация = Истина;
		КонецЕсли;
		
	КонецЦикла;
	Для Каждого Стр Из мас Цикл
		ТзНоменклатура.Удалить(Стр);
	КонецЦикла;

	
	
	СтрукрутаСправочников.Вставить("Номенклатура", ТзНоменклатура);
	
	НомерСообщения = 0;
	
	
	
КонецПроцедуры	

Функция ПолучитьРодителейНоменклатуры(ТзНоменклатура,СписокГрупп)
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	|	Номенклатура.Родитель.Ссылка КАК Ссылка,
	|	Номенклатура.Родитель.Наименование КАК Наименование,
	|	Номенклатура.Родитель.ЭтоГруппа КАК ЭтоГруппа,
	|	Номенклатура.Родитель.Родитель КАК Родитель
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	Номенклатура.Ссылка В(&СписокРодителей)
	|	И НЕ Номенклатура.Родитель.ПометкаУдаления
	|	И НЕ Номенклатура.Родитель.Ссылка В (&СписокГрупп)
	|
	|СГРУППИРОВАТЬ ПО
	|	Номенклатура.Родитель.Ссылка,
	|	Номенклатура.Родитель.Наименование,
	|	Номенклатура.Родитель.ЭтоГруппа,
	|	Номенклатура.Родитель.Родитель";
	
	Запрос.УстановитьПараметр("СписокРодителей",ТзНоменклатура.ВыгрузитьКолонку("Ссылка"));
	Запрос.УстановитьПараметр("СписокГрупп",СписокГрупп);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Процедура ДобавитьСправочникХарактеристики(СтрукрутаСправочников,СкладПартнера,Продавец)
	
	Запрос = Новый Запрос;
	
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТоварыНаСкладахОстатки.ХарактеристикаНоменклатуры.Ссылка КАК Ссылка,
	               |	ТоварыНаСкладахОстатки.ХарактеристикаНоменклатуры.Владелец КАК Владелец,
	               |	ТоварыНаСкладахОстатки.ХарактеристикаНоменклатуры.Наименование КАК Наименование,
	               |	МАКСИМУМ(ВЫБОР
	               |			КОГДА &НеВивантажуватиЗалишки
	               |				ТОГДА 0
	               |			ИНАЧЕ ТоварыНаСкладахОстатки.КоличествоОстаток
	               |		КОНЕЦ) КАК Залишок,
	               |	ТоварыНаСкладахОстатки.ХарактеристикаНоменклатуры.Вага КАК Вага,
	               |	ТоварыНаСкладахОстатки.ХарактеристикаНоменклатуры.СсылкаНаYouTube КАК СсылкаНаYouTube,
	               |	ТоварыНаСкладахОстатки.ХарактеристикаНоменклатуры.Описание КАК Описание,
	               |	ПРЕДСТАВЛЕНИЕ(ТоварыНаСкладахОстатки.ХарактеристикаНоменклатуры.Бронь) КАК Бронь,
	               |	ТоварыНаСкладахОстатки.ХарактеристикаНоменклатуры.ПериодБрони КАК ПериодБрони,
	               |	ТоварыНаСкладахОстатки.ХарактеристикаНоменклатуры.Бронь = &Продавец КАК МояБронь,
	               |	ТоварыНаСкладахОстатки.ХарактеристикаНоменклатуры.Контрагент КАК Контрагент,
	               |	ТоварыНаСкладахОстатки.ХарактеристикаНоменклатуры.ЕстьВидео КАК ЕстьВидео,
	               |	ТоварыНаСкладахОстатки.Период КАК ДатаПриход,
	               |	ТоварыНаСкладахОстатки.ХарактеристикаНоменклатуры.Коментар КАК Коментар,
	               |	ТоварыНаСкладахОстатки.ХарактеристикаНоменклатуры.СекторНаСкладі КАК СекторНаСкладі,
	               |	ТоварыНаСкладахОстатки.ХарактеристикаНоменклатуры.Открыт КАК Открыт,
	               |	ВложенныйЗапрос.ДатаВідео
	               |ИЗ
	               |	(ВЫБРАТЬ
	               |		ТоварыОстатки.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	               |		МАКСИМУМ(ТоварыОстатки.КоличествоОстаток) КАК КоличествоОстаток,
	               |		МАКСИМУМ(ПартииТоваровНаСкладах.Период) КАК Период
	               |	ИЗ
	               |		(ВЫБРАТЬ
	               |			Остатки.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	               |			СУММА(Остатки.КоличествоОстаток) КАК КоличествоОстаток
	               |		ИЗ
	               |			РегистрНакопления.ТоварыНаСкладах.Остатки(
	               |					&ДатаКон,
	               |					Склад = &Склад
	               |						И Номенклатура В (&МассивТоваров)
	               |						И ХарактеристикаНоменклатуры.Владелец = Номенклатура) КАК Остатки
	               |		
	               |		СГРУППИРОВАТЬ ПО
	               |			Остатки.ХарактеристикаНоменклатуры
	               |		
	               |		ОБЪЕДИНИТЬ ВСЕ
	               |		
	               |		ВЫБРАТЬ
	               |			ТоварыНаСкладахОбороты.ХарактеристикаНоменклатуры,
	               |			СУММА(0)
	               |		ИЗ
	               |			РегистрНакопления.ТоварыНаСкладах.Обороты(
	               |					&ДатаНач,
	               |					&ДатаКон,
	               |					Месяц,
	               |					Склад = &Склад
	               |						И Номенклатура В (&МассивТоваров)
	               |						И ХарактеристикаНоменклатуры.Владелец = Номенклатура) КАК ТоварыНаСкладахОбороты
	               |		
	               |		СГРУППИРОВАТЬ ПО
	               |			ТоварыНаСкладахОбороты.ХарактеристикаНоменклатуры) КАК ТоварыОстатки
	               |			ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ПартииТоваровНаСкладах КАК ПартииТоваровНаСкладах
	               |			ПО ТоварыОстатки.ХарактеристикаНоменклатуры = ПартииТоваровНаСкладах.ХарактеристикаНоменклатуры
	               |				И (ПартииТоваровНаСкладах.Регистратор ССЫЛКА Документ.ПоступлениеТоваровУслуг
	               |					ИЛИ ПартииТоваровНаСкладах.Регистратор ССЫЛКА Документ.Перепаковка)
	               |	
	               |	СГРУППИРОВАТЬ ПО
	               |		ТоварыОстатки.ХарактеристикаНоменклатуры) КАК ТоварыНаСкладахОстатки
	               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |			ИзменениеСостоянияМешкаТовары.Номенклатура КАК Номенклатура,
	               |			МИНИМУМ(ИзменениеСостоянияМешкаТовары.Ссылка.Дата) КАК ДатаВідео,
	               |			ИзменениеСостоянияМешкаТовары.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры
	               |		ИЗ
	               |			Документ.ИзменениеСостоянияМешка.Товары КАК ИзменениеСостоянияМешкаТовары
	               |		ГДЕ
	               |			ИзменениеСостоянияМешкаТовары.ЕстьВидео
	               |		
	               |		СГРУППИРОВАТЬ ПО
	               |			ИзменениеСостоянияМешкаТовары.Номенклатура,
	               |			ИзменениеСостоянияМешкаТовары.ХарактеристикаНоменклатуры) КАК ВложенныйЗапрос
	               |		ПО ТоварыНаСкладахОстатки.ХарактеристикаНоменклатуры = ВложенныйЗапрос.ХарактеристикаНоменклатуры
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ТоварыНаСкладахОстатки.ХарактеристикаНоменклатуры.Ссылка,
	               |	ТоварыНаСкладахОстатки.ХарактеристикаНоменклатуры.Владелец,
	               |	ТоварыНаСкладахОстатки.ХарактеристикаНоменклатуры.Наименование,
	               |	ТоварыНаСкладахОстатки.ХарактеристикаНоменклатуры.Вага,
	               |	ТоварыНаСкладахОстатки.ХарактеристикаНоменклатуры.СсылкаНаYouTube,
	               |	ТоварыНаСкладахОстатки.ХарактеристикаНоменклатуры.Описание,
	               |	ТоварыНаСкладахОстатки.ХарактеристикаНоменклатуры.ПериодБрони,
	               |	ТоварыНаСкладахОстатки.ХарактеристикаНоменклатуры.Бронь = &Продавец,
	               |	ТоварыНаСкладахОстатки.ХарактеристикаНоменклатуры.ЕстьВидео,
	               |	ТоварыНаСкладахОстатки.ХарактеристикаНоменклатуры.Контрагент,
	               |	ТоварыНаСкладахОстатки.Период,
	               |	ТоварыНаСкладахОстатки.ХарактеристикаНоменклатуры.Коментар,
	               |	ТоварыНаСкладахОстатки.ХарактеристикаНоменклатуры.СекторНаСкладі,
	               |	ТоварыНаСкладахОстатки.ХарактеристикаНоменклатуры.Открыт,
	               |	ВложенныйЗапрос.ДатаВідео,
	               |	ПРЕДСТАВЛЕНИЕ(ТоварыНаСкладахОстатки.ХарактеристикаНоменклатуры.Бронь)";
	
	
	Запрос.УстановитьПараметр("МассивТоваров", СтрукрутаСправочников.Номенклатура.ВыгрузитьКолонку("Ссылка"));
	Запрос.УстановитьПараметр("Склад", СкладПартнера);
	Запрос.УстановитьПараметр("НеВивантажуватиЗалишки",Продавец.НеВивантажуватиЗалишкиВАндроїд);
	Запрос.УстановитьПараметр("ДатаНач", ТекущаяДата()  - (20 * 24 * 60 * 60));
	Запрос.УстановитьПараметр("ДатаКон", ТекущаяДата());
	Запрос.УстановитьПараметр("Продавец", Продавец);

	ТзХарактеристикиНоменклатуры = Запрос.Выполнить().Выгрузить();
	
	ТзХарактеристикиНоменклатуры.Колонки.Добавить("УИДСсылка");
	ТзХарактеристикиНоменклатуры.Колонки.Добавить("УИДВладелец");
	ТзХарактеристикиНоменклатуры.Колонки.Добавить("УИДКонтрагент");

	мас = Новый Массив;
	Для Каждого Строка Из ТзХарактеристикиНоменклатуры Цикл
		Если Не ЗначениеЗаполнено(Строка.Ссылка) Тогда 
			мас.Добавить(Строка);
			Продолжить;
		КонецЕсли;
		
		Строка.УИДСсылка = Строка.Ссылка.УникальныйИдентификатор();
		Строка.УИДВладелец = Строка.Владелец.УникальныйИдентификатор();
		Строка.УИДКонтрагент = Строка.Контрагент.УникальныйИдентификатор();

	КонецЦикла;
	Для Каждого Стр Из мас Цикл
		ТзХарактеристикиНоменклатуры.Удалить(Стр);
	КонецЦикла;
	
	
	СтрукрутаСправочников.Вставить("ХарактеристикиНоменклатуры", ТзХарактеристикиНоменклатуры);
	
КонецПроцедуры

Процедура ДобавитьСправочникЕдиницыИзмерения(СтрукрутаСправочников)
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	КлассификаторЕдиницИзмерения.Наименование,
	               |	КлассификаторЕдиницИзмерения.Ссылка,
	               |	КлассификаторЕдиницИзмерения.МеждународноеСокращение
	               |ИЗ
	               |	Справочник.КлассификаторЕдиницИзмерения КАК КлассификаторЕдиницИзмерения
	               |ГДЕ
	               |	НЕ КлассификаторЕдиницИзмерения.ПометкаУдаления";
	
	
	ТзКлассификаторЕдиницИзмерения = Запрос.Выполнить().Выгрузить();
	ТзКлассификаторЕдиницИзмерения.Колонки.Добавить("УИДСсылка");
	Для Каждого Строка Из ТзКлассификаторЕдиницИзмерения Цикл
		Строка.УИДСсылка = Строка.Ссылка.УникальныйИдентификатор();
	КонецЦикла;
	
	СтрукрутаСправочников.Вставить("КлассификаторЕдиницИзмерения", ТзКлассификаторЕдиницИзмерения);
	//////////////////////////////
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЕдиницыИзмерения.ЕдиницаПоКлассификатору,
	               |	ЕдиницыИзмерения.Коэффициент,
	               |	ЕдиницыИзмерения.Владелец,
	               |	ЕдиницыИзмерения.Наименование,
	               |	ЕдиницыИзмерения.Ссылка
	               |ИЗ
	               |	Справочник.ЕдиницыИзмерения КАК ЕдиницыИзмерения
	               |ГДЕ
	               |	ЕдиницыИзмерения.Владелец В(&МассивТоваров)
	               |	И НЕ ЕдиницыИзмерения.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("МассивТоваров", СтрукрутаСправочников.Номенклатура.ВыгрузитьКолонку("Ссылка"));
	
	ТзЕдиницыИзмерения = Запрос.Выполнить().Выгрузить();
	
	ТзЕдиницыИзмерения.Колонки.Добавить("УИДСсылка");
	ТзЕдиницыИзмерения.Колонки.Добавить("УИДВладелец");
	ТзЕдиницыИзмерения.Колонки.Добавить("УИДЕдиницаПоКлассификатору");
	Для Каждого Строка Из ТзЕдиницыИзмерения Цикл
		Строка.УИДСсылка = Строка.Ссылка.УникальныйИдентификатор();
		Строка.УИДВладелец = Строка.Владелец.УникальныйИдентификатор();
		Строка.УИДЕдиницаПоКлассификатору = Строка.ЕдиницаПоКлассификатору.УникальныйИдентификатор();
	КонецЦикла;

	
	СтрукрутаСправочников.Вставить("ЕдиницыИзмерения", ТзЕдиницыИзмерения);
	
КонецПроцедуры

Процедура ДобавитьСправочникТипыЦен(СтрукрутаСправочников, ПарольВхода)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТорговыеАгенты.Ссылка КАК Агент,
	               |	ТорговыеАгенты.ПолныеПрава
	               |ПОМЕСТИТЬ Агент
	               |ИЗ
	               |	Справочник.ТорговыеАгенты КАК ТорговыеАгенты
	               |ГДЕ
	               |	ТорговыеАгенты.ПарольДоступаАндроід = &ПарольДоступаАндроід
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТЗ.ТипЦен КАК Ссылка,
	               |	ТЗ.ЭтоЦенаПартнера
	               |ИЗ
	               |	(ВЫБРАТЬ
	               |		ДоговорыКонтрагентов.ТипЦен КАК ТипЦен,
	               |		ЛОЖЬ КАК ЭтоЦенаПартнера
	               |	ИЗ
	               |		Справочник.Контрагенты КАК СкладыКонтрагентов
	               |			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	               |			ПО СкладыКонтрагентов.Ссылка = ДоговорыКонтрагентов.Владелец
	               |				И (ДоговорыКонтрагентов.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКонтрагентов.СПокупателем))
	               |				И (ДоговорыКонтрагентов.ВестиПоДокументамРасчетовСКонтрагентом)
	               |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Агент КАК Агенты
	               |			ПО (СкладыКонтрагентов.ТорговыйАгент = Агенты.Агент
	               |					ИЛИ Агенты.ПолныеПрава
	               |						И СкладыКонтрагентов.ТорговыйАгент <> ЗНАЧЕНИЕ(справочник.ТорговыеАгенты.ПустаяСсылка))
	               |	
	               |	СГРУППИРОВАТЬ ПО
	               |		ДоговорыКонтрагентов.ТипЦен
	               |	
	               |	ОБЪЕДИНИТЬ ВСЕ
	               |	
	               |	ВЫБРАТЬ
	               |		ВыгружатьВАндроидПоТипамЦен.ТипЦен,
	               |		ЛОЖЬ
	               |	ИЗ
	               |		РегистрСведений.ВыгружатьВАндроидПоТипамЦен КАК ВыгружатьВАндроидПоТипамЦен
	               |			ЛЕВОЕ СОЕДИНЕНИЕ Агент КАК Агенты
	               |			ПО ВыгружатьВАндроидПоТипамЦен.ТорговийАгент = Агенты.Агент
	               |	ГДЕ
	               |		ВыгружатьВАндроидПоТипамЦен.Выгружать
	               |		И ВыгружатьВАндроидПоТипамЦен.ТорговийАгент.ПарольДоступаАндроід = &ПарольДоступаАндроід) КАК ТЗ
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ТЗ.ТипЦен,
	               |	ТЗ.ЭтоЦенаПартнера";
	Запрос.УстановитьПараметр("ТЗОВ", Справочники.Организации.НайтиПоКоду("000000001"));
	//Запрос.УстановитьПараметр("БезТЗОВ", Справочники.Организации.ВолиньТабак);
	
	Запрос.УстановитьПараметр("ПарольДоступаАндроід", ПарольВхода);
	ТзТипыЦен = Запрос.Выполнить().Выгрузить();
	
	ТзТипыЦен.Колонки.Добавить("УИДСсылка");
	ТзТипыЦен.Колонки.Добавить("Наименование");
	мас = Новый Массив;
	Для Каждого Строка Из ТзТипыЦен Цикл
		
		Если Не ЗначениеЗаполнено(Строка.Ссылка) Тогда 
			мас.Добавить(Строка);
			Продолжить;
		КонецЕсли;
		
		Строка.УИДСсылка = Строка.Ссылка.УникальныйИдентификатор();
		Строка.Наименование = СокрЛП(Строка.Ссылка);
		
	КонецЦикла;
	Для Каждого Стр Из мас Цикл
		ТзТипыЦен.Удалить(Стр);
	КонецЦикла;
	
	
	СтрукрутаСправочников.Вставить("ТипыЦенНоменклатуры", ТзТипыЦен);
	
КонецПроцедуры

Процедура ДобавитьСправочникГородаОбласти(СтрукрутаСправочников, Города = Неопределено, Области = Неопределено)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Области.Ссылка,
	               |	Области.Наименование
	               |ИЗ
	               |	Справочник.Области КАК Области
	               |ГДЕ
	               |	(&БезОтбора
	               |			ИЛИ Области.Ссылка В (&Ссылка))";
	
	Запрос.УстановитьПараметр("БезОтбора", Области = Неопределено);
	Запрос.УстановитьПараметр("Ссылка", Области);
	ТЗОбласти = Запрос.Выполнить().Выгрузить();		
	ТЗОбласти.Колонки.Добавить("УИДСсылка");
	Для Каждого Строка Из ТЗОбласти Цикл		
		Строка.УИДСсылка = Строка.Ссылка.УникальныйИдентификатор();		
	КонецЦикла;
	
	
	СтрукрутаСправочников.Вставить("Области", ТЗОбласти);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Города.Ссылка,
	               |	Города.Наименование,
	               |	Города.Владелец
	               |ИЗ
	               |	Справочник.Города КАК Города
	               |ГДЕ
	               |	(&БезОтбора
	               |			ИЛИ Города.Ссылка В (&Ссылка))";
	Запрос.УстановитьПараметр("БезОтбора", Города = Неопределено);
	Запрос.УстановитьПараметр("Ссылка", Города);
	ТЗГорода = Запрос.Выполнить().Выгрузить();		
	ТЗГорода.Колонки.Добавить("УИДСсылка");
	ТЗГорода.Колонки.Добавить("УИДВладелец");
	Для Каждого Строка Из ТЗГорода Цикл		
		Строка.УИДСсылка = Строка.Ссылка.УникальныйИдентификатор();	
		Строка.УИДВладелец = Строка.Владелец.УникальныйИдентификатор();	
	КонецЦикла;
	
	СтрукрутаСправочников.Вставить("Города", ТЗГорода);


КонецПроцедуры

Процедура ДобавитьСправочникКатегорииОбъектов(СтрукрутаСправочников) //intrata_wald_08092021
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	КатегорииОбъектов.Ссылка,
	               |	КатегорииОбъектов.Наименование
	               |ИЗ
	               |	Справочник.КатегорииОбъектов КАК КатегорииОбъектов
	               |ГДЕ
	               |	НЕ КатегорииОбъектов.ПометкаУдаления";
	ТЗКатегорииОбъектов = Запрос.Выполнить().Выгрузить();		
	ТЗКатегорииОбъектов.Колонки.Добавить("УИДСсылка");
	Для Каждого Строка Из ТЗКатегорииОбъектов Цикл		
		Строка.УИДСсылка = Строка.Ссылка.УникальныйИдентификатор();		
	КонецЦикла;
	
	СтрукрутаСправочников.Вставить("КатегорииОбъектов", ТЗКатегорииОбъектов);

КонецПроцедуры

Процедура ДобавитьСправочникКонтрагентов(СтрукрутаСправочников, ТорговийАгент, КоличесвтоЗаписейДляОбмена) 
	Запрос = Новый Запрос;
	
				Запрос.Текст = "ВЫБРАТЬ
				               |	СкладыКонтрагентов.Ссылка КАК Владелец,
				               |	РегистрацияОбмена.ИД,
				               |	СкладыКонтрагентов.ТорговыйАгент = &ТорговийАгент КАК Власний
				               |ПОМЕСТИТЬ СкладиТоргового
				               |ИЗ
				               |	РегистрСведений.РегистрацияОбмена КАК РегистрацияОбмена
				               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК СкладыКонтрагентов
				               |		ПО РегистрацияОбмена.Объект = СкладыКонтрагентов.Ссылка
				               |			И (РегистрацияОбмена.Продавец = &ТорговийАгент)
				               |ГДЕ
				               |	НЕ СкладыКонтрагентов.ПометкаУдаления
				               |	И СкладыКонтрагентов.Ссылка В ИЕРАРХИИ
				               |			(ВЫБРАТЬ
				               |				ВыгружатьВАндроидКонтрагентов.Контрагент
				               |			ИЗ
				               |				РегистрСведений.ВыгружатьВАндроидКонтрагентов КАК ВыгружатьВАндроидКонтрагентов
				               |			ГДЕ
				               |				ВыгружатьВАндроидКонтрагентов.ТорговийАгент = &ТорговийАгент
				               |				И ВыгружатьВАндроидКонтрагентов.Выгружать)
				               |	И НЕ СкладыКонтрагентов.ЭтоГруппа
				               |
				               |ИНДЕКСИРОВАТЬ ПО
				               |	СкладыКонтрагентов.Ссылка,
				               |	Владелец
				               |;
				               |
				               |////////////////////////////////////////////////////////////////////////////////
				               |ВЫБРАТЬ ПЕРВЫЕ 500
				               |	ЕСТЬNULL(СкладиТоргового.Владелец.ОсновнойДоговорКонтрагента.ТипЦен, ЗНАЧЕНИЕ(справочник.ТипыценНоменклатуры.ПустаяСсылка)) КАК ТипЦен,
				               |	ДАТАВРЕМЯ(1, 1, 1) КАК СтрокЛіцензії,
				               |	ЕСТЬNULL(СкладиТоргового.Владелец.ОсновнойДоговорКонтрагента.ТипЦен, ЗНАЧЕНИЕ(справочник.ТипыценНоменклатуры.ПустаяСсылка)) КАК ТипЦенТЗОВ,
				               |	СкладиТоргового.Владелец КАК Контрагент,
				               |	СкладиТоргового.ИД,
				               |	ВЫРАЗИТЬ(СкладиТоргового.Владелец.НомерТелефона КАК СТРОКА(512)) КАК НомерТелефона,
				               |	СкладиТоргового.Владелец.Город КАК Город,
				               |	СкладиТоргового.Владелец.Область КАК Область,
				               |	СкладиТоргового.Владелец.НомерВідділенняНП КАК НомерВідділенняНП,
				               |	СкладиТоргового.Власний,
				               |	СкладиТоргового.Владелец.СтатусКонтрагента КАК СтатусКонтрагента,
				               |	СкладиТоргового.Владелец.ОперативныйСтатусКонтрагента КАК ОперативныйСтатусКонтрагента,
				               |	СкладиТоргового.Владелец.ТорговыйАгент КАК ТорговыйАгент,
				               |	СкладиТоргового.Владелец.КоличествоДнейОтПоследнейПокупки КАК КоличествоДнейОтПоследнейПокупки,
				               |	СкладиТоргового.Владелец.ДатаПоследнейПокупки КАК ДатаПоследнейПокупки,
				               |	СкладиТоргового.Владелец.Маршрут КАК Маршрут,
				               |	СкладиТоргового.Владелец.ДатаСоздания КАК ДатаСоздания,
				               |	СкладиТоргового.Владелец.КодАсортимета.Порядок КАК КодАсортимета,
				               |	СкладиТоргового.Владелец.НаименованиеТТ КАК НаименованиеТТ,
				               |	ВЫРАЗИТЬ(СкладиТоргового.Владелец.СсылкаНаСайт КАК СТРОКА(512)) КАК СсылкаНаСайт,
				               |	СкладиТоргового.Владелец.Геолокация КАК Геолокация,
				               |	СкладиТоргового.Владелец.ОбъмЗаМесяц КАК ОбъмЗаМесяц,
				               |	СкладиТоргового.Владелец.Улица КАК Улица,
				               |	СкладиТоргового.Владелец.Дом КАК Дом,
				               |	СкладиТоргового.Владелец.ДатаОновлення КАК ДатаОновлення,
				               |	СкладиТоргового.Владелец.ДополнительныеНомераТелефонов.(
				               |		Номер КАК Номер,
				               |		ВидМесенджера.Порядок КАК ВидМесенджера
				               |	) КАК ТелефоныТЗ,
				               |	СкладиТоргового.Владелец.КатегорияТТ КАК КатегорияТТ,
				               |	СкладиТоргового.Владелец.СпособДоставки КАК СпособДоставки,
				               |	СкладиТоргового.Владелец.КаналПошуку КАК КаналПошуку,
				               |	СкладиТоргового.Владелец.Маршруты.(
				               |		Маршрут КАК МаршрутСсылка
				               |	) КАК Маршруты,
				               |	СкладиТоргового.Владелец.БанковскиеСчетаДляОплаты.(
				               |		БанковскийСчет КАК БанковскийСчетСсылка
				               |	) КАК БанковскиеСчетаДляОплаты,
				               |	СкладиТоргового.Владелец.Асортимент.(
				               |		Артикул КАК Артикул,
				               |		ИСТИНА КАК РучнаяЗапись
				               |	) КАК Асортимент,
				               |	СкладиТоргового.Владелец.АсортиментПрезентацій.(
				               |		Артикул КАК Артикул,
				               |		ИСТИНА КАК РучнаяЗапись
				               |	) КАК АсортиментПрезентацій,
				               |	СкладиТоргового.Владелец.СоцМережі.(
				               |		Коментар КАК Коментар,
				               |		Посилання КАК Посилання,
				               |		Мережа КАК Мережа
				               |	) КАК СоцМережі
				               |ИЗ
				               |	СкладиТоргового КАК СкладиТоргового
				               |;
				               |
				               |////////////////////////////////////////////////////////////////////////////////
				               |ВЫБРАТЬ
				               |	СкладыКонтрагентов.Ссылка КАК Контрагент,
				               |	РегистрацияОбмена.ИД
				               |ИЗ
				               |	РегистрСведений.РегистрацияОбмена КАК РегистрацияОбмена
				               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК СкладыКонтрагентов
				               |		ПО РегистрацияОбмена.Объект = СкладыКонтрагентов.Ссылка
				               |			И (РегистрацияОбмена.Продавец = &ТорговийАгент)
				               |ГДЕ
				               |	(НЕ СкладыКонтрагентов.Ссылка В ИЕРАРХИИ
				               |					(ВЫБРАТЬ
				               |						ВыгружатьВАндроидКонтрагентов.Контрагент
				               |					ИЗ
				               |						РегистрСведений.ВыгружатьВАндроидКонтрагентов КАК ВыгружатьВАндроидКонтрагентов
				               |					ГДЕ
				               |						ВыгружатьВАндроидКонтрагентов.ТорговийАгент = &ТорговийАгент
				               |						И ВыгружатьВАндроидКонтрагентов.Выгружать)
				               |			ИЛИ СкладыКонтрагентов.ПометкаУдаления)
				               |	И НЕ СкладыКонтрагентов.ЭтоГруппа";
	
	Запрос.УстановитьПараметр("ТорговийАгент", ТорговийАгент);
	
	Результат =  Запрос.ВыполнитьПакет();
	
	ТзКонтрагентов =Результат[1].Выгрузить();
	
	ТзКонтрагентов.Колонки.Добавить("УИДСсылка");
	ТзКонтрагентов.Колонки.Добавить("УИДТипЦен");
	ТзКонтрагентов.Колонки.Добавить("Наименование");
	ТзКонтрагентов.Колонки.Добавить("Борг");
	ТзКонтрагентов.Колонки.Добавить("ПросроченийБорг");
	ТзКонтрагентов.Колонки.Добавить("БоргТзОВ");
	ТзКонтрагентов.Колонки.Добавить("ПросроченийБоргТзОВ");
	ТзКонтрагентов.Колонки.Добавить("УИДГород");
	ТзКонтрагентов.Колонки.Добавить("УИДОбласть");
	ТзКонтрагентов.Колонки.Добавить("УИДСтатусКонтрагента");
	ТзКонтрагентов.Колонки.Добавить("УИДОперативныйСтатусКонтрагента");
	ТзКонтрагентов.Колонки.Добавить("УИДТорговыйАгент");	
	ТзКонтрагентов.Колонки.Добавить("УИДМаршрут");
	ТзКонтрагентов.Колонки.Добавить("УИДКатегорияТТ");
	ТзКонтрагентов.Колонки.Добавить("УИДСпособДоставки");
	ТзКонтрагентов.Колонки.Добавить("УИДКаналПошуку");

	//ТзКонтрагентов.Колонки.Добавить("ДопТелефоны");
	ЗаповнитиБоргиКонтрагентів(ТзКонтрагентов);
	
	ТЗ_Асортимент = АсортиментКонтрагентов(ТзКонтрагентов.ВыгрузитьКолонку("Контрагент"));
	
	ТЗ_АсортиментПрезентацій = АсортиментПрезентаційКонтрагентов(ТзКонтрагентов.ВыгрузитьКолонку("Контрагент"));
	
	
	Для Каждого Строка Из ТзКонтрагентов Цикл
		
		Строка.УИДСсылка = Строка.Контрагент.УникальныйИдентификатор();
		Попытка
			Строка.УИДТипЦен = Строка.ТипЦен.УникальныйИдентификатор();
		Исключение			
		КонецПопытки;
		Строка.УИДГород = Строка.Город.УникальныйИдентификатор();
		Строка.УИДОбласть = Строка.Область.УникальныйИдентификатор();
		Строка.УИДСтатусКонтрагента = Строка.СтатусКонтрагента.УникальныйИдентификатор();
		Строка.УИДОперативныйСтатусКонтрагента = Строка.ОперативныйСтатусКонтрагента.УникальныйИдентификатор();
		Строка.УИДТорговыйАгент = Строка.ТорговыйАгент.УникальныйИдентификатор();
		Строка.УИДМаршрут = Строка.Маршрут.УникальныйИдентификатор();
		Строка.УИДКатегорияТТ = Строка.КатегорияТТ.УникальныйИдентификатор();
		Строка.УИДСпособДоставки = Строка.СпособДоставки.УникальныйИдентификатор();
		Строка.УИДКаналПошуку = Строка.КаналПошуку.УникальныйИдентификатор();

		
		Строка.Наименование = СокрЛП(Строка.Контрагент);
		ДопТелефноны = Строка.Контрагент.ДополнительныеНомераТелефонов;
		Для Каждого Элемент Из ДопТелефноны Цикл
			Строка.НомерТелефона = СтрЗаменить(Строка.НомерТелефона, Элемент.Номер, "")  + Символы.ПС + Элемент.Номер;      
		КонецЦикла;
		Строка.НомерТелефона = СокрЛП(СтрЗаменить(Строка.НомерТелефона, Символы.ПС + Символы.ПС, Символы.ПС));  
		
		Маршрути = Строка.Маршруты;
		Маршрути.Колонки.Добавить("УИД_Маршрут");
		Для Каждого Элемент Из Маршрути Цикл
			Элемент.УИД_Маршрут = Элемент.МаршрутСсылка.УникальныйИдентификатор();
		КонецЦикла;
		Маршрути.Колонки.Удалить("МаршрутСсылка");
		
		
		БанковскиеСчетаДляОплаты = Строка.БанковскиеСчетаДляОплаты;
		БанковскиеСчетаДляОплаты.Колонки.Добавить("УИДБанковскийСчет");
		Для Каждого Элемент Из БанковскиеСчетаДляОплаты Цикл
			Элемент.УИДБанковскийСчет = Элемент.БанковскийСчетСсылка.УникальныйИдентификатор();
		КонецЦикла;
		БанковскиеСчетаДляОплаты.Колонки.Удалить("БанковскийСчетСсылка");
		

		Отбор = Новый Структура("Контрагент", Строка.Контрагент);
		Для Каждого Элемент Из ТЗ_Асортимент.НайтиСтроки(Отбор) Цикл 
			аСтрока = Строка.Асортимент.Добавить();
			аСтрока.Артикул = Элемент.Асортимент;
			аСтрока.РучнаяЗапись = ложь;
		КонецЦикла;
		
		Отбор = Новый Структура("Контрагент", Строка.Контрагент);
		Для Каждого Элемент Из ТЗ_АсортиментПрезентацій.НайтиСтроки(Отбор) Цикл 
			аСтрока = Строка.АсортиментПрезентацій.Добавить();
			аСтрока.Артикул = Элемент.Асортимент;
			аСтрока.РучнаяЗапись = ложь;
		КонецЦикла; 		
		
		КоличесвтоЗаписейДляОбмена = КоличесвтоЗаписейДляОбмена + 1;
	КонецЦикла;
	
	СтрукрутаСправочников.Вставить("Контрагенты", ТзКонтрагентов);
	
	ТЗ_УдалитьКонтрагентов = Результат[2].Выгрузить();
	ТЗ_УдалитьКонтрагентов.Колонки.Добавить("Ссылка");
	
	Для Каждого Строка Из ТЗ_УдалитьКонтрагентов Цикл
		Строка.Ссылка = Строка.Контрагент.УникальныйИдентификатор();
	КонецЦикла;
	
	ТЗ_УдалитьКонтрагентов.Колонки.Удалить("Контрагент");
	КоличесвтоЗаписейДляОбмена = КоличесвтоЗаписейДляОбмена  + ТЗ_УдалитьКонтрагентов.Количество();
	СтрукрутаСправочников.Вставить("Удалить_Контрагенты", ТЗ_УдалитьКонтрагентов);

	
	///////// СкладыКонтрагентов
	
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	РегистрацияОбмена.Объект КАК Объект
	               |ПОМЕСТИТЬ РегистрацияТоргового
	               |ИЗ
	               |	РегистрСведений.РегистрацияОбмена КАК РегистрацияОбмена
	               |ГДЕ
	               |	РегистрацияОбмена.Продавец = &ТорговийАгент
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	Объект
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	СкладыКонтрагентов.Ссылка КАК Контрагент
	               |ПОМЕСТИТЬ СкладиКонтрагентів
	               |ИЗ
	               |	Справочник.Контрагенты КАК СкладыКонтрагентов
	               |ГДЕ
	               |	СкладыКонтрагентов.ТорговыйАгент = &ТорговийАгент
	               |	И НЕ СкладыКонтрагентов.ПометкаУдаления
	               |	И СкладыКонтрагентов.Ссылка В ИЕРАРХИИ
	               |			(ВЫБРАТЬ
	               |				ВыгружатьВАндроидКонтрагентов.Контрагент
	               |			ИЗ
	               |				РегистрСведений.ВыгружатьВАндроидКонтрагентов КАК ВыгружатьВАндроидКонтрагентов
	               |			ГДЕ
	               |				ВыгружатьВАндроидКонтрагентов.ТорговийАгент = &ТорговийАгент
	               |				И ВыгружатьВАндроидКонтрагентов.Выгружать)
	               |	И НЕ СкладыКонтрагентов.ЭтоГруппа
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	СкладыКонтрагентов.Ссылка
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	Контрагент
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ДАТАВРЕМЯ(1, 1, 1) КАК СтрокДіїЛіцензії,
	               |	СкладиКонтрагентів.Контрагент КАК Контрагент,
	               |	ЗНАЧЕНИЕ(Справочник.склады.ПустаяСсылка) КАК Склад
	               |ИЗ
	               |	РегистрацияТоргового КАК РегистрацияТоргового
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ СкладиКонтрагентів КАК СкладиКонтрагентів
	               |		ПО РегистрацияТоргового.Объект = СкладиКонтрагентів.Контрагент
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	СкладиКонтрагентів.Контрагент";
	
	
	Запрос.УстановитьПараметр("ТорговийАгент", ТорговийАгент);
	
	ТзКонтрагентов = Запрос.Выполнить().Выгрузить();
	
	ТзКонтрагентов.Колонки.Добавить("УИДСсылка");
	ТзКонтрагентов.Колонки.Добавить("УИДКонтрагент");
	ТзКонтрагентов.Колонки.Добавить("Наименование");
	
	Для Каждого Строка Из ТзКонтрагентов Цикл
		Строка.УИДСсылка = Строка.Склад.УникальныйИдентификатор();
		Строка.УИДКонтрагент = Строка.Контрагент.УникальныйИдентификатор();
		Строка.Наименование = "";
		КоличесвтоЗаписейДляОбмена = КоличесвтоЗаписейДляОбмена + 1;
	КонецЦикла;
	
	СтрукрутаСправочников.Вставить("СкладыКонтрагентов", ТзКонтрагентов);
	
КонецПроцедуры

Процедура ДобавитьСправочникНапоминание(СтрукрутаСправочников, ТорговийАгент)
	
	Массив = Новый Массив;
 	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Напоминания.Ссылка,
		|	Напоминания.ТорговийАгент,
		|	Напоминания.Наименование,
		|	Напоминания.ОписаниеНапоминания,
		|	Напоминания.Периодичность.Порядок Как Периодичность,
		|	Напоминания.Активно,
		|	Напоминания.НапоминаниеОТоваре,
		|	Напоминания.Контрагент,
		|	РегистрацияОбмена.ИД,
		|	Напоминания.ДеньНедели,
		|	Напоминания.ДатаНапоминания
		|ИЗ
		|	Справочник.Напоминания КАК Напоминания
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.РегистрацияОбмена КАК РегистрацияОбмена
		|		ПО Напоминания.Ссылка = РегистрацияОбмена.Объект
		|			И Напоминания.ТорговийАгент = РегистрацияОбмена.Продавец
		|			И (Напоминания.ТорговийАгент = &ТорговийАгент)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НапоминанияТовары.Номенклатура,
		|	НапоминанияТовары.Выполнено,
		|	РегистрацияОбмена.ИД
		|ИЗ
		|	Справочник.Напоминания.Товары КАК НапоминанияТовары
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.РегистрацияОбмена КАК РегистрацияОбмена
		|		ПО НапоминанияТовары.Ссылка = РегистрацияОбмена.Объект
		|			И НапоминанияТовары.Ссылка.ТорговийАгент = РегистрацияОбмена.Продавец
		|			И (РегистрацияОбмена.Продавец = &ТорговийАгент)";
	Запрос.УстановитьПараметр("ТорговийАгент", ТорговийАгент);
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	Напоминания = РезультатЗапроса.Получить(0).Выбрать();
	Артикулы = РезультатЗапроса.Получить(1).Выгрузить();
	
	Пока Напоминания.Следующий() Цикл 
		
		Элемент = Новый Структура;
		Элемент.Вставить("УИДСсылка", Напоминания.Ссылка.УникальныйИдентификатор());
		Элемент.Вставить("Нагадування", Напоминания.ОписаниеНапоминания);
		Элемент.Вставить("Періодичність", Напоминания.Периодичность);
		Элемент.Вставить("Активне", Напоминания.Активно);
		Элемент.Вставить("НагадатиПроТовар", Напоминания.НапоминаниеОТоваре);
		Если  Напоминания.НапоминаниеОТоваре Тогда 
			
			Элемент.Вставить("Контрагент", Напоминания.Контрагент.УникальныйИдентификатор());
			Элемент.Вставить("Товары", Новый Массив);
			Для Каждого Артикул Из Артикулы.НайтиСтроки(Новый Структура("ИД", Напоминания.ИД)) Цикл
				СтруктураАртикул = Новый Структура();
				СтруктураАртикул.Вставить("Номенклатура", Артикул.Номенклатура.УникальныйИдентификатор());
				СтруктураАртикул.Вставить("Виконано", Артикул.Виконано);
				Элемент.Товары.Добавить(СтруктураАртикул);
			КонецЦикла;
			
		Иначе
			
			Элемент.Вставить("ДеньНедели", Напоминания.ДеньНедели);
			Элемент.Вставить("ДатаНапоминания", Напоминания.ДатаНапоминания);

		КонецЕсли;
		Массив.Добавить(Элемент);
	КонецЦикла;
	
	
	СтрукрутаСправочников.Вставить("Нагадування", Массив);
	
КонецПроцедуры

Процедура ДобавитьСправочникСтатусКонтрагента(СтрукрутаСправочников, Объекты = Неопределено)

	Массив = Новый Массив;
	Выборка = Справочники.СтатусыКонтрагентов.Выбрать();
	Отобрать =  Объекты <> Неопределено;

	
	Пока Выборка.Следующий() Цикл 
		Если Отобрать И Объекты.Найти(Выборка.Ссылка) = Неопределено Тогда 
			Продолжить;
		КонецЕсли;

		ЭлементСправочника = Новый Структура;
		ЭлементСправочника.Вставить("УИДСсылка", 		Выборка.Ссылка.УникальныйИдентификатор());
		ЭлементСправочника.Вставить("Наименование",	 	Выборка.Наименование);
		ЭлементСправочника.Вставить("ПометкаУдаления", 	Выборка.ПометкаУдаления);
		ЭлементСправочника.Вставить("ЭтоГруппа", 		Выборка.ЭтоГруппа);
		Массив.Добавить(ЭлементСправочника);
	КонецЦикла;
	
	
	
	СтрукрутаСправочников.Вставить("СтатусыКонтрагентов", Массив);
КонецПроцедуры


Процедура ДобавитьСправочникТорговыйАгент(СтрукрутаСправочников, Объекты = Неопределено)

	Массив = Новый Массив;
	Выборка = Справочники.ТорговыеАгенты.Выбрать();
	Отобрать =  Объекты <> Неопределено;

	
	Пока Выборка.Следующий() Цикл 
		Если Отобрать И Объекты.Найти(Выборка.Ссылка) = Неопределено Тогда 
			Продолжить;
		КонецЕсли;

		ЭлементСправочника = Новый Структура;
		ЭлементСправочника.Вставить("УИДСсылка", 		Выборка.Ссылка.УникальныйИдентификатор());
		ЭлементСправочника.Вставить("Наименование",	 	Выборка.Наименование);
		ЭлементСправочника.Вставить("ПометкаУдаления", 	Выборка.ПометкаУдаления);
		ЭлементСправочника.Вставить("ЭтоГруппа", 		Выборка.ЭтоГруппа);
		Массив.Добавить(ЭлементСправочника);
	КонецЦикла;
	
	
	
	СтрукрутаСправочников.Вставить("ТорговыеАгенты", Массив);
КонецПроцедуры


Процедура ДобавитьСправочникСтатьиДвиженийДенежныхСредств(СтрукрутаСправочников, Объекты = Неопределено)

	Массив = Новый Массив;
	Выборка = Справочники.СтатьиДвиженияДенежныхСредств.Выбрать();
	Отобрать =  Объекты <> Неопределено;

	
	Пока Выборка.Следующий() Цикл 
		Если Отобрать И Объекты.Найти(Выборка.Ссылка) = Неопределено Тогда 
			Продолжить;
		КонецЕсли;

		ЭлементСправочника = Новый Структура;
		ЭлементСправочника.Вставить("УИДСсылка", 		Выборка.Ссылка.УникальныйИдентификатор());
		ЭлементСправочника.Вставить("УИДРодитель", 		Выборка.Ссылка.Родитель.УникальныйИдентификатор());		
		ЭлементСправочника.Вставить("Наименование",	 	Выборка.Наименование);
		ЭлементСправочника.Вставить("ПометкаУдаления", 	Выборка.ПометкаУдаления);
		ЭлементСправочника.Вставить("ЭтоГруппа", 		Выборка.ЭтоГруппа);
		Массив.Добавить(ЭлементСправочника);
	КонецЦикла;
	
	
	
	СтрукрутаСправочников.Вставить("СтатьиДвиженияДенежныхСредств", Массив);
КонецПроцедуры


Процедура ДобавитьСправочникБанковскиеСчета(СтрукрутаСправочников, Объекты = Неопределено)
	
	Массив = Новый Массив;
	Выборка = Справочники.БанковскиеСчета.Выбрать();
	Отобрать =  Истина;
	
	Если Объекты = Неопределено Тогда
		ТЗ = СтрукрутаСправочников.Контрагенты;		
		мКонтрагенты = ТЗ.Скопировать();
		мКонтрагенты.Свернуть("Контрагент");
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	БанковскиеСчета.Ссылка КАК БанковскиеСчета
		|ИЗ
		|	Справочник.БанковскиеСчета КАК БанковскиеСчета
		|ГДЕ
		|	БанковскиеСчета.Владелец В(&Владелец)";
		
		Запрос.УстановитьПараметр("Владелец", Справочники.Организации.НайтиПоКоду("000000001"));
		
		ТЗРезультатЗапроса = Запрос.Выполнить().Выгрузить();		
		
		Объекты = ТЗРезультатЗапроса.ВыгрузитьКолонку("БанковскиеСчета");
	КонецЕсли;	

	
	Пока Выборка.Следующий() Цикл 
		Если Отобрать И Объекты.Найти(Выборка.Ссылка) = Неопределено Тогда 
			Продолжить;
		КонецЕсли;

		ЭлементСправочника = Новый Структура;
		ЭлементСправочника.Вставить("УИДСсылка", 		Выборка.Ссылка.УникальныйИдентификатор());
		ЭлементСправочника.Вставить("Наименование",	 	Выборка.Наименование);
		ЭлементСправочника.Вставить("ПометкаУдаления", 	Выборка.ПометкаУдаления);
		ЭлементСправочника.Вставить("ЭтоГруппа", 		Выборка.ЭтоГруппа);
		//ЭлементСправочника.Вставить("УИДВладелец", 		Выборка.Владелец.УникальныйИдентификатор());
		//ЭлементСправочника.Вставить("НомерСчета", 		Выборка.НомерСчета);
		Попытка
			ЭлементСправочника.Вставить("Опис", 							Выборка.Опис);
			ЭлементСправочника.Вставить("НеВідображатиВДодатку", 			Выборка.НеВідображатиВДодатку);
		Исключение
		КонецПопытки;
		
		Массив.Добавить(ЭлементСправочника);
	КонецЦикла;
	
	СтрукрутаСправочников.Вставить("БанковскиеСчета", Массив);
КонецПроцедуры	



Процедура ДобавитьСправочникМаршруты(СтрукрутаСправочников, Объекты = Неопределено)

	Массив = Новый Массив;
	Выборка = Справочники.Маршруты.Выбрать();
	
	Отобрать =  Объекты <> Неопределено;
	
	Пока Выборка.Следующий() Цикл 
		
		Если Отобрать И Объекты.Найти(Выборка.Ссылка) = Неопределено Тогда 
			Продолжить;
		КонецЕсли;
		
			ЭлементСправочника = Новый Структура;
			ЭлементСправочника.Вставить("УИДСсылка", 		Выборка.Ссылка.УникальныйИдентификатор());
			ЭлементСправочника.Вставить("Наименование",	 	Выборка.Наименование);
			ЭлементСправочника.Вставить("ПометкаУдаления", 	Выборка.ПометкаУдаления);
			ЭлементСправочника.Вставить("ЭтоГруппа", 		Выборка.ЭтоГруппа);
			Массив.Добавить(ЭлементСправочника);
		
		
	КонецЦикла;
	
	
	
	СтрукрутаСправочников.Вставить("Маршруты", Массив);
КонецПроцедуры

Процедура ДобавитьСправочникКатегорииТТ(СтрукрутаСправочников, Объекты = Неопределено)

	Массив = Новый Массив;
	Выборка = Справочники.КатегорииТТ.Выбрать();
	
	Отобрать =  Объекты <> Неопределено;
	
	Пока Выборка.Следующий() Цикл 
		
		Если Отобрать И Объекты.Найти(Выборка.Ссылка) = Неопределено Тогда 
			Продолжить;
		КонецЕсли;
		
			ЭлементСправочника = Новый Структура;
			ЭлементСправочника.Вставить("УИДСсылка", 		Выборка.Ссылка.УникальныйИдентификатор());
			ЭлементСправочника.Вставить("Наименование",	 	Выборка.Наименование);
			ЭлементСправочника.Вставить("ПометкаУдаления", 	Выборка.ПометкаУдаления);
			ЭлементСправочника.Вставить("ЭтоГруппа", 		Выборка.ЭтоГруппа);
			Массив.Добавить(ЭлементСправочника);
		
		
	КонецЦикла;
	
	
	
	СтрукрутаСправочников.Вставить("КатегорииТТ", Массив);
КонецПроцедуры

Процедура ДобавитьСправочникСпособыДоставки(СтрукрутаСправочников, Объекты = Неопределено)

	Массив = Новый Массив;
	Выборка = Справочники.СпособыДоставки.Выбрать();
	
	Отобрать =  Объекты <> Неопределено;
	
	Пока Выборка.Следующий() Цикл 
		
		Если Отобрать И Объекты.Найти(Выборка.Ссылка) = Неопределено Тогда 
			Продолжить;
		КонецЕсли;
		
			ЭлементСправочника = Новый Структура;
			ЭлементСправочника.Вставить("УИДСсылка", 		Выборка.Ссылка.УникальныйИдентификатор());
			ЭлементСправочника.Вставить("Наименование",	 	Выборка.Наименование);
			ЭлементСправочника.Вставить("ПометкаУдаления", 	Выборка.ПометкаУдаления);
			ЭлементСправочника.Вставить("ЭтоГруппа", 		Выборка.ЭтоГруппа);
			Массив.Добавить(ЭлементСправочника);
		
		
	КонецЦикла;
	
	
	
	СтрукрутаСправочников.Вставить("СпособыДоставки", Массив);
КонецПроцедуры

Процедура ДобавитьСправочникКаналиПошуку(СтрукрутаСправочников, Объекты = Неопределено)

	Массив = Новый Массив;
	Выборка = Справочники.КаналиПошуку.Выбрать();
	
	Отобрать =  Объекты <> Неопределено;
	
	Пока Выборка.Следующий() Цикл 
		
		Если Отобрать И Объекты.Найти(Выборка.Ссылка) = Неопределено Тогда 
			Продолжить;
		КонецЕсли;
		
			ЭлементСправочника = Новый Структура;
			ЭлементСправочника.Вставить("УИДСсылка", 		Выборка.Ссылка.УникальныйИдентификатор());
			ЭлементСправочника.Вставить("Наименование",	 	Выборка.Наименование);
			ЭлементСправочника.Вставить("ПометкаУдаления", 	Выборка.ПометкаУдаления);
			ЭлементСправочника.Вставить("ЭтоГруппа", 		Выборка.ЭтоГруппа);
			Массив.Добавить(ЭлементСправочника);
		
		
	КонецЦикла;
	
	
	
	СтрукрутаСправочников.Вставить("КаналиПошуку", Массив);
КонецПроцедуры


Функция ДобавитьСправочникиДляКонтрагентов(СтрукрутаСправочников)
	
	ТЗ = СтрукрутаСправочников.Контрагенты;
	
	мГорода = ТЗ.Скопировать();
	мГорода.Свернуть("Город");
	
	мОбласти = ТЗ.Скопировать();
	мОбласти.Свернуть("Область");
	
	мСтатус = ТЗ.Скопировать();
	мСтатус.Свернуть("СтатусКонтрагента");
	
	мТорговыйАгент = ТЗ.Скопировать();
	мТорговыйАгент.Свернуть("ТорговыйАгент");
	
	//++
	мСтатусОперативный = ТЗ.Скопировать();
	мСтатусОперативный.Свернуть("ОперативныйСтатусКонтрагента");
	
	Для Каждого стрЭлемента Из мСтатусОперативный Цикл
		НоваяСтрока = мСтатус.Добавить();
		НоваяСтрока.СтатусКонтрагента = стрЭлемента.ОперативныйСтатусКонтрагента;		
	КонецЦикла;	
	мСтатус.Свернуть("СтатусКонтрагента");
	//++
	
	//++
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КонтрагентыБанковскиеСчетаДляОплаты.БанковскийСчет КАК БанковскийСчет
		|ИЗ
		|	Справочник.Контрагенты.БанковскиеСчетаДляОплаты КАК КонтрагентыБанковскиеСчетаДляОплаты
		|ГДЕ
		|	КонтрагентыБанковскиеСчетаДляОплаты.Ссылка В(&Ссылка)";
	
	Запрос.УстановитьПараметр("Ссылка", ТЗ.ВыгрузитьКолонку("Контрагент"));
	
	мБанковскийСчет = Запрос.Выполнить().Выгрузить();
	мБанковскийСчет.Свернуть("БанковскийСчет");
	//++
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	КонтрагентыМаршруты.Маршрут
	                      |ИЗ
	                      |	Справочник.Контрагенты.Маршруты КАК КонтрагентыМаршруты
	                      |
	                      |ОБЪЕДИНИТЬ ВСЕ
	                      |
	                      |ВЫБРАТЬ
	                      |	Контрагенты.Маршрут
	                      |ИЗ
	                      |	Справочник.Контрагенты КАК Контрагенты
	                      |ГДЕ
	                      |	Контрагенты.Ссылка В(&Ссылка)");
	Запрос.УстановитьПараметр("Ссылка", ТЗ.ВыгрузитьКолонку("Контрагент"));

	мМаршрут = Запрос.Выполнить().Выгрузить();
	мМаршрут.Свернуть("Маршрут");
	
	мКатегорииТТ = ТЗ.Скопировать();
	мКатегорииТТ.Свернуть("КатегорияТТ");

	
	мСпособыДоставки = ТЗ.Скопировать();
	мСпособыДоставки.Свернуть("СпособДоставки");

	мКаналиПошуку = ТЗ.Скопировать();
	мКаналиПошуку.Свернуть("КаналПошуку");

	
	
	ДобавитьСправочникГородаОбласти(СтрукрутаСправочников, мГорода.ВыгрузитьКолонку("Город"), мОбласти.ВыгрузитьКолонку("Область"));
	ДобавитьСправочникМаршруты(СтрукрутаСправочников, мМаршрут.ВыгрузитьКолонку("Маршрут"));
	ДобавитьСправочникСтатусКонтрагента(СтрукрутаСправочников, мСтатус.ВыгрузитьКолонку("СтатусКонтрагента"));
	ДобавитьСправочникКатегорииТТ(СтрукрутаСправочников, мКатегорииТТ.ВыгрузитьКолонку("КатегорияТТ"));
	ДобавитьСправочникСпособыДоставки(СтрукрутаСправочников, мСпособыДоставки.ВыгрузитьКолонку("СпособДоставки"));
	ДобавитьСправочникТорговыйАгент(СтрукрутаСправочников, мТорговыйАгент.ВыгрузитьКолонку("ТорговыйАгент"));
	ДобавитьСправочникБанковскиеСчета(СтрукрутаСправочников, мБанковскийСчет.ВыгрузитьКолонку("БанковскийСчет"));
	ДобавитьСправочникКаналиПошуку(СтрукрутаСправочников, мКаналиПошуку.ВыгрузитьКолонку("КаналПошуку"));	
	
КонецФункции




Процедура ДобавитьХранилищеДополнительнойИнформации(СтрукрутаСправочников,Продавец)
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	РегистрацияОбмена.Объект КАК Номенклатура
	               |ИЗ
	               |	РегистрСведений.РегистрацияОбмена КАК РегистрацияОбмена
	               |ГДЕ
	               |	РегистрацияОбмена.ВыгружатьФайлы
	               |	И РегистрацияОбмена.Объект В (&Объект)
	               |	И РегистрацияОбмена.Продавец = &Продавец";
	Запрос.УстановитьПараметр("Объект",СтрукрутаСправочников.Номенклатура.ВыгрузитьКолонку("Ссылка"));
	Запрос.УстановитьПараметр("Продавец",Продавец);
	МассивНоменклатуры = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Номенклатура");
	
	Запрос.Текст = "ВЫБРАТЬ
	|	ХранилищеДополнительнойИнформации.Ссылка КАК Ссылка,
	|	ХранилищеДополнительнойИнформации.Объект.Наименование КАК Наименование,
	|	ВЫРАЗИТЬ(ХранилищеДополнительнойИнформации.Объект КАК Справочник.Номенклатура) КАК Номенклатура,
	|	ХранилищеДополнительнойИнформации.Характеристика,
	|	ХранилищеДополнительнойИнформации.Хранилище
	|ИЗ
	|	Справочник.ХранилищеДополнительнойИнформации КАК ХранилищеДополнительнойИнформации
	|ГДЕ
	|	НЕ ХранилищеДополнительнойИнформации.ПометкаУдаления
	|	И ХранилищеДополнительнойИнформации.Объект В (&МассивГрупп)";
	
	Запрос.УстановитьПараметр("МассивГрупп", МассивНоменклатуры);
	
	ТЗ = Запрос.Выполнить().Выгрузить();
	
	СтрукрутаСправочников.Вставить("ХранилищеДополнительнойИнформации", ТЗ);
	
КонецПроцедуры	

Процедура ОтриматиБорг(Контрагент, Борг, ПросроченийБорг, боргТзОВ, ПросроченийБоргТзОВ)
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОстатки.Организация КАК Організація,
		|	ВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОстатки.Контрагент,
		|	СУММА(ВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОстатки.СуммаВзаиморасчетовОстаток) КАК Борг,
		|	ВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОстатки.ДокументРасчетовСКонтрагентом.Ссылка,
		|	ВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОстатки.ДокументРасчетовСКонтрагентом.Дата
		|ПОМЕСТИТЬ боргТзОВ
		|ИЗ
		|	РегистрНакопления.ВзаиморасчетыСКонтрагентамиПоДокументамРасчетов.Остатки(
		|			&НаДату,
		|			Контрагент = &ВідбірКонтрагент
		|				И Организация = &ТзОВ) КАК ВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОстатки
		|
		|СГРУППИРОВАТЬ ПО
		|	ВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОстатки.Контрагент,
		|	ВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОстатки.Организация,
		|	ВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОстатки.ДоговорКонтрагента,
		|	ВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОстатки.ДокументРасчетовСКонтрагентом.Ссылка,
		|	ВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОстатки.ДокументРасчетовСКонтрагентом.Дата
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	боргТзОВ.Контрагент,
		|	боргТзОВ.Борг,
		|	боргТзОВ.ДокументРасчетовСКонтрагентомДата
		|ПОМЕСТИТЬ просрочТзОВ
		|ИЗ
		|	боргТзОВ КАК боргТзОВ
		|ГДЕ
		|	боргТзОВ.ДокументРасчетовСКонтрагентомДата < &ПрДата
		|
		|СГРУППИРОВАТЬ ПО
		|	боргТзОВ.Контрагент,
		|	боргТзОВ.Борг,
		|	боргТзОВ.ДокументРасчетовСКонтрагентомДата
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СУММА(0) КАК ПросроченийБорг,
		|	боргТзОВ.Контрагент КАК Контрагент,
		|	СУММА(боргТзОВ.Борг) КАК Борг
		|ПОМЕСТИТЬ БоргиДоГрупуванняТзОВ
		|ИЗ
		|	боргТзОВ КАК боргТзОВ
		|
		|СГРУППИРОВАТЬ ПО
		|	боргТзОВ.Контрагент
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	просрочТзОВ.Борг,
		|	просрочТзОВ.Контрагент,
		|	СУММА(0)
		|ИЗ
		|	просрочТзОВ КАК просрочТзОВ
		|
		|СГРУППИРОВАТЬ ПО
		|	просрочТзОВ.Контрагент,
		|	просрочТзОВ.Борг
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОстатки.Организация КАК Організація,
		|	ВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОстатки.Контрагент,
		|	СУММА(ВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОстатки.СуммаВзаиморасчетовОстаток) КАК Борг,
		|	ВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОстатки.ДокументРасчетовСКонтрагентом.Ссылка,
		|	ВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОстатки.ДокументРасчетовСКонтрагентом.Дата
		|ПОМЕСТИТЬ боргБезТзОВ
		|ИЗ
		|	РегистрНакопления.ВзаиморасчетыСКонтрагентамиПоДокументамРасчетов.Остатки(
		|			&НаДату,
		|			Контрагент = &ВідбірКонтрагент
		|				И Организация = &БезТзОВ) КАК ВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОстатки
		|
		|СГРУППИРОВАТЬ ПО
		|	ВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОстатки.Контрагент,
		|	ВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОстатки.Организация,
		|	ВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОстатки.ДоговорКонтрагента,
		|	ВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОстатки.ДокументРасчетовСКонтрагентом.Ссылка,
		|	ВзаиморасчетыСКонтрагентамиПоДокументамРасчетовОстатки.ДокументРасчетовСКонтрагентом.Дата
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	боргБезТзОВ.Контрагент,
		|	боргБезТзОВ.Борг,
		|	боргБезТзОВ.ДокументРасчетовСКонтрагентомДата
		|ПОМЕСТИТЬ просрочБезТзОВ
		|ИЗ
		|	боргБезТзОВ КАК боргБезТзОВ
		|ГДЕ
		|	боргБезТзОВ.ДокументРасчетовСКонтрагентомДата < &ПрДата
		|
		|СГРУППИРОВАТЬ ПО
		|	боргБезТзОВ.Контрагент,
		|	боргБезТзОВ.Борг,
		|	боргБезТзОВ.ДокументРасчетовСКонтрагентомДата
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СУММА(0) КАК ПросроченийБорг,
		|	боргБезТзОВ.Контрагент КАК Контрагент,
		|	СУММА(боргБезТзОВ.Борг) КАК Борг
		|ПОМЕСТИТЬ БоргиДоГрупуванняБезТзОВ
		|ИЗ
		|	боргБезТзОВ КАК боргБезТзОВ
		|
		|СГРУППИРОВАТЬ ПО
		|	боргБезТзОВ.Контрагент
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	просрочБезТзОВ.Борг,
		|	просрочБезТзОВ.Контрагент,
		|	СУММА(0)
		|ИЗ
		|	просрочБезТзОВ КАК просрочБезТзОВ
		|
		|СГРУППИРОВАТЬ ПО
		|	просрочБезТзОВ.Контрагент,
		|	просрочБезТзОВ.Борг
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	БоргиДоГрупування.Контрагент,
		|	СУММА(БоргиДоГрупування.Борг) КАК БоргТзОВ,
		|	СУММА(0) КАК БоргБезТзОВ,
		|	СУММА(БоргиДоГрупування.ПросроченийБорг) КАК ПросроченийБоргТзОВ,
		|	СУММА(0) КАК ПросроченийБоргБезТзОВ
		|ПОМЕСТИТЬ ОбэднаныБорги
		|ИЗ
		|	БоргиДоГрупуванняТзОВ КАК БоргиДоГрупування
		|
		|СГРУППИРОВАТЬ ПО
		|	БоргиДоГрупування.Контрагент
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	БоргиДоГрупуванняБезТзОВ.Контрагент,
		|	СУММА(0),
		|	СУММА(БоргиДоГрупуванняБезТзОВ.Борг),
		|	СУММА(0),
		|	СУММА(БоргиДоГрупуванняБезТзОВ.ПросроченийБорг)
		|ИЗ
		|	БоргиДоГрупуванняБезТзОВ КАК БоргиДоГрупуванняБезТзОВ
		|
		|СГРУППИРОВАТЬ ПО
		|	БоргиДоГрупуванняБезТзОВ.Контрагент
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ОбэднаныБорги.Контрагент,
		|	СУММА(ОбэднаныБорги.БоргТзОВ) КАК БоргТзОВ,
		|	СУММА(ОбэднаныБорги.БоргБезТзОВ) КАК БоргБезТзОВ,
		|	СУММА(ОбэднаныБорги.ПросроченийБоргТзОВ) КАК ПросроченийБоргТзОВ,
		|	СУММА(ОбэднаныБорги.ПросроченийБоргБезТзОВ) КАК ПросроченийБоргБезТзОВ
		|ИЗ
		|	ОбэднаныБорги КАК ОбэднаныБорги
		|
		|СГРУППИРОВАТЬ ПО
		|	ОбэднаныБорги.Контрагент";
	
	Запрос.УстановитьПараметр("ВідбірКонтрагент", Контрагент);
	Запрос.УстановитьПараметр("ТзОВ", Справочники.Организации.НайтиПоКоду("000000001"));
	Запрос.УстановитьПараметр("БезТзОВ", Справочники.Организации.ВолиньТабак);
	Запрос.УстановитьПараметр("НаДату", ТекущаяДата());
	Запрос.УстановитьПараметр("ПрДата", ТекущаяДата() + (24*60*60) - 604800);
	
	Выборка	 = Запрос.Выполнить().Выбрать();
	
	
	Если Выборка.Следующий() тогда 
		Борг =Выборка.БоргБезТзОВ;
		ПросроченийБорг = Выборка.ПросроченийБоргБезТзОВ;
		боргТзОВ =Выборка.БоргТзОВ;
		ПросроченийБоргТзОВ=Выборка.ПросроченийБоргТзОВ ;
	иначе 
		Борг =0;
		ПросроченийБорг = 0;
		боргТзОВ =0;
		ПросроченийБоргТзОВ=0; 
	КонецЕсли;	
	
КонецПроцедуры

Процедура ЗаповнитиБоргиКонтрагентів_НеВикористовувати(ТзКонтрагентов)
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТЗКонтрагентів.Контрагент КАК Ссилка
		|ПОМЕСТИТЬ ТЗКонтрагентів
		|ИЗ
		|	&ТЗКонтрагентів КАК ТЗКонтрагентів
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Ссилка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВзаиморасчетыСКонтрагентамиОстатки.Контрагент,
		|	СУММА(0) КАК БоргТЗОВ,
		|	СУММА(0) КАК ПростроченийБоргТЗОВ,
		|	СУММА(ВзаиморасчетыСКонтрагентамиОстатки.СуммаУпрОстаток) КАК Борг,
		|	СУММА(0) КАК ПростроченийБорг
		//|	СУММА(ВЫБОР
		//|			КОГДА ВзаиморасчетыСКонтрагентамиОстатки.ДокументРасчетовСКонтрагентом.Дата < &ПрДата
		//|				ТОГДА ВзаиморасчетыСКонтрагентамиОстатки.СуммаВзаиморасчетовОстаток
		//|			ИНАЧЕ 0
		//|		КОНЕЦ) КАК ПростроченийБорг
		|ИЗ
		|	РегистрНакопления.ВзаиморасчетыСКонтрагентами.Остатки(
		|			&НаДату,
		|			Контрагент В
		|					(ВЫБРАТЬ
		|						ТЗКонтрагентів.Ссилка
		|					ИЗ
		|						ТЗКонтрагентів КАК ТЗКонтрагентів)) КАК ВзаиморасчетыСКонтрагентамиОстатки
		|
		|СГРУППИРОВАТЬ ПО
		|	ВзаиморасчетыСКонтрагентамиОстатки.Контрагент";
	
	Запрос.УстановитьПараметр("ТЗКонтрагентів", ТзКонтрагентов);
	Запрос.УстановитьПараметр("НаДату", ТекущаяДата());
	Запрос.УстановитьПараметр("ПрДата", ТекущаяДата() + (24*60*60) - 604800);
	
	Выборка	 = Запрос.Выполнить().Выбрать();
		
	Пока Выборка.Следующий() Цикл  
		СтрокаТЗ = ТзКонтрагентов.Найти(Выборка.Контрагент, "Контрагент");
		Если СтрокаТЗ <> Неопределено Тогда 
			СтрокаТЗ.Борг =Выборка.Борг;
			СтрокаТЗ.ПросроченийБорг = Выборка.ПростроченийБорг;
			СтрокаТЗ.боргТзОВ =Выборка.БоргТзОВ;
			СтрокаТЗ.ПросроченийБоргТзОВ=Выборка.ПростроченийБоргТзОВ ;
		КонецЕсли;
	КонецЦикла;		
КонецПроцедуры

Процедура ЗаповнитиБоргиКонтрагентів(ТзКонтрагентов)
	
	ДатаПрострочки = ТекущаяДата() + (24*3600) - (3600 * 24 * 14);
	
	Запрос = Новый Запрос;
	Запрос.Текст ="ВЫБРАТЬ
	              |	ТЗКонтрагентів.Контрагент КАК Контрагент
	              |ПОМЕСТИТЬ ТЗКонтрагентів
	              |ИЗ
	              |	&ТЗКонтрагентів КАК ТЗКонтрагентів
	              |
	              |ИНДЕКСИРОВАТЬ ПО
	              |	Контрагент
	              |;
	              |
	              |////////////////////////////////////////////////////////////////////////////////
	              |ВЫБРАТЬ
	              |	РеализацияТоваровУслуг.Дата КАК Дата,
	              |	ВложенныйЗапрос.Контрагент КАК Контрагент,
	              |	ЕСТЬNULL(РеализацияТоваровУслуг.СуммаДокумента, 0) КАК СуммаДокумента,
	              |	ВложенныйЗапрос.СуммаВзаиморасчетовОстаток КАК БоргКонтрагента
	              |ИЗ
	              |	(ВЫБРАТЬ
	              |		ВзаиморасчетыСКонтрагентамиОстатки.Контрагент КАК Контрагент,
	              |		ВзаиморасчетыСКонтрагентамиОстатки.СуммаУпрОстаток КАК СуммаВзаиморасчетовОстаток
	              |	ИЗ
	              |		РегистрНакопления.ВзаиморасчетыСКонтрагентами.Остатки КАК ВзаиморасчетыСКонтрагентамиОстатки
	              |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТЗКонтрагентів КАК ТЗКонтрагентів
	              |			ПО ВзаиморасчетыСКонтрагентамиОстатки.Контрагент = ТЗКонтрагентів.Контрагент) КАК ВложенныйЗапрос
	              |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	              |		ПО (ВложенныйЗапрос.Контрагент = РеализацияТоваровУслуг.Контрагент)
	              |			И (РеализацияТоваровУслуг.Проведен)
				  //|ГДЕ
				  //|	РеализацияТоваровУслуг.СуммаДокумента > 0
	              |
	              |УПОРЯДОЧИТЬ ПО
	              |	Дата УБЫВ
	              |ИТОГИ
	              |	СРЕДНЕЕ(БоргКонтрагента)
	              |ПО
	              |	Контрагент";
	
	Запрос.УстановитьПараметр("ТЗКонтрагентів", ТзКонтрагентов);
	Запрос.УстановитьПараметр("НаДату", ТекущаяДата());

	ВыборкаКонтрагент = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаКонтрагент.Следующий() Цикл
		
		СуммаБоргу 			= ВыборкаКонтрагент.БоргКонтрагента;
	    Борг				= 0;
		ПростроченийБорг 	= 0;
		Выборка 			= ВыборкаКонтрагент.Выбрать();
	
		Пока Выборка.Следующий() Цикл
			Если Выборка.СуммаДокумента = 0 Тогда 
				Продолжить;
			КонецЕсли;
			
			Если СуммаБоргу = 0 Тогда 
				
				Прервать;
				
			ИначеЕсли СуммаБоргу < 0 Тогда 
				
				Борг = Борг + СуммаБоргу;
				
				Прервать;
				
			ИначеЕсли СуммаБоргу >= Выборка.СуммаДокумента  Тогда 
				
				Борг 				= Борг + Выборка.СуммаДокумента;
				ПростроченийБорг 	= ПростроченийБорг + ?(ДатаПрострочки > Выборка.Дата, Выборка.СуммаДокумента, 0);
				СуммаБоргу 			= СуммаБоргу - Выборка.СуммаДокумента;
				
			ИначеЕсли Выборка.СуммаДокумента > СуммаБоргу Тогда 
				
				Борг 				= Борг + СуммаБоргу;
				ПростроченийБорг 	= ПростроченийБорг + ?(ДатаПрострочки > Выборка.Дата, СуммаБоргу, 0);

				Прервать;
				
			КонецЕсли;
			
		КонецЦикла;
		
		СтрокаТЗ = ТзКонтрагентов.Найти(ВыборкаКонтрагент.Контрагент, "Контрагент");
		Если СтрокаТЗ <> Неопределено Тогда 
			СтрокаТЗ.Борг = ВыборкаКонтрагент.БоргКонтрагента;
			СтрокаТЗ.ПросроченийБорг = ПростроченийБорг;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Функция АсортиментКонтрагентов(Контрагенты)
	
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	АсортиментПокупателя.Контрагент,
		|	АсортиментПокупателя.Асортимент
		|ИЗ
		|	РегистрСведений.АсортиментПокупателя КАК АсортиментПокупателя
		|ГДЕ
		|	АсортиментПокупателя.Контрагент В(&Контрагент)";
	
	Запрос.УстановитьПараметр("Контрагент", Контрагенты);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
	
КонецФункции

Функция АсортиментПрезентаційКонтрагентов(Контрагенты)	
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	АсортиментПрезентацій.Контрагент,
		|	АсортиментПрезентацій.Асортимент
		|ИЗ
		|	РегистрСведений.АсортиментПрезентацій КАК АсортиментПрезентацій
		|ГДЕ
		|	АсортиментПрезентацій.Контрагент В(&Контрагент)";
	
	Запрос.УстановитьПараметр("Контрагент", Контрагенты);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
	
КонецФункции



#КонецОбласти

#Область ЗАПОЛНЕНИЕ_ДОКУМЕНТОВ

Функция ДобавитьДокументы(Настройка,Справочники,СкладПартнера,ПолнаяВыгрузка,КоличесвтоЗаписейДляОбмена,ПродавецПартнера)
	
	СтруктураДокументы = Новый Структура;
	
	ДобавитьРеализацию(СтруктураДокументы,Справочники,СкладПартнера,ПолнаяВыгрузка,КоличесвтоЗаписейДляОбмена,ПродавецПартнера);
	ДобавитьЗаказПокупателя(СтруктураДокументы, ПродавецПартнера, КоличесвтоЗаписейДляОбмена);
	ДобавитьМаршрутныйЛист(СтруктураДокументы, ПродавецПартнера, КоличесвтоЗаписейДляОбмена);
	Возврат СтруктураДокументы;
	
КонецФункции

Процедура ДобавитьПеремещение(СтруктураДокументы,Справочники,СкладПартнера,ПолнаяВыгрузка,КоличесвтоЗаписейДляОбмена,ПродавецПартнера)
	//Если НЕ ПолнаяВыгрузка Тогда 
	//	СтруктураДокументы.Вставить("Перемещение",  Новый ТаблицаЗначений);
	//	Возврат;
	//КонецЕсли;

	Запрос = Новый Запрос;
	
		Запрос.Текст = "ВЫБРАТЬ
		               |	ТоварыНаСкладахОстатки.Номенклатура,
		               |	ТоварыНаСкладахОстатки.ХарактеристикаНоменклатуры,
		               |	ТоварыНаСкладахОстатки.КоличествоОстаток КАК Количество,
		               |	ТоварыНаСкладахОстатки.Номенклатура.ЕдиницаХраненияОстатков КАК ЕдиницаИзмерения,
		               |	РегистрацияОбмена.ИД
		               |ИЗ
		               |	РегистрСведений.РегистрацияОбмена КАК РегистрацияОбмена
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ВыгружатьВАндроидПоСкладам КАК ВыгружатьВАндроидПоСкладам
		               |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыНаСкладах.Остатки(, Склад = &Склад) КАК ТоварыНаСкладахОстатки
		               |			ПО (ВыгружатьВАндроидПоСкладам.Номенклатура = ТоварыНаСкладахОстатки.Номенклатура
		               |					ИЛИ ВыгружатьВАндроидПоСкладам.Номенклатура = ТоварыНаСкладахОстатки.Номенклатура.Родитель
		               |					ИЛИ ВыгружатьВАндроидПоСкладам.Номенклатура = ТоварыНаСкладахОстатки.Номенклатура.Родитель.Родитель
		               |					ИЛИ ВыгружатьВАндроидПоСкладам.Номенклатура = ТоварыНаСкладахОстатки.Номенклатура.Родитель.Родитель.Родитель
		               |					ИЛИ ВыгружатьВАндроидПоСкладам.Номенклатура = ТоварыНаСкладахОстатки.Номенклатура.Родитель.Родитель.Родитель.Родитель
		               |					ИЛИ ВыгружатьВАндроидПоСкладам.Номенклатура = ТоварыНаСкладахОстатки.Номенклатура.Родитель.Родитель.Родитель.Родитель.Родитель)
		               |		ПО (РегистрацияОбмена.Объект = &ПустоеПеремещение)
		               |ГДЕ
		               |	ВыгружатьВАндроидПоСкладам.ТорговийАгент = &ТорговийАгент
		               |	И ТоварыНаСкладахОстатки.КоличествоОстаток > 0
		               |	И НЕ ТоварыНаСкладахОстатки.Номенклатура.ПометкаУдаления
		               |	И НЕ ТоварыНаСкладахОстатки.Номенклатура.ЭтоГруппа";
					   
					   
					   
					   
					   
					   
					   

		Запрос.УстановитьПараметр("ПустоеПеремещение",Документы.ПеремещениеТоваров.ПустаяСсылка());			   
	  	Запрос.УстановитьПараметр("ТорговийАгент", ПродавецПартнера);
		Запрос.УстановитьПараметр("Склад", СкладПартнера);
		
	
	ТзДок = Запрос.Выполнить().Выгрузить();
	ТзДок.Колонки.Добавить("УИДНоменклатура");
	ТзДок.Колонки.Добавить("УИДХарактеристикаНоменклатуры");
	ТзДок.Колонки.Добавить("УИДЕдиницаИзмерения");
	Для Каждого Строка Из ТзДок Цикл
		Строка.УИДНоменклатура = Строка.Номенклатура.УникальныйИдентификатор();
		Строка.УИДХарактеристикаНоменклатуры = Строка.ХарактеристикаНоменклатуры.УникальныйИдентификатор();
		Строка.УИДЕдиницаИзмерения = Строка.ЕдиницаИзмерения.УникальныйИдентификатор();
	КонецЦикла;
	//ТзДок.Колонки.Удалить(ТзДок.Колонки.СсылкаПер);
	
//	ТЗДок.Колонки.Ссылка.ТипЗначения = Новый ОписаниеТипов("ДокументСсылка.ПоступлениеТоваровУслуг,ДокументСсылка.ПеремещениеТоваров,ДокументСсылка.СписаниеТоваров,ДокументСсылка.ОприходованиеТоваров,NULL");
	
	/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
	//123!"№ Отбор записей из док.Поступление Тов и Услуг
	   ЗапросПоступление = Новый Запрос;
	
		ЗапросПоступление.Текст = "ВЫБРАТЬ ПЕРВЫЕ 5
		                          |	ПоступлениеТоваровУслугТовары.Ссылка
		                          |ИЗ
		                          |	Документ.ПоступлениеТоваровУслуг КАК ПоступлениеТоваровУслугТовары
		                          |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.РегистрацияОбмена КАК РегистрацияОбмена
		                          |		ПО ПоступлениеТоваровУслугТовары.Ссылка = РегистрацияОбмена.Объект
		                          |ГДЕ
		                          |	ПоступлениеТоваровУслугТовары.СкладОрдер = &СкладПартнера";

					   
	  	ЗапросПоступление.УстановитьПараметр("СкладПартнера", СкладПартнера);

		МассивДокументовПоступление = ЗапросПоступление.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");	

	    ЗапросПоступление.Текст = "ВЫБРАТЬ
	                              |	ПоступлениеТоваровУслугТовары.Ссылка,
	                              |	ПоступлениеТоваровУслугТовары.Ссылка.Номер,
	                              |	ПоступлениеТоваровУслугТовары.Ссылка.Дата,
	                              |	ПоступлениеТоваровУслугТовары.Ссылка.Проведен,
	                              |	ПоступлениеТоваровУслугТовары.Ссылка.Организация,
	                              |	ПоступлениеТоваровУслугТовары.Номенклатура,
	                              |	ПоступлениеТоваровУслугТовары.ЕдиницаИзмерения,
	                              |	ПоступлениеТоваровУслугТовары.Количество,
	                              |	ПоступлениеТоваровУслугТовары.ХарактеристикаНоменклатуры,
	                              |	ЛОЖЬ КАК ЭтоВозврат,
	                              |	РегистрацияОбмена.ИД,
	                              |	""П"" КАК Префикс
	                              |ИЗ
	                              |	Документ.ПоступлениеТоваровУслуг.Товары КАК ПоступлениеТоваровУслугТовары
	                              |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.РегистрацияОбмена КАК РегистрацияОбмена
	                              |		ПО ПоступлениеТоваровУслугТовары.Ссылка = РегистрацияОбмена.Объект
	                              |ГДЕ
	                              |	ПоступлениеТоваровУслугТовары.Ссылка В(&МассивДокументовПоступление)
	                              |	И РегистрацияОбмена.Продавец = &Продавец";	
	
	ЗапросПоступление.УстановитьПараметр("МассивДокументовПоступление", МассивДокументовПоступление);
	ЗапросПоступление.УстановитьПараметр("Продавец", ПродавецПартнера);
	
	ТзДокПоступление = ЗапросПоступление.Выполнить().Выгрузить();
	Для Каждого Строка Из ТзДокПоступление Цикл
		НоваяСтрТзДок = ТзДок.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрТзДок, Строка);
		НоваяСтрТзДок.Ссылка = Строка.Ссылка;
	КонецЦикла;
	/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
	//123!"№ Отбор записей из док. Оприходование
	 ЗапросОприходование = Новый Запрос;
	
		ЗапросОприходование.Текст = "ВЫБРАТЬ ПЕРВЫЕ 5
		                            |	ОприходованиеТоваров.Ссылка
		                            |ИЗ
		                            |	Документ.ОприходованиеТоваров КАК ОприходованиеТоваров
		                            |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.РегистрацияОбмена КАК РегистрацияОбмена
		                            |		ПО ОприходованиеТоваров.Ссылка = РегистрацияОбмена.Объект
		                            |ГДЕ
		                            |	ОприходованиеТоваров.Склад = &СкладПартнера";

					   
	  	ЗапросОприходование.УстановитьПараметр("СкладПартнера", СкладПартнера);

		МассивДокументовОприходование = ЗапросОприходование.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");	

	    ЗапросОприходование.Текст = "ВЫБРАТЬ
	                                |	ОприходованиеТоваровТовары.Ссылка,
	                                |	ОприходованиеТоваровТовары.Ссылка.Номер,
	                                |	ОприходованиеТоваровТовары.Ссылка.Дата,
	                                |	ОприходованиеТоваровТовары.Ссылка.Проведен,
	                                |	ОприходованиеТоваровТовары.Ссылка.Организация,
	                                |	ОприходованиеТоваровТовары.Номенклатура,
	                                |	ОприходованиеТоваровТовары.ЕдиницаИзмерения,
	                                |	ОприходованиеТоваровТовары.Количество,
	                                |	ОприходованиеТоваровТовары.ХарактеристикаНоменклатуры,
	                                |	ЛОЖЬ КАК ЭтоВозврат,
	                                |	РегистрацияОбмена.ИД,
	                                |	""О"" КАК Префикс
	                                |ИЗ
	                                |	Документ.ОприходованиеТоваров.Товары КАК ОприходованиеТоваровТовары
	                                |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.РегистрацияОбмена КАК РегистрацияОбмена
	                                |		ПО ОприходованиеТоваровТовары.Ссылка = РегистрацияОбмена.Объект
	                                |ГДЕ
	                                |	ОприходованиеТоваровТовары.Ссылка В(&МассивДокументовОприходование)
	                                |	И РегистрацияОбмена.Продавец = &Продавец";	
	
	ЗапросОприходование.УстановитьПараметр("МассивДокументовОприходование", МассивДокументовОприходование);
	ЗапросОприходование.УстановитьПараметр("Продавец", ПродавецПартнера);
	
	ТзДокОприходование = ЗапросОприходование.Выполнить().Выгрузить();
	Для Каждого Строка Из ТзДокОприходование Цикл
		НоваяСтрТзДок = ТзДок.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрТзДок, Строка);
		НоваяСтрТзДок.Ссылка = Строка.Ссылка;
	КонецЦикла;
	//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
	//123!"№ Отбор записей из док. Списание Товаров
	 ЗапросСписание = Новый Запрос;
	
		ЗапросСписание.Текст = "ВЫБРАТЬ ПЕРВЫЕ 5
		                       |	СписаниеТоваров.Ссылка
		                       |ИЗ
		                       |	Документ.СписаниеТоваров КАК СписаниеТоваров
		                       |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.РегистрацияОбмена КАК РегистрацияОбмена
		                       |		ПО СписаниеТоваров.Ссылка = РегистрацияОбмена.Объект
		                       |ГДЕ
		                       |	СписаниеТоваров.Склад = &СкладПартнера";

					   
	  	ЗапросСписание.УстановитьПараметр("СкладПартнера", СкладПартнера);

		МассивДокументовСписание = ЗапросСписание.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");	

	    ЗапросСписание.Текст = "ВЫБРАТЬ
	                           |	СписаниеТоваровТовары.Ссылка,
	                           |	СписаниеТоваровТовары.Ссылка.Номер,
	                           |	СписаниеТоваровТовары.Ссылка.Дата,
	                           |	СписаниеТоваровТовары.Ссылка.Проведен,
	                           |	СписаниеТоваровТовары.Ссылка.Организация,
	                           |	СписаниеТоваровТовары.Номенклатура,
	                           |	СписаниеТоваровТовары.ЕдиницаИзмерения,
	                           |	СписаниеТоваровТовары.Количество,
	                           |	СписаниеТоваровТовары.ХарактеристикаНоменклатуры,
	                           |	ИСТИНА КАК ЭтоВозврат,
	                           |	РегистрацияОбмена.ИД
	                           |ИЗ
	                           |	Документ.СписаниеТоваров.Товары КАК СписаниеТоваровТовары
	                           |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.РегистрацияОбмена КАК РегистрацияОбмена
	                           |		ПО СписаниеТоваровТовары.Ссылка = РегистрацияОбмена.Объект
	                           |ГДЕ
	                           |	СписаниеТоваровТовары.Ссылка В(&МассивДокументовСписание)
	                           |	И РегистрацияОбмена.Продавец = &Продавец";	
	
	ЗапросСписание.УстановитьПараметр("МассивДокументовСписание", МассивДокументовСписание);
	ЗапросСписание.УстановитьПараметр("Продавец", ПродавецПартнера);
	
	ТзДокСписание = ЗапросСписание.Выполнить().Выгрузить();
	Для Каждого Строка Из ТзДокСписание Цикл
		НоваяСтрТзДок = ТзДок.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрТзДок, Строка);
		НоваяСтрТзДок.Ссылка = Строка.Ссылка;
	КонецЦикла;
	
	/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
	
	КоличесвтоЗаписейДляОбмена = КоличесвтоЗаписейДляОбмена + ТзДок.Количество();
	
	СтруктураДокументы.Вставить("Перемещение", ТзДок);
	
КонецПроцедуры

Процедура ДобавитьРеализацию(СтруктураДокументы,Справочники,СкладПартнера,ПолнаяВыгрузка,КоличесвтоЗаписейДляОбмена, ПродавецПартнера)
	
	Запрос = Новый Запрос;	
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 2
	               |	РеализацияТоваровУслуг.Ссылка КАК Ссылка,
	               |	РегистрацияОбмена.ИД
	               |ПОМЕСТИТЬ Реализации
	               |ИЗ
	               |	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.РегистрацияОбмена КАК РегистрацияОбмена
	               |		ПО РеализацияТоваровУслуг.Ссылка = РегистрацияОбмена.Объект
	               |			И (РегистрацияОбмена.Продавец = &ТорговийАгент)
	               |			И (РеализацияТоваровУслуг.Дата > &Дата3Дня)
	               |			И (РеализацияТоваровУслуг.Ссылка.Проведен)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	РеализацияТоваровУслугТовары.Ссылка,
	               |	РеализацияТоваровУслугТовары.Ссылка.Номер,
	               |	РеализацияТоваровУслугТовары.Ссылка.Дата,
	               |	РеализацияТоваровУслугТовары.Ссылка.Проведен,
	               |	РеализацияТоваровУслугТовары.Ссылка.Организация КАК Организация,
	               |	РеализацияТоваровУслугТовары.Ссылка.Контрагент КАК Контрагент,
	               |	РеализацияТоваровУслугТовары.Ссылка.МаршрутныйЛист КАК МаршрутныйЛист,
	               |	РеализацияТоваровУслугТовары.Ссылка.Сделка КАК Сделка,
	               |	РеализацияТоваровУслугТовары.Ссылка.ТипЦен КАК ТипЦен,
	               |	РеализацияТоваровУслугТовары.Номенклатура,
	               |	РеализацияТоваровУслугТовары.ЕдиницаИзмерения,
	               |	РеализацияТоваровУслугТовары.Количество,
	               |	РеализацияТоваровУслугТовары.ХарактеристикаНоменклатуры,
	               |	РеализацияТоваровУслугТовары.Цена КАК Цена,
	               |	ПРЕДСТАВЛЕНИЕ(РеализацияТоваровУслугТовары.Ссылка.Контрагент) КАК КонтрагентПредставление,
	               |	РеализацияТоваровУслугТовары.Ссылка.СуммаДокумента КАК Сума,
	               |	ПРЕДСТАВЛЕНИЕ(РеализацияТоваровУслугТовары.Ссылка.ТорговийАгент) КАК ТорговийАгент,
	               |	"""" КАК ТорговаТочка,
	               |	Реализации.ИД,
				   //+wald_intrata_19112021
	               |	Реализации.Ссылка.Наложка КАК Наложка
				   //-wald_intrata_19112021
	               |ИЗ
	               |	Реализации КАК Реализации
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
	               |		ПО Реализации.Ссылка = РеализацияТоваровУслугТовары.Ссылка";
	
	
	
	
	Запрос.УстановитьПараметр("Склад", СкладПартнера);
	Запрос.УстановитьПараметр("ТорговийАгент", ПродавецПартнера);
	Запрос.УстановитьПараметр("Дата3Дня", ТекущаяДата() - (1 * 24 * 60 * 60));	
	
	ТзДок = Запрос.Выполнить().Выгрузить();
	ТзДок.Колонки.Добавить("УИДСсылка");
	ТзДок.Колонки.Добавить("УИДКонтрагент");
	ТзДок.Колонки.Добавить("УИДМаршрутныйЛист");
	ТзДок.Колонки.Добавить("УИДСделка");
	ТзДок.Колонки.Добавить("УИДТипЦен");
	ТзДок.Колонки.Добавить("УИДНоменклатура");
	ТзДок.Колонки.Добавить("УИДЕдиницаИзмерения");
	ТзДок.Колонки.Добавить("УИДХарактеристикаНоменклатуры");
	ТзДок.Колонки.Добавить("ПершаФорма");
	Для Каждого Строка Из ТзДок Цикл
		Строка.УИДСсылка 						= Строка.Ссылка.УникальныйИдентификатор();
		Строка.УИДКонтрагент 					= Строка.Контрагент.УникальныйИдентификатор();
		Строка.УИДМаршрутныйЛист				= Строка.МаршрутныйЛист.УникальныйИдентификатор();
		Строка.УИДСделка						= Строка.Сделка.УникальныйИдентификатор();
		Строка.УИДТипЦен 						= Строка.ТипЦен.УникальныйИдентификатор();
		Строка.УИДНоменклатура 					= Строка.Номенклатура.УникальныйИдентификатор();
		Строка.УИДЕдиницаИзмерения 				= Строка.ЕдиницаИзмерения.УникальныйИдентификатор();
		Строка.УИДХарактеристикаНоменклатуры 	= Строка.ХарактеристикаНоменклатуры.УникальныйИдентификатор();
		Строка.ПершаФорма 						= ?(Строка.Организация.Код = "000000001", Истина, Ложь);
	КонецЦикла;
	
	КоличесвтоЗаписейДляОбмена = КоличесвтоЗаписейДляОбмена + ТзДок.Количество();
	СтруктураДокументы.Вставить("Реализация", ТзДок);
	
КонецПроцедуры

Процедура ДобавитьВозвратОтПокупателя(СтруктураДокументы,Справочники,СкладПартнера,ПолнаяВыгрузка,КоличесвтоЗаписейДляОбмена,ПродавецПартнера)

		Запрос = Новый Запрос;
		
Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 5
		               |	РеализацияТоваровУслугТовары.Ссылка
					   |ИЗ
		               |	Документ.ВозвратТоваровОтПокупателя КАК РеализацияТоваровУслугТовары
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.РегистрацияОбмена КАК РегистрацияОбмена
		               |		ПО РеализацияТоваровУслугТовары.Ссылка = РегистрацияОбмена.Объект
		               |ГДЕ
		               //|	РеализацияТоваровУслугТовары.Ссылка.Проведен
		               |	РеализацияТоваровУслугТовары.Ссылка.СкладОрдер = &Склад";

					   
	  	Запрос.УстановитьПараметр("Склад", СкладПартнера);

		МассивДокументов = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
					   
		Запрос.Текст = "ВЫБРАТЬ 
		               |	РеализацияТоваровУслугТовары.Ссылка,
		               |	РеализацияТоваровУслугТовары.Ссылка.Номер,
		               |	РеализацияТоваровУслугТовары.Ссылка.Дата,
		               |	РеализацияТоваровУслугТовары.Ссылка.Проведен,
		               |	РеализацияТоваровУслугТовары.Ссылка.Организация,
		               |	РеализацияТоваровУслугТовары.Номенклатура,
		               |	РеализацияТоваровУслугТовары.ЕдиницаИзмерения,
		               |	РеализацияТоваровУслугТовары.Количество,
		               |	РеализацияТоваровУслугТовары.ХарактеристикаНоменклатуры,
		               |	РегистрацияОбмена.ИД,
		               |	РеализацияТоваровУслугТовары.Цена КАК ЦенаПартнера,
		               |	РеализацияТоваровУслугТовары.ЦенаКонечногоПокупателя КАК Цена
		               |ИЗ
		               |	Документ.ВозвратТоваровОтПокупателя.Товары КАК РеализацияТоваровУслугТовары
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.РегистрацияОбмена КАК РегистрацияОбмена
		               |		ПО РеализацияТоваровУслугТовары.Ссылка = РегистрацияОбмена.Объект
		               |ГДЕ
		               //|	РеализацияТоваровУслугТовары.Ссылка.Проведен
		               |	РеализацияТоваровУслугТовары.Ссылка В (&МассивДокументов)
					   |	И РегистрацияОбмена.Продавец = &Продавец";
		
		
		
		
	
	Запрос.УстановитьПараметр("МассивДокументов", МассивДокументов);
	Запрос.УстановитьПараметр("Продавец", ПродавецПартнера);
	ТзДок = Запрос.Выполнить().Выгрузить();
	КоличесвтоЗаписейДляОбмена = КоличесвтоЗаписейДляОбмена + ТзДок.Количество();
	СтруктураДокументы.Вставить("ВозвратОтПокупателя", ТзДок);
КонецПроцедуры

Процедура ДобавитьКассовыеОрдера(СтруктураДокументы,Справочники,СкладПартнера,ПолнаяВыгрузка,КоличесвтоЗаписейДляОбмена,ПродавецПартнера)
	Если Справочники.Номенклатура.Количество() Тогда 
		СтруктураДокументы.Вставить("КассовыеОрдеры", Новый ТаблицаЗначений);
		Возврат;
	КонецЕсли;

Запрос = Новый Запрос;
	
		
		Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 5
		               |	ПриходныйКассовыйОрдер.Ссылка,
		               |	ПриходныйКассовыйОрдер.Номер,
		               |	ПриходныйКассовыйОрдер.Дата,
		               |	ПриходныйКассовыйОрдер.Проведен,
		               |	ПриходныйКассовыйОрдер.Организация,
		               |	РегистрацияОбмена.ИД,
		               |	ПриходныйКассовыйОрдер.СуммаДокумента,
		               |	0 КАК ВидДвижения
		               |ИЗ
		               |	Документ.ПриходныйКассовыйОрдер КАК ПриходныйКассовыйОрдер
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.РегистрацияОбмена КАК РегистрацияОбмена
		               |		ПО ПриходныйКассовыйОрдер.Ссылка = РегистрацияОбмена.Объект
		               |ГДЕ
		               |	ПриходныйКассовыйОрдер.Ссылка.Проведен
		               |	И ПриходныйКассовыйОрдер.Оплачено
		               |	И ПриходныйКассовыйОрдер.Контрагент = &Контрагент
					   |	И РегистрацияОбмена.Продавец = &Продавец
		               |
		               |ОБЪЕДИНИТЬ ВСЕ
		               |
		               |ВЫБРАТЬ
		               |	РасходныйКассовыйОрдер.Ссылка,
		               |	РасходныйКассовыйОрдер.Номер,
		               |	РасходныйКассовыйОрдер.Дата,
		               |	РасходныйКассовыйОрдер.Проведен,
		               |	РасходныйКассовыйОрдер.Организация,
		               |	РегистрацияОбмена.ИД,
		               |	РасходныйКассовыйОрдер.СуммаДокумента,
		               |	1
		               |ИЗ
		               |	Документ.РасходныйКассовыйОрдер КАК РасходныйКассовыйОрдер
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.РегистрацияОбмена КАК РегистрацияОбмена
		               |		ПО РасходныйКассовыйОрдер.Ссылка = РегистрацияОбмена.Объект
		               |ГДЕ
		               |	РасходныйКассовыйОрдер.Ссылка.Проведен
		               |	И РасходныйКассовыйОрдер.Оплачено
		               |	И РасходныйКассовыйОрдер.Контрагент = &Контрагент
					   |	И РегистрацияОбмена.Продавец = &Продавец";
		
		
		
		
	Запрос.УстановитьПараметр("Контрагент", СкладПартнера.Партнер);
	Запрос.УстановитьПараметр("Продавец", ПродавецПартнера);	
	ТзДок = Запрос.Выполнить().Выгрузить();
	КоличесвтоЗаписейДляОбмена = КоличесвтоЗаписейДляОбмена + ТзДок.Количество();
	СтруктураДокументы.Вставить("КассовыеОрдеры", ТзДок);	
КонецПроцедуры

Процедура ДобавитьЗаказПокупателя(СтруктураДокументы, Продавец, КоличесвтоЗаписейДляОбмена)
	
	МассивДокументов = Новый Массив;
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаказПокупателя.Ссылка КАК Ссылка,
		|	РегистрацияОбмена.ИД КАК ИД,
		|	ВЫРАЗИТЬ(ЗаказПокупателя.Комментарий КАК СТРОКА(254)) КАК Комментарий,
		|	ЗаказПокупателя.Контрагент,
		|	ЗаказПокупателя.ТипЦен,
		|	ЗаказПокупателя.СуммаДокумента,
		|	ЗаказПокупателя.Дата,
		|	ЗаказПокупателяТовары.Номенклатура,
		|	ЗаказПокупателяТовары.ХарактеристикаНоменклатуры,
		|	ЗаказПокупателяТовары.Количество,
		|	ЗаказПокупателяТовары.Цена,
		|	ЗаказПокупателяТовары.Сумма,
		|	ЗаказПокупателяТовары.ЦенаПродажиВес,
		|	ЗаказПокупателяТовары.ЕдиницаИзмерения,
		|	ЕСТЬNULL(ЗаказПокупателя.СтатусДоставки.Код, """") КАК Доставка,
		|	ЗаказПокупателя.ПометкаУдаления,
		//+wald_intrata_19112021
		|	ЗаказПокупателя.Наложка КАК Наложка
		//-wald_intrata_19112021
		|ИЗ
		|	Документ.ЗаказПокупателя.Товары КАК ЗаказПокупателяТовары
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказПокупателя КАК ЗаказПокупателя
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.РегистрацияОбмена КАК РегистрацияОбмена
		|			ПО ЗаказПокупателя.Ссылка = РегистрацияОбмена.Объект
		|				И (РегистрацияОбмена.Продавец = &Продавец)
		|		ПО ЗаказПокупателяТовары.Ссылка = ЗаказПокупателя.Ссылка
		|ИТОГИ
		|	МАКСИМУМ(ИД)
		|ПО
		|	Ссылка";
	
	Запрос.УстановитьПараметр("Продавец", Продавец);
	ВыборкаДокументи = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);

	//Если ВыборкаДокументи.Количество() > 1 Тогда 
	//	ВыборкаДокументи.Количество(); 
	//КонецЕсли;	
	Пока ВыборкаДокументи.Следующий() Цикл 
		Если НЕ ЗначениеЗаполнено(ВыборкаДокументи.Ссылка) Тогда 
			Продолжить;
		КонецЕсли;
				
				
		СтруктураДокумента = Новый Структура();
		СтруктураДокумента.Вставить("ИД", 				ВыборкаДокументи.ИД);
		СтруктураДокумента.Вставить("Ссылка", 			ВыборкаДокументи.Ссылка.УникальныйИдентификатор());
		СтруктураДокумента.Вставить("Комментарий", 		ВыборкаДокументи.Комментарий);
		СтруктураДокумента.Вставить("Контрагент", 		ВыборкаДокументи.Контрагент.УникальныйИдентификатор());
		СтруктураДокумента.Вставить("ТипЦен", 			ВыборкаДокументи.ТипЦен.УникальныйИдентификатор());
		СтруктураДокумента.Вставить("СуммаДокумента", 	ВыборкаДокументи.СуммаДокумента);
		СтруктураДокумента.Вставить("Дата", 			ВыборкаДокументи.Дата);
		СтруктураДокумента.Вставить("Доставка", 		ВыборкаДокументи.Доставка);
		СтруктураДокумента.Вставить("ПометкаУдаления",  ВыборкаДокументи.ПометкаУдаления);
		СтруктураДокумента.Вставить("Наложка",  		ВыборкаДокументи.Наложка); //+wald_intrata_19112021
 
		Товары = Новый Массив;
		
		Выборка = ВыборкаДокументи.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			СтруктураТовары = Новый Структура;
			
			СтруктураТовары.Вставить("Номенклатура", 				Выборка.Номенклатура.УникальныйИдентификатор());
			СтруктураТовары.Вставить("ХарактеристикаНоменклатуры", 	Выборка.ХарактеристикаНоменклатуры.УникальныйИдентификатор());
			СтруктураТовары.Вставить("ЕдиницаИзмерения", 			Выборка.ЕдиницаИзмерения.УникальныйИдентификатор());
			СтруктураТовары.Вставить("Количество", 					Выборка.Количество); 
			СтруктураТовары.Вставить("Цена", 						Выборка.Цена);		 
			СтруктураТовары.Вставить("Сумма", 						Выборка.Сумма);		 
			СтруктураТовары.Вставить("ЦенаПродажиВес", 				Выборка.ЦенаПродажиВес);
			
			Товары.Добавить(СтруктураТовары);
			
		КонецЦикла;
		
		СтруктураДокумента.Вставить("Товары", Товары);
		МассивДокументов.Добавить(СтруктураДокумента);
	КонецЦикла;
	
	КоличесвтоЗаписейДляОбмена = КоличесвтоЗаписейДляОбмена + МассивДокументов.Количество();
	СтруктураДокументы.Вставить("Заказы", МассивДокументов);
	
КонецПроцедуры

Процедура ДобавитьМаршрутныйЛист(СтруктураДокументы, ПродавецПартнера, КоличесвтоЗаписейДляОбмена)
	
	МассивДокументов 	= Новый Массив;
	Запрос 				= Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	МаршрутныйЛист.Ссылка КАК Ссылка,
	               |	РегистрацияОбмена.ИД КАК ИД,
	               |	ВЫРАЗИТЬ(МаршрутныйЛист.Комментарий КАК СТРОКА(254)) КАК Комментарий,
	               |	МаршрутныйЛист.СтатусДокумента,
	               |	МаршрутныйЛист.СуммаДокумента,
	               |	МаршрутныйЛист.Дата,
	               |	МаршрутныйЛист.ПометкаУдаления,
	               |	МаршрутныйЛистЗаказы.ЗаказПокупателя,
	               |	МаршрутныйЛистЗаказы.Контрагент,
	               |	МаршрутныйЛистТоварыЗаказов.Номенклатура,
	               |	МаршрутныйЛистТоварыЗаказов.ХарактеристикаНоменклатуры,
	               |	МаршрутныйЛистТоварыЗаказов.ЕдиницаИзмерения,
	               |	МаршрутныйЛистТоварыЗаказов.Количество,
	               |	МаршрутныйЛистТоварыЗаказов.Цена,
	               |	МаршрутныйЛистТоварыЗаказов.Сумма,
	               |	МаршрутныйЛистТоварыЗаказов.КоличествоЗагружено
	               |ИЗ
	               |	Документ.МаршрутныйЛист.ТоварыЗаказов КАК МаршрутныйЛистТоварыЗаказов
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.МаршрутныйЛист КАК МаршрутныйЛист
	               |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.РегистрацияОбмена КАК РегистрацияОбмена
	               |			ПО МаршрутныйЛист.Ссылка = РегистрацияОбмена.Объект
	               |				И (РегистрацияОбмена.Продавец = &ТорговийАгент)
	               |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.МаршрутныйЛист.Заказы КАК МаршрутныйЛистЗаказы
	               |			ПО (МаршрутныйЛистЗаказы.Ссылка = МаршрутныйЛист.Ссылка)
	               |		ПО (МаршрутныйЛистТоварыЗаказов.ЗаказПокупателя = МаршрутныйЛистЗаказы.ЗаказПокупателя)
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	МаршрутныйЛистЗаказы.Ссылка,
	               |	МаршрутныйЛистЗаказы.НомерСтроки
	               |ИТОГИ
	               |	МАКСИМУМ(ИД)
	               |ПО
	               |	Ссылка";
	Запрос.УстановитьПараметр("ТорговийАгент", ПродавецПартнера);
	
	ВыборкаДокументи = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаДокументи.Следующий() Цикл 
		Если НЕ ЗначениеЗаполнено(ВыборкаДокументи.Ссылка) Тогда 
			Продолжить;
		КонецЕсли;
		СтруктураДокумента = Новый Структура();
		СтруктураДокумента.Вставить("ИД", 				ВыборкаДокументи.ИД);
		СтруктураДокумента.Вставить("Ссылка", 			ВыборкаДокументи.Ссылка.УникальныйИдентификатор());
		СтруктураДокумента.Вставить("Дата", 			ВыборкаДокументи.Дата);
		СтруктураДокумента.Вставить("СтатусДокумента", 	?(ВыборкаДокументи.СтатусДокумента = Перечисления.СтатусыМаршрутногоЛиста.Составляется, "Составляется", ?(ВыборкаДокументи.СтатусДокумента = Перечисления.СтатусыМаршрутногоЛиста.Отправлен, "Отправлен", ?(ВыборкаДокументи.СтатусДокумента = Перечисления.СтатусыМаршрутногоЛиста.Завершен, "Завершен", Неопределено))));
		СтруктураДокумента.Вставить("Комментарий", 		ВыборкаДокументи.Комментарий);
		СтруктураДокумента.Вставить("ПометкаУдаления",  ВыборкаДокументи.ПометкаУдаления);
		
		Заказы 		= Новый Массив;
		Товары 		= Новый Массив;
		Выборка 	= ВыборкаДокументи.Выбрать();
		Пока Выборка.Следующий() Цикл
			СтруктураЗаказы = Новый Структура;			
			СтруктураЗаказы.Вставить("ЗаказПокупателя",				Выборка.ЗаказПокупателя.УникальныйИдентификатор());
			СтруктураЗаказы.Вставить("Контрагент",					Выборка.Контрагент.УникальныйИдентификатор());
			Заказы.Добавить(СтруктураЗаказы);
			
			СтруктураТовары = Новый Структура;
			СтруктураТовары.Вставить("ЗаказПокупателя",				Выборка.ЗаказПокупателя.УникальныйИдентификатор());
			СтруктураТовары.Вставить("Контрагент",					Выборка.Контрагент.УникальныйИдентификатор());			
			СтруктураТовары.Вставить("Номенклатура", 				Выборка.Номенклатура.УникальныйИдентификатор());
			СтруктураТовары.Вставить("ХарактеристикаНоменклатуры", 	Выборка.ХарактеристикаНоменклатуры.УникальныйИдентификатор());
			СтруктураТовары.Вставить("ЕдиницаИзмерения", 			Выборка.ЕдиницаИзмерения.УникальныйИдентификатор());
			СтруктураТовары.Вставить("Количество", 					Выборка.Количество); 
			СтруктураТовары.Вставить("КоличествоЗагружено", 		Выборка.КоличествоЗагружено); 
			СтруктураТовары.Вставить("Цена", 						Выборка.Цена);		 
			СтруктураТовары.Вставить("Сумма", 						Выборка.Сумма);		 
			Товары.Добавить(СтруктураТовары);
			
		КонецЦикла;
		СтруктураДокумента.Вставить("Заказы", Заказы);		
		СтруктураДокумента.Вставить("Товары", Товары);
		МассивДокументов.Добавить(СтруктураДокумента);
	КонецЦикла;
	
	КоличесвтоЗаписейДляОбмена = КоличесвтоЗаписейДляОбмена + МассивДокументов.Количество();
	
	Запрос 				= Новый Запрос;	
	Запрос.Текст = "ВЫБРАТЬ
	               |	МаршрутныйЛист.Ссылка КАК Ссылка,
	               |	РегистрацияОбмена.ИД КАК ИД,
	               |	ВЫРАЗИТЬ(МаршрутныйЛист.Комментарий КАК СТРОКА(254)) КАК Комментарий,
	               |	МаршрутныйЛист.СтатусДокумента,
	               |	МаршрутныйЛист.СуммаДокумента,
	               |	МаршрутныйЛист.Дата,
	               |	МаршрутныйЛист.ПометкаУдаления,
	               |	МаршрутныйЛистЗагрузкаМашины.ЗаказПокупателя КАК ЗаказПокупателяЗагрузка,
	               |	МаршрутныйЛистЗагрузкаМашины.Контрагент КАК КонтрагентЗагрузка,
	               |	МаршрутныйЛистЗагрузкаМашины.Номенклатура КАК НоменклатураЗагрузка,
	               |	МаршрутныйЛистЗагрузкаМашины.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатурыЗагрузка,
	               |	МаршрутныйЛистЗагрузкаМашины.ЕдиницаИзмерения КАК ЕдиницаИзмеренияЗагрузка,
	               |	МаршрутныйЛистЗагрузкаМашины.Количество КАК КоличествоЗагрузка,
	               |	МаршрутныйЛистЗагрузкаМашины.Вес,
	               |	МаршрутныйЛистЗагрузкаМашины.Цена КАК ЦенаЗагрузка,
	               |	МаршрутныйЛистЗагрузкаМашины.Сумма КАК СуммаЗагрузка,
	               |	МаршрутныйЛистЗагрузкаМашины.Загружен,
	               |	МаршрутныйЛистЗагрузкаМашины.Возврат,
	               |	МаршрутныйЛистЗагрузкаМашины.Штрихкод,
	               |	МаршрутныйЛистЗагрузкаМашины.ЦенаПродажиВес
	               |ИЗ
	               |	Документ.МаршрутныйЛист КАК МаршрутныйЛист
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.РегистрацияОбмена КАК РегистрацияОбмена
	               |		ПО МаршрутныйЛист.Ссылка = РегистрацияОбмена.Объект
	               |			И (РегистрацияОбмена.Продавец = &ТорговийАгент)
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.МаршрутныйЛист.ЗагрузкаМашины КАК МаршрутныйЛистЗагрузкаМашины
	               |		ПО (МаршрутныйЛистЗагрузкаМашины.Ссылка = МаршрутныйЛист.Ссылка)
	               |ИТОГИ
	               |	МАКСИМУМ(ИД)
	               |ПО
	               |	Ссылка";
	Запрос.УстановитьПараметр("ТорговийАгент", ПродавецПартнера);
	
	ВыборкаДокументи = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаДокументи.Следующий() Цикл 
		Если НЕ ЗначениеЗаполнено(ВыборкаДокументи.Ссылка) Тогда 
			Продолжить;
		КонецЕсли;
		СтруктураДокумента = Новый Структура();
		СтруктураДокумента.Вставить("ИД", 				ВыборкаДокументи.ИД);
		СтруктураДокумента.Вставить("Ссылка", 			ВыборкаДокументи.Ссылка.УникальныйИдентификатор());
		СтруктураДокумента.Вставить("Дата", 			ВыборкаДокументи.Дата);
		СтруктураДокумента.Вставить("СтатусДокумента", 	?(ВыборкаДокументи.СтатусДокумента = Перечисления.СтатусыМаршрутногоЛиста.Составляется, "Составляется", ?(ВыборкаДокументи.СтатусДокумента = Перечисления.СтатусыМаршрутногоЛиста.Отправлен, "Отправлен", ?(ВыборкаДокументи.СтатусДокумента = Перечисления.СтатусыМаршрутногоЛиста.Завершен, "Завершен", Неопределено))));
		СтруктураДокумента.Вставить("Комментарий", 		ВыборкаДокументи.Комментарий);
		СтруктураДокумента.Вставить("ПометкаУдаления",  ВыборкаДокументи.ПометкаУдаления);
		
		Загрузка 	= Новый Массив;
		Выборка 	= ВыборкаДокументи.Выбрать();
		Пока Выборка.Следующий() Цикл
			СтруктураЗагрузка = Новый Структура;
			СтруктураЗагрузка.Вставить("ЗаказПокупателя",				Выборка.ЗаказПокупателяЗагрузка.УникальныйИдентификатор());
			СтруктураЗагрузка.Вставить("Контрагент",					Выборка.КонтрагентЗагрузка.УникальныйИдентификатор());			
			СтруктураЗагрузка.Вставить("Номенклатура", 					Выборка.НоменклатураЗагрузка.УникальныйИдентификатор());
			СтруктураЗагрузка.Вставить("ХарактеристикаНоменклатуры", 	Выборка.ХарактеристикаНоменклатурыЗагрузка.УникальныйИдентификатор());
			СтруктураЗагрузка.Вставить("ЕдиницаИзмерения", 				Выборка.ЕдиницаИзмеренияЗагрузка.УникальныйИдентификатор());
			СтруктураЗагрузка.Вставить("Количество", 					Выборка.КоличествоЗагрузка); 
			СтруктураЗагрузка.Вставить("Вес", 							Выборка.Вес);		 
			СтруктураЗагрузка.Вставить("Цена", 							Выборка.ЦенаЗагрузка);		 
			СтруктураЗагрузка.Вставить("Сумма", 						Выборка.СуммаЗагрузка);		 
			СтруктураЗагрузка.Вставить("Штрихкод", 						Выборка.Штрихкод);		 
			СтруктураЗагрузка.Вставить("ЦенаПродажиВес", 				Выборка.ЦенаПродажиВес);		 			
			Загрузка.Добавить(СтруктураЗагрузка);			
		КонецЦикла;
		Для Каждого ЭлементМассива Из МассивДокументов Цикл 
			Если ЭлементМассива.Ссылка = СтруктураДокумента.Ссылка Тогда 
				ЭлементМассива.Вставить("Загрузка", Загрузка);
			КонецЕсли;	
		КонецЦикла;
	КонецЦикла;	
	
	Для Каждого ЭлементМассива Из МассивДокументов Цикл 
		Если НЕ ЭлементМассива.Свойство("Загрузка") Тогда 
			ЭлементМассива.Вставить("Загрузка", Новый Массив);
		КонецЕсли;	
	КонецЦикла;	
	
	
	Для Каждого Элемент Из МассивДокументов Цикл
		
		Элемент.Вставить("НеХватает", ПолучитьТаблицуНеХватаетМаршрутныйЛист(Элемент.Ссылка));

	КонецЦикла;
	

	
	КоличесвтоЗаписейДляОбмена = КоличесвтоЗаписейДляОбмена + МассивДокументов.Количество();
	СтруктураДокументы.Вставить("МаршрутныйЛист", МассивДокументов);
	
КонецПроцедуры
 
Функция ПолучитьТаблицуНеХватаетМаршрутныйЛист(МаршрутныйЛист)
	
	ТЗ_НеХватает = Новый ТаблицаЗначений;
	
	ТЗ_НеХватает.Колонки.Добавить("Ссылка");
	ТЗ_НеХватает.Колонки.Добавить("Заказ");
	ТЗ_НеХватает.Колонки.Добавить("Номенклатура");
	ТЗ_НеХватает.Колонки.Добавить("НеХватает");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	МаршрутныйЛистТоварыЗаказов.Ссылка,
	|	МаршрутныйЛистТоварыЗаказов.Номенклатура КАК Номенклатура,
	|	МаршрутныйЛистТоварыЗаказов.ЗаказПокупателя,
	|	МаршрутныйЛистТоварыЗаказов.КоличествоЗагружено,
	|	МаршрутныйЛистТоварыЗаказов.Количество,
	|	ВЫБОР
	|		КОГДА МаршрутныйЛистТоварыЗаказов.КоличествоФакт = 0
	|			ТОГДА МаршрутныйЛистТоварыЗаказов.Количество
	|		ИНАЧЕ МаршрутныйЛистТоварыЗаказов.КоличествоФакт
	|	КОНЕЦ - МаршрутныйЛистТоварыЗаказов.КоличествоЗагружено КАК мКоличество,
	|	МаршрутныйЛистЗаказы.НомерСтроки КАК НомерСтроки,
	|	0 КАК КоличествоОстаток
	|ИЗ
	|	Документ.МаршрутныйЛист.ТоварыЗаказов КАК МаршрутныйЛистТоварыЗаказов
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.МаршрутныйЛист.Заказы КАК МаршрутныйЛистЗаказы
	|		ПО МаршрутныйЛистТоварыЗаказов.Ссылка = МаршрутныйЛистЗаказы.Ссылка
	|			И МаршрутныйЛистТоварыЗаказов.ЗаказПокупателя = МаршрутныйЛистЗаказы.ЗаказПокупателя
	|ГДЕ
	|	МаршрутныйЛистТоварыЗаказов.Ссылка = &Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МаршрутныйЛистТоварыЗаказов.Номенклатура,
	|	ЕСТЬNULL(ТоварыНаСкладахОстатки.КоличествоОстаток, 0) КАК КоличествоОстаток
	|ИЗ
	|	Документ.МаршрутныйЛист.ТоварыЗаказов КАК МаршрутныйЛистТоварыЗаказов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыНаСкладах.Остатки(&Период, Склад = &Склад) КАК ТоварыНаСкладахОстатки
	|		ПО МаршрутныйЛистТоварыЗаказов.Ссылка.Склад = ТоварыНаСкладахОстатки.Склад
	|			И МаршрутныйЛистТоварыЗаказов.Номенклатура = ТоварыНаСкладахОстатки.Номенклатура
	|ГДЕ
	|	МаршрутныйЛистТоварыЗаказов.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	МаршрутныйЛистТоварыЗаказов.Номенклатура,
	|	ЕСТЬNULL(ТоварыНаСкладахОстатки.КоличествоОстаток, 0)";
	
	Ссылка = Документы.МаршрутныйЛист.ПолучитьСсылку(МаршрутныйЛист);
	Если НЕ ЗначениеЗаполнено(Ссылка.ВерсияДанных) Тогда 
		Возврат ТЗ_НеХватает;
	КонецЕсли;
	
	Параметры = Новый Массив(2);
	Параметры[0] = Ссылка.МоментВремени();
	Параметры[1] = ВидГраницы.Исключая;
	ПериодОстатков = Новый(Тип("Граница"), Параметры);	
	
	Запрос.УстановитьПараметр("Период", ПериодОстатков);
	Запрос.УстановитьПараметр("Склад", Ссылка.Склад);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Результат = Запрос.ВыполнитьПакет();
	Остатки = Результат.Получить(1).Выгрузить();
	Выборка = Результат.Получить(0).Выгрузить();
	
	Для Каждого СтрТоварыЗаказов  Из Выборка Цикл
		
		СтрОстатков = Остатки.Найти(СтрТоварыЗаказов.Номенклатура, "Номенклатура");
		
		Если СтрОстатков <> Неопределено Тогда 
			СтрТоварыЗаказов.КоличествоОстаток 	= СтрОстатков.КоличествоОстаток - СтрТоварыЗаказов.КоличествоЗагружено;
			СтрОстатков.КоличествоОстаток 		= СтрОстатков.КоличествоОстаток - СтрТоварыЗаказов.КоличествоЗагружено;
		КонецЕсли;	
	КонецЦикла;
	
	
	Для Каждого СтрТоварыЗаказов Из Выборка Цикл 
		Если (СтрТоварыЗаказов.Количество - СтрТоварыЗаказов.КоличествоЗагружено)  > СтрТоварыЗаказов.КоличествоОстаток Тогда 
			//мНеХватает = НеХватает + 
			СтрНеХватает = ТЗ_НеХватает.Добавить();
			СтрНеХватает.Номенклатура = СтрТоварыЗаказов.Номенклатура.УникальныйИдентификатор();
			СтрНеХватает.Заказ = СтрТоварыЗаказов.ЗаказПокупателя.УникальныйИдентификатор();
			СтрНеХватает.НеХватает = (СтрТоварыЗаказов.мКоличество - СтрТоварыЗаказов.КоличествоОстаток);
			
		КонецЕсли;
	КонецЦикла;	
	
	Возврат ТЗ_НеХватает;
	
КонецФункции


#КонецОбласти

#Область ЗАПОЛНЕНИЕ_РЕГИСТРОВ

Функция ДобавитьРегистрыСведений(Настройка,Справочники,Склад,КоличесвтоЗаписейДляОбмена,ПродавецПартнера,ПолнаяВыгрузка)
	
	СтруктураРегистрыСведений = Новый Структура;
	ДобавитьРегистрШтрихкоды(СтруктураРегистрыСведений,Справочники,КоличесвтоЗаписейДляОбмена);
	ДобавитьРегистрЦеныНоменклатуры(СтруктураРегистрыСведений,Справочники,КоличесвтоЗаписейДляОбмена);
	ДобавитьРегистрКатегорииОбъектов(СтруктураРегистрыСведений, Справочники, КоличесвтоЗаписейДляОбмена); //intrata_wald_08092021
	ДобавитьРегистрИсторияРаботыСКлиентом(СтруктураРегистрыСведений, Справочники, КоличесвтоЗаписейДляОбмена,ПродавецПартнера); 
	
	Возврат СтруктураРегистрыСведений;
	
КонецФункции

Функция ДобавитьРегистрыНакопления(Настройка,КоличесвтоЗаписейДляОбмена)
	
	СтруктураРегистрыНакопления = Новый Структура;
	
	Возврат СтруктураРегистрыНакопления;
	
КонецФункции

Процедура ДобавитьРегистрШтрихкоды(СтруктураРегистрыСведений, СтрукрутаСправочников, КоличесвтоЗаписейДляОбмена)
	
	Если НЕ СтрукрутаСправочников.Номенклатура.Количество() Тогда 
		СтруктураРегистрыСведений.Вставить("Штрихкоды", Новый ТаблицаЗначений);
		Возврат;
	КонецЕсли;
	
	
	Запрос = Новый Запрос;	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПРЕДСТАВЛЕНИЕ(Штрихкоды.Штрихкод) КАК Штрихкод,
	               |	Штрихкоды.Владелец,
	               |	Штрихкоды.ЕдиницаИзмерения,
	               |	Штрихкоды.ХарактеристикаНоменклатуры
	               |ИЗ
	               |	РегистрСведений.Штрихкоды КАК Штрихкоды
	               |ГДЕ
	               |	Штрихкоды.Владелец В(&МассивТоваров)";
	
	Запрос.УстановитьПараметр("МассивТоваров", СтрукрутаСправочников.Номенклатура.ВыгрузитьКолонку("Ссылка"));
	
	ТзШтрихкоды = Запрос.Выполнить().Выгрузить();
	КоличесвтоЗаписейДляОбмена = КоличесвтоЗаписейДляОбмена + ТзШтрихкоды.Количество();	
	
	ТзШтрихкоды.Колонки.Добавить("УИДВладелец");
	ТзШтрихкоды.Колонки.Добавить("УИДЕдиницаИзмерения");
	ТзШтрихкоды.Колонки.Добавить("УИДХарактеристикаНоменклатуры");
	Для Каждого Строка Из ТзШтрихкоды Цикл
		Строка.УИДВладелец = Строка.Владелец.УникальныйИдентификатор();
		Строка.УИДЕдиницаИзмерения = Строка.ЕдиницаИзмерения.УникальныйИдентификатор();
		Строка.УИДХарактеристикаНоменклатуры = Строка.ХарактеристикаНоменклатуры.УникальныйИдентификатор();
	КонецЦикла;
	
	СтруктураРегистрыСведений.Вставить("Штрихкоды", ТзШтрихкоды);
	
КонецПроцедуры

Процедура ДобавитьРегистрКатегорииОбъектов(СтруктураРегистрыСведений,Справочники,КоличесвтоЗаписейДляОбмена) //intrata_wald_08092021
	
	Если НЕ Справочники.Номенклатура.Количество() Тогда 
		СтруктураРегистрыСведений.Вставить("КатегорииОбъектов", Новый ТаблицаЗначений);
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;	
	Запрос.Текст = "ВЫБРАТЬ
	               |	КатегорииОбъектов.Объект,
	               |	КатегорииОбъектов.Категория
	               |ИЗ
	               |	РегистрСведений.КатегорииОбъектов КАК КатегорииОбъектов
	               |ГДЕ
	               |	КатегорииОбъектов.Объект В(&МассивТоваров)";
	
	Запрос.УстановитьПараметр("МассивТоваров", Справочники.Номенклатура.ВыгрузитьКолонку("Ссылка"));
	
	ТзКатегорииОбъектов = Запрос.Выполнить().Выгрузить();
	КоличесвтоЗаписейДляОбмена = КоличесвтоЗаписейДляОбмена + ТзКатегорииОбъектов.Количество();	
	
	ТзКатегорииОбъектов.Колонки.Добавить("УИДОбъект");
	ТзКатегорииОбъектов.Колонки.Добавить("УИДКатегория");
	Для Каждого Строка Из ТзКатегорииОбъектов Цикл
		Строка.УИДОбъект = Строка.Объект.УникальныйИдентификатор();
		Строка.УИДКатегория = Строка.Категория.УникальныйИдентификатор();
	КонецЦикла;
	
	СтруктураРегистрыСведений.Вставить("КатегорииОбъектов", ТзКатегорииОбъектов);
	
КонецПроцедуры


Процедура ДобавитьРегистрИсторияРаботыСКлиентом(СтруктураРегистрыСведений,Справочники,КоличесвтоЗаписейДляОбмена, ТорговыйАгент) 
	
	Если НЕ Справочники.Контрагенты.Количество() Тогда 
		СтруктураРегистрыСведений.Вставить("ИсторияРаботыСКлиентом", Новый ТаблицаЗначений);
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ИсторияРаботыСКлиентом.Период,
	               |	ИсторияРаботыСКлиентом.Клиент,
	               |	ИсторияРаботыСКлиентом.Запись,
	               |	ИсторияРаботыСКлиентом.УИД_Записи,
	               |	ИсторияРаботыСКлиентом.АвтоматичнийЗаписБезВзаємодіїЗКлієнтом
	               |ИЗ
	               |	РегистрСведений.ИсторияРаботыСКлиентом КАК ИсторияРаботыСКлиентом
	               |ГДЕ
	               |	ИсторияРаботыСКлиентом.Клиент.ТорговыйАгент = &ТорговыйАгент
				   |	И ИсторияРаботыСКлиентом.Клиент В (&Контрагенты)";
	
	Запрос.УстановитьПараметр("ТорговыйАгент", ТорговыйАгент);
	Запрос.УстановитьПараметр("Контрагенты", Справочники.Контрагенты.ВыгрузитьКолонку("Контрагент"));
	
	ТзИстории = Запрос.Выполнить().Выгрузить();
	КоличесвтоЗаписейДляОбмена = КоличесвтоЗаписейДляОбмена + ТзИстории.Количество();	
	
	ТзИстории.Колонки.Добавить("УИДКлиент");
	Для Каждого Строка Из ТзИстории Цикл
		Строка.УИДКлиент = Строка.Клиент.УникальныйИдентификатор();
	КонецЦикла;
	
	СтруктураРегистрыСведений.Вставить("ИсторияРаботыСКлиентом", ТзИстории);
	
КонецПроцедуры


Процедура ДобавитьРегистрЦеныНоменклатуры(СтруктураРегистрыСведений,МасСправочники,КоличесвтоЗаписейДляОбмена)
	Если НЕ МасСправочники.Номенклатура.Количество() Тогда 
		СтруктураРегистрыСведений.Вставить("ЦеныНоменклатуры",  Новый ТаблицаЗначений);
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЦеныНоменклатурыСрезПоследних.Цена,
	               |	ЦеныНоменклатурыСрезПоследних.ЕдиницаИзмерения,
	               |	ЦеныНоменклатурыСрезПоследних.ХарактеристикаНоменклатуры,
	               |	ЦеныНоменклатурыСрезПоследних.Номенклатура,
	               |	ЦеныНоменклатурыСрезПоследних.ТипЦен
	               |ИЗ
	               |	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
	               |			,
	               |			Номенклатура В (&МассивТоваров)
	               |				И ХарактеристикаНоменклатуры В (&МассивХарактеристик)
	               |				И ТипЦен В (&МассивТиповЦен)) КАК ЦеныНоменклатурыСрезПоследних";
	
	МассивХарактеристик = МасСправочники.ХарактеристикиНоменклатуры.ВыгрузитьКолонку("Ссылка");
	МассивХарактеристик.Добавить(Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка());
	
	Запрос.УстановитьПараметр("МассивТоваров", МасСправочники.Номенклатура.ВыгрузитьКолонку("Ссылка"));
	Запрос.УстановитьПараметр("МассивХарактеристик", МассивХарактеристик);
	Запрос.УстановитьПараметр("МассивТиповЦен", МасСправочники.ТипыЦенНоменклатуры.ВыгрузитьКолонку("Ссылка"));
	
	ТзЦенНоменклатуры = Запрос.Выполнить().Выгрузить();
	
	ОбзорЦен = ТзЦенНоменклатуры.Скопировать();
	Для Каждого Строка Из МассивХарактеристик Цикл
		Если ОбзорЦен.Найти(Строка) = Неопределено Тогда 
			ТекНоменклатура = ОбзорЦен.Найти(Строка.Владелец);
			Если ТекНоменклатура <> Неопределено Тогда
				НовСтр = ТзЦенНоменклатуры.Добавить();
				ЗаполнитьЗначенияСвойств(НовСтр,ТекНоменклатура);
				НовСтр.ХарактеристикаНоменклатуры = Строка;
			КонецЕсли;
			
		КонецЕсли; 
	КонецЦикла;
	
	КоличесвтоЗаписейДляОбмена = КоличесвтоЗаписейДляОбмена + ТзЦенНоменклатуры.Количество();	
	
	ТзЦенНоменклатуры.Колонки.Добавить("УИДНоменклатура");
	ТзЦенНоменклатуры.Колонки.Добавить("УИДТипЦен");
	ТзЦенНоменклатуры.Колонки.Добавить("УИДЕдиницаИзмерения");
	ТзЦенНоменклатуры.Колонки.Добавить("УИДХарактеристикаНоменклатуры");
	Для Каждого Строка Из ТзЦенНоменклатуры Цикл
		Строка.УИДНоменклатура = Строка.Номенклатура.УникальныйИдентификатор();
		Строка.УИДТипЦен = Строка.ТипЦен.УникальныйИдентификатор();
		Строка.УИДЕдиницаИзмерения = Строка.ЕдиницаИзмерения.УникальныйИдентификатор();
		Строка.УИДХарактеристикаНоменклатуры = Строка.ХарактеристикаНоменклатуры.УникальныйИдентификатор();
	КонецЦикла;
	
	СтруктураРегистрыСведений.Вставить("ЦеныНоменклатуры", ТзЦенНоменклатуры);
	
КонецПроцедуры

Процедура ДобавитьРегистрНормыЗапасов(СтруктураРегистрыСведений,МасСправочники,Склад,КоличесвтоЗаписейДляОбмена)
	Если НЕ МасСправочники.Номенклатура.Количество() Тогда 
		СтруктураРегистрыСведений.Вставить("НормыЗапасов",  Новый ТаблицаЗначений);
		Возврат;
	КонецЕсли;

	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	НормыЗапасов.ЕдиницаИзмерения,
	               |	НормыЗапасов.ХарактеристикаНоменклатуры,
	               |	НормыЗапасов.Номенклатура,
	               |	НормыЗапасов.Количество,
	               |	НормыЗапасов.Дата
	               |ИЗ
	               |	РегистрСведений.НормыЗапасов КАК НормыЗапасов
	               |ГДЕ
	               |	НормыЗапасов.Номенклатура В(&МассивТоваров)
	               |	И НормыЗапасов.ХарактеристикаНоменклатуры В(&МассивХарактеристик)
	               |	И НормыЗапасов.Склад = &Склад";
	
	МассивХарактеристик = МасСправочники.ХарактеристикиНоменклатуры.ВыгрузитьКолонку("Ссылка");
	МассивХарактеристик.Добавить(Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка());
	
	Запрос.УстановитьПараметр("МассивТоваров", МасСправочники.Номенклатура.ВыгрузитьКолонку("Ссылка"));
	Запрос.УстановитьПараметр("МассивХарактеристик", МассивХарактеристик);
	Запрос.УстановитьПараметр("Склад", Склад);
	
	ТзНормЗапасов = Запрос.Выполнить().Выгрузить();
	КоличесвтоЗаписейДляОбмена = КоличесвтоЗаписейДляОбмена + ТзНормЗапасов.Количество();	
	СтруктураРегистрыСведений.Вставить("НормыЗапасов", ТзНормЗапасов);
	
КонецПроцедуры

Процедура ДобавитьОтгруженныеЗаказы(СтруктураРегистрыСведений,ПродавецПартнера,КоличесвтоЗаписейДляОбмена)
	
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЗаказПокупателяДок.Ссылка
	               |ИЗ
	               |	Документ.ЗаказПокупателя КАК ЗаказПокупателяДок
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ЗаказыПокупателей.Остатки КАК ЗаказыПокупателейОстатки
	               |		ПО ЗаказыПокупателейОстатки.ЗаказПокупателя = ЗаказПокупателяДок.Ссылка
	               |			И ЗаказыПокупателейОстатки.СуммаУпрОстаток <> ЗаказПокупателяДок.СуммаДокумента
	               |ГДЕ
	               |	ЗаказПокупателяДок.ТорговийАгент = &ТорговийАгент
	               |	И ЗаказПокупателяДок.Дата > &ДатаНач";
	
	Запрос.УстановитьПараметр("ТорговийАгент", ПродавецПартнера);
	Запрос.УстановитьПараметр("ДатаНач", ТекущаяДата() - 345600);
	ТЗДок = Запрос.Выполнить().Выгрузить();
//	ТзШтрихкоды = Запрос.Выполнить().Выгрузить();
КоличесвтоЗаписейДляОбмена = КоличесвтоЗаписейДляОбмена + ТЗДок.Количество();	

	ТЗДок.Колонки.Добавить("УИДСсылка");
//	ТзШтрихкоды.Колонки.Добавить("УИДЕдиницаИзмерения");
//	ТзШтрихкоды.Колонки.Добавить("УИДХарактеристикаНоменклатуры");
	Для Каждого Строка Из ТЗДок Цикл
		Строка.УИДСсылка = Строка.Ссылка.УникальныйИдентификатор();
	КонецЦикла;

	СтруктураРегистрыСведений.Вставить("ОтгруженныеЗаказы", ТЗДок);
	

КонецПроцедуры

Функция  ЗаписатиКурсВалют(ПарольВхода, Данные) Экспорт
	Ответ = Новый Структура("Результат, Ошибка");
	ТорговийАгент = ОбменАндроид.ПолучитьПродавцаПоКодуПартнера(ПарольВхода);
	Если ТорговийАгент = Неопределено Или Не ТорговийАгент.ПравоМінятиКурсиВалют Тогда 
		Ответ.Вставить("Результат", Ложь);
		Ответ.Вставить("Ошибка", "Не має прав доступу!");
		Перейти ~Возврат; 
	КонецЕсли;

	СтруктураДанных = Десериализовать(Данные);

	Запись = РегистрыСведений.КурсыВалют.СоздатьМенеджерЗаписи();
	Запись.Валюта = Справочники.Валюты.НайтиПоКоду("978");
	Запись.Курс = СтруктураДанных.В978;
	Запись.Кратность = 1;
	Запись.Период = ТекущаяДата();
	Запись.Записать(Истина);
	
	Запись = РегистрыСведений.КурсыВалют.СоздатьМенеджерЗаписи();
	Запись.Валюта = Справочники.Валюты.НайтиПоКоду("840");
	Запись.Курс = СтруктураДанных.В840;
	Запись.Кратность = 1;
	Запись.Период = ТекущаяДата();
	Запись.Записать(Истина);
	
	Ответ.Вставить("Результат", Истина);
	~Возврат:
	Возврат Сериализовать(Ответ);
	
КонецФункции


#КонецОбласти

#КонецОбласти


#Область ОБРАБОТКА_ДАННЫХ_ИЗ_СМАРТФОНА

Функция ОбработатьПакетДанных(ПарольВхода, Данные) Экспорт
	Перем ИнфоМаршруты;
	ТаблицаИД = Новый ТаблицаЗначений;
	ТаблицаИД.Колонки.Добавить("ИД");
		
	МассивОшибок = Новый Массив;
	Попытка
		
		Склад = ОбменАндроид.ПолучитьСкладПартнера(ПарольВхода);
		Продавец = ОбменАндроид.ПолучитьПродавцаПоКодуПартнера(ПарольВхода);
		//ЗаписьЖурналаРегистрации("ДанніЗаказа",УровеньЖурналаРегистрации.Информация,,,Десериализовать(Данные);
		СтруктураПараметров = Десериализовать(Данные);
		//ЗаписьЖурналаРегистрации("АНДРОИД_ТЕСТ",,,,Десериализовать(Данные));
		Если СтруктураПараметров.Свойство("Контрагенты") Тогда
			ОбновитьКонтрагентов(СтруктураПараметров.Контрагенты,Склад,ТаблицаИД, Продавец, МассивОшибок);		
		КонецЕсли;
		Если СтруктураПараметров.Свойство("Заказы") Тогда
			
			СоздатьВнутренниеЗаказы(СтруктураПараметров.Заказы,Склад,Продавец,ТаблицаИД);
		КонецЕсли;
		Если СтруктураПараметров.Свойство("МаршрутныеЛисты") Тогда  //Спочатку створюються маршрутники і товари в них. Потім загружаються документи а потім вкінці ці документи підгружаються в маршрутник
			Попытка
				СоздатьМаршрутныеЛистыТовары(СтруктураПараметров.МаршрутныеЛисты, Продавец, ТаблицаИД, ИнфоМаршруты);
			Исключение
				//ЗаписьЖурналаРегистрации("ОБМЕН_МАРШРУТНИКИ", УровеньЖурналаРегистрации.Ошибка, ,,ОписаниеОшибки());
				МассивОшибок.Добавить(ОписаниеОшибки());
			КонецПопытки;		
		КонецЕсли;
		
		Если СтруктураПараметров.Свойство("Реализации") Тогда 
			Попытка
				СоздатьРеализацииТоваровУслуг(СтруктураПараметров.Реализации,Склад,Продавец, ТаблицаИД);
			Исключение
				//ЗаписьЖурналаРегистрации("ОБМЕН_РЕАЛИЗАЦИИ", УровеньЖурналаРегистрации.Ошибка, ,,ОписаниеОшибки());
				МассивОшибок.Добавить(ОписаниеОшибки());
			КонецПопытки;
		КонецЕсли;
		
		Если СтруктураПараметров.Свойство("Презентации") Тогда 
			Попытка
				СоздатьПрезентацию(СтруктураПараметров.Презентации,Склад,Продавец, ТаблицаИД);
			Исключение
				//ЗаписьЖурналаРегистрации("ОБМЕН_ПРЕЗЕНТАЦИИ", УровеньЖурналаРегистрации.Ошибка, ,,ОписаниеОшибки());
				МассивОшибок.Добавить(ОписаниеОшибки());
			КонецПопытки;
		КонецЕсли;
		
		
		
		Если СтруктураПараметров.Свойство("ПКО") Тогда 
			Попытка
				СоздатьПКО(СтруктураПараметров.ПКО, ТаблицаИД, МассивОшибок);
			Исключение
				//ЗаписьЖурналаРегистрации("ОБМЕН_ПКО", УровеньЖурналаРегистрации.Ошибка, ,,ОписаниеОшибки());
				МассивОшибок.Добавить(ОписаниеОшибки());
			КонецПопытки;					
		КонецЕсли;
		Если СтруктураПараметров.Свойство("МаршрутныеЛисты") Тогда 
			Попытка
				СоздатьМаршрутныеЛистыДокументы(СтруктураПараметров.МаршрутныеЛисты, Продавец, ТаблицаИД);
			Исключение
				//ЗаписьЖурналаРегистрации("ОБМЕН_МАРШРУТНИКИ", УровеньЖурналаРегистрации.Ошибка, ,,ОписаниеОшибки());
				МассивОшибок.Добавить(ОписаниеОшибки());
			КонецПопытки;		
		КонецЕсли;
		Если СтруктураПараметров.Свойство("Напоминания") Тогда 
			СоздатьНапоминания(СтруктураПараметров.Напоминания, Продавец, ТаблицаИД);
		КонецЕсли;
		
	Исключение
		Возврат Сериализовать(ОписаниеОшибки());
	КонецПопытки;
	
	 Ответ = Новый Структура("ТаблицаИД, МассивОшибок", ТаблицаИД, МассивОшибок);
	 Если ЗначениеЗаполнено(ИнфоМаршруты) Тогда 
		 Ответ.Вставить("ИнфоМаршруты", ИнфоМаршруты);
	 КонецЕсли;
	 
	Возврат Сериализовать(Ответ);
	
КонецФункции


Процедура СоздатьВозвраты(ТаблицаВозвратов,Склад, ТаблицаИД,Продавец)
	МассивДокументов = Новый Массив;         
	ИмяДок = "ВозвратТоваровОтПокупателя";
	ТекущаяСсылка = "";
	
	Для Каждого СтрокаДанныеЭлемента Из ТаблицаВозвратов Цикл
		
		
		/////
		//Для Каждого СтрокаДанныеЭлемента Из ЗначенияДокумента Цикл
		
		
		НовыйОбъект = Документы[ИмяДок].ПолучитьСсылку(СтрокаДанныеЭлемента.Ссылка).ПолучитьОбъект();
		ДобавитьДок = Ложь;

		Если НовыйОбъект = Неопределено Тогда 
			НовыйОбъект = Документы[ИмяДок].СоздатьДокумент();	
			НовыйОбъект.УстановитьСсылкуНового(Документы[ИмяДок].ПолучитьСсылку(СтрокаДанныеЭлемента.Ссылка));
			ДобавитьДок = Истина;
		Иначе
			НовыйОбъект.мОбменАндроид = Истина;
			НовыйОбъект.Записать(РежимЗаписиДокумента.ОтменаПроведения);
		КонецЕсли;
		
		Если ТекущаяСсылка <> СтрокаДанныеЭлемента.Ссылка Тогда 
			НовыйОбъект.Товары.Очистить();
			ТекущаяСсылка = СтрокаДанныеЭлемента.Ссылка;
			Попытка
				Если ЗначениеЗаполнено(СтрокаДанныеЭлемента.ИД) Тогда 
					НовСтр = ТаблицаИД.Добавить();
					НовСтр.ИД = СтрокаДанныеЭлемента.ИД;
				КонецЕсли;
			Исключение
			КонецПопытки;
			ДобавитьДок = Истина;
		КонецЕсли;
		
		СтрокаТоваров = НовыйОбъект.Товары.Добавить();
		Если НЕ ЗначениеЗаполнено(НовыйОбъект.Ссылка) Тогда 
			НовыйОбъект.Дата = СтрокаДанныеЭлемента.Дата;
			//НовыйОбъект.УстановитьНовыйНомер();
			//НовыйОбъект.Номер = Документы.РеализацияТоваровУслуг.Уста;
			НовыйОбъект.Организация = Справочники.Организации.НайтиПоКоду("000000001");
			НовыйОбъект.ОтражатьВУправленческомУчете = Истина;
			НовыйОбъект.СкладОрдер = Склад;
			НовыйОбъект.Контрагент = Склад.Партнер;
			НовыйОбъект.Партнер = Склад.Партнер;
			НовыйОбъект.ДоговорКонтрагента = Склад.Партнер.ОсновнойДоговорКонтрагента;
			//НовыйОбъект.ВидПередачи = Перечисления.ВидыПередачиТоваров.СоСклада;
			НовыйОбъект.ВалютаДокумента = Склад.Партнер.ОсновнойДоговорКонтрагента.ВалютаВзаиморасчетов;
			НовыйОбъект.КонечныйПокупатель = Справочники.Контрагенты.НайтиПоКоду("000000196");
			НовыйОбъект.Комментарий = "Возврат из Андроид";
			НовыйОбъект.ТипЦен = Склад.Партнер.ОсновнойДоговорКонтрагента.ТипЦен;
			НовыйОбъект.ВидОперации = Перечисления.ВидыОперацийВозвратТоваровОтПокупателя.ПродажаКомиссия;
			НовыйОбъект.ВидПоступления = Перечисления.ВидыПоступленияТоваров.НаСклад;
//			НовыйОбъект.ОрганизацияДляПечати = НовыйОбъект.Организация;
			НовыйОбъект.Ответственный = Склад.НастройкаНаАндроид.Пользователь;
			СпособЗаполненияЦен = Перечисления.СпособыЗаполненияЦен.ПоЦенамНоменклатуры;
			СтруктураРеквизитовДокумента = Ценообразование.ПолучитьСтруктуруРеквизитовДокументаДляЦенообразования(НовыйОбъект);
			ЗаполнениеДокументов.ПриИзмененииЗначенияДоговора(НовыйОбъект, Справочники.Валюты.ПустаяСсылка(), Константы.ВалютаРегламентированногоУчета.Получить(), СпособЗаполненияЦен, СтруктураРеквизитовДокумента, "Продажа", "Товары", Справочники.ДоговорыКонтрагентов.ПустаяСсылка());
			
			
		КонецЕсли;
		ЗаполнитьЗначенияСвойств(СтрокаТоваров,СтрокаДанныеЭлемента);
		СтрокаТоваров.Номенклатура = Справочники.Номенклатура.ПолучитьСсылку(СтрокаДанныеЭлемента.Номенклатура);
		СтрокаТоваров.ХарактеристикаНоменклатуры = Справочники.ХарактеристикиНоменклатуры.ПолучитьСсылку(СтрокаДанныеЭлемента.ХарактеристикаНоменклатуры);
		СтрокаТоваров.ЕдиницаИзмерения = Справочники.ЕдиницыИзмерения.ПолучитьСсылку(СтрокаДанныеЭлемента.ЕдиницаИзмерения);
		СтрокаТоваров.Цена = СтрокаДанныеЭлемента.ЦенаПартнера;
		СтрокаТоваров.ЦенаКонечногоПокупателя = СтрокаДанныеЭлемента.Цена;
		СтрокаТоваров.СуммаКонечногоПокупателя = СтрокаТоваров.ЦенаКонечногоПокупателя * СтрокаТоваров.Количество;
		СтрокаТоваров.Качество = Справочники.Качество.Новый;
		СтрокаТоваров.Коэффициент = СтрокаТоваров.ЕдиницаИзмерения.Коэффициент;
		
		ОбработкаТабличныхЧастей.РассчитатьСуммуТабЧасти(СтрокаТоваров, НовыйОбъект);
		ОбработкаТабличныхЧастей.РассчитатьСуммуНДСТабЧасти(СтрокаТоваров, НовыйОбъект);
		УправлениеЗапасами.ДобавитьСоставНабора(СтрокаТоваров, НовыйОбъект);
		//СтрокаТоваров.МестоХранения = Общий.ЯчейкаНазначена(СтрокаТоваров.Номенклатура,Склад);	
		//Общий.ЗаписатьЯчейкиНоменклатуры(СтрокаТоваров.Номенклатура,Склад, НовыйОбъект.МестаХранения);
		
		
		НовыйОбъект.мОбменАндроид = Истина;
		
		НовыйОбъект.Записать();
		Если ДобавитьДок Тогда 
			МассивДокументов.Добавить(НовыйОбъект.Ссылка);
		КонецЕсли;
		//КонецЦикла;
		
		/////
		
		
	КонецЦикла;	
	
	Для Каждого ДокСсылка Из МассивДокументов Цикл
		ДокОб = ДокСсылка.ПолучитьОбъект();
		Попытка
			ДокОб.мОбменАндроид = Продавец;
			ДокОб.Записать(РежимЗаписиДокумента.Проведение,РежимПроведенияДокумента.Неоперативный);
		Исключение
			//ЗаписьЖурналаРегистрации("ОБМЕН_АНДРОИД", УровеньЖурналаРегистрации.Ошибка,,,ОписаниеОшибки());

		КонецПопытки;
	КонецЦикла;
	
КонецПроцедуры

Процедура СоздатьВнутренниеЗаказы(ТаблицаВозвратов,Склад,Продавец, ТаблицаИД)
	
	МассивДокументов = Новый Массив;         
	ИмяДок = "ЗаказПокупателя";
	ТекущаяСсылка = "";
	ТорговыйАгент = Продавец;
	Попытка
		ТаблицаВозвратов.Сортировать("Ссылка");
	Исключение
	КонецПопытки;
	ТекИД = Неопределено;
	
	Для Каждого СтрокаДанныеЭлемента Из ТаблицаВозвратов Цикл
				
		НовыйОбъект = Документы[ИмяДок].ПолучитьСсылку(СтрокаДанныеЭлемента.Ссылка).ПолучитьОбъект();
		Попытка
			//
		Исключение
		КонецПопытки;
		ДобавитьДок = Ложь;
		
		Если НовыйОбъект = Неопределено Тогда 
			Если СтрокаДанныеЭлемента.ПометкаУдаления  Тогда 
				Продолжить;
			КонецЕсли;

			НовыйОбъект = Документы[ИмяДок].СоздатьДокумент();	
			НовыйОбъект.УстановитьСсылкуНового(Документы[ИмяДок].ПолучитьСсылку(СтрокаДанныеЭлемента.Ссылка));
			НовыйОбъект.СтатусЗамовлення = Справочники.СтатусиЗамовлень.Новий;
			ДобавитьДок = Истина;
		Иначе			
			НовыйОбъект.Записать(РежимЗаписиДокумента.ОтменаПроведения);
		КонецЕсли;
		
		////////////////////////////////////////////////////////////////////
		Если ТекущаяСсылка <> СтрокаДанныеЭлемента.Ссылка Тогда 
			
			НовыйОбъект.Товары.Очистить();
			ТекущаяСсылка = СтрокаДанныеЭлемента.Ссылка;
			Попытка
				Если ЗначениеЗаполнено(ТекИД) Тогда 
					НовСтр = ТаблицаИД.Добавить();
					НовСтр.ИД = ТекИД; 
				КонецЕсли;
				ТекИД = СтрокаДанныеЭлемента.ИД;
			Исключение
			КонецПопытки;
			ДобавитьДок = Истина;
		КонецЕсли;
		
		///////////////////////////////////////////////////////////////////
		
		НовыйОбъект.Комментарий = "" + СтрокаДанныеЭлемента.Комментарий;
		СтрокаТоваров = НовыйОбъект.Товары.Добавить();
		
		Если НЕ ЗначениеЗаполнено(НовыйОбъект.Ссылка) Тогда 
			НовыйОбъект.Дата = ТекущаяДата();
			//НовыйОбъект.УстановитьНовыйНомер();
			НовыйОбъект.Организация = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(ПараметрыСеанса.ТекущийПользователь,"ОсновнаяОрганизация");								
			
			//Попытка 
			//	пОплата =  ИмяЗначенияПеречисленияПоСинониму("СтатусОплати",СтрокаДанныеЭлемента.Оплата);
			//	пДоставка = ИмяЗначенияПеречисленияПоСинониму("НаявністьДоставки",СтрокаДанныеЭлемента.Доставка);
			//	Если не пОплата = Неопределено тогда
			//		НовыйОбъект.Оплата = Перечисления.СтатусОплати[пОплата];
			//	КонецЕсли;
			//	Если не пДоставка = Неопределено Тогда 
			//		НовыйОбъект.Доставка = Перечисления.НаявністьДоставки[пДоставка]
			//	КонецЕсли;
			//	
			//Исключение
			//КонецПопытки;
			
			
			
			НовыйОбъект.СкладГруппа = Склад;
			НовыйОбъект.Наложка = СтрокаДанныеЭлемента.Наложка;
			НовыйОбъект.ДатаВходящегоДокументаЭлектронногоОбмена = ТекущаяДата();
			НовыйОбъект.ДатаОтгрузки = ТекущаяДата() + 86400;
			НовыйОбъект.ДатаОплаты = НовыйОбъект.ДатаОтгрузки;
			НовыйОбъект.Подразделение = Склад.Подразделение;
			НовыйОбъект.ТипЦен = Справочники.ТипыЦенНоменклатуры.ПолучитьСсылку(СтрокаДанныеЭлемента.ТипЦен);
			НовыйОбъект.Контрагент = Справочники.Контрагенты.ПолучитьСсылку(СтрокаДанныеЭлемента.Контрагент);
			//ЗаписьЖурналаРегистрации("АНДРОИД_ДОСТАВКА", УровеньЖурналаРегистрации.Информация,,,СтрокаДанныеЭлемента.Доставка);
			Если ЗначениеЗаполнено(СтрокаДанныеЭлемента.Доставка) Тогда 
				НовыйОбъект.Доставка = Перечисления.НаявністьДоставки[СтрокаДанныеЭлемента.Доставка];
			КонецЕсли;
						
			з = Новый Запрос;
			з.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
			          |	ДоговорыКонтрагентов.Ссылка КАК Ссылка
			          |ИЗ
			          |	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
			          |ГДЕ
			          |	ДоговорыКонтрагентов.Владелец = &Владелец
			          |	И ДоговорыКонтрагентов.ВидДоговора = &ВидДоговора
			          |	И ДоговорыКонтрагентов.Организация = &Организация
					  //|	И ДоговорыКонтрагентов.ВедениеВзаиморасчетов = &ВедениеВзаиморасчетов
			          |";
			з.УстановитьПараметр("ВидДоговора",Перечисления.ВидыДоговоровКонтрагентов.СПокупателем);
			з.УстановитьПараметр("Владелец",НовыйОбъект.Контрагент);
			з.УстановитьПараметр("Организация",НовыйОбъект.Организация); 
			//з.УстановитьПараметр("ВедениеВзаиморасчетов",Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоЗаказам); 
			Выборка = з.Выполнить().Выбрать();
			Если Выборка.Следующий() Тогда 
				НовыйОбъект.ДоговорКонтрагента = Выборка.Ссылка;
			Иначе
				//ЗаписьЖурналаРегистрации("У контрагента "+НовыйОбъект.Контрагент+ " " + СтрокаДанныеЭлемента.Дата + " - " + СтрокаДанныеЭлемента.Номер + " " +  " в заказе нет договора с покупателем.");
				ВызватьИсключение "У контрагента "+НовыйОбъект.Контрагент+ " "  + СтрокаДанныеЭлемента.Дата + " - " + СтрокаДанныеЭлемента.Номер + " " +  " в заказе нет договора с покупателем.";
			КонецЕсли;
			
			НовыйОбъект.ВалютаДокумента = Константы.ВалютаУправленческогоУчета.Получить();
			НовыйОбъект.КратностьВзаиморасчетов = 1;
		КонецЕсли;
		
		Агент = НовыйОбъект.Контрагент.ТорговыйАгент; 
		НовыйОбъект.ТорговийАгент = ?(ЗначениеЗаполнено(Агент), Агент, Продавец);

		//Агент = НовыйОбъект.Контрагент.ТорговыйАгент; 
		//НовыйОбъект.ТорговийАгент = ?(СтрокаДанныеЭлемента.ПризначитиПродажТорговомуКонтрагента, Агент, Продавец);
		//НовыйОбъект.ТорговийАгент = Продавец;
		
		НовыйОбъект.ПометкаУдаления = СтрокаДанныеЭлемента.ПометкаУдаления;
		
		ЗаполнитьЗначенияСвойств(СтрокаТоваров,СтрокаДанныеЭлемента);
		СтрокаТоваров.Номенклатура = Справочники.Номенклатура.ПолучитьСсылку(СтрокаДанныеЭлемента.Номенклатура);
		СтрокаТоваров.ХарактеристикаНоменклатуры = Справочники.ХарактеристикиНоменклатуры.ПолучитьСсылку(СтрокаДанныеЭлемента.ХарактеристикаНоменклатуры);
		Попытка
			СтрокаТоваров.ЕдиницаИзмерения = СтрокаТоваров.Номенклатура.ЕдиницаХраненияОстатков;
		Исключение
		КонецПопытки;
		СтрокаТоваров.Сумма = СтрокаТоваров.Цена * СтрокаТоваров.Количество;
		СтрокаТоваров.Коэффициент = СтрокаТоваров.ЕдиницаИзмерения.Коэффициент;
		
		Попытка
			НовыйОбъект.Записать();
			
			Если НовыйОбъект.ТорговийАгент <> Продавец Тогда 
				НаборЗаписей = РегистрыСведений.РегистрацияОбмена.СоздатьНаборЗаписей();
				НаборЗаписей.Отбор.Продавец.Установить(НовыйОбъект.ТорговийАгент);
				НаборЗаписей.Отбор.Объект.Установить(НовыйОбъект.Ссылка);
				Запись = НаборЗаписей.Добавить();
				Запись.Продавец = НовыйОбъект.ТорговийАгент;
				Запись.Объект 	= НовыйОбъект.Ссылка;
				Запись.ИД		= Новый УникальныйИдентификатор;
				НаборЗаписей.Записать();
			КонецЕсли;
			

		Исключение
			ЗаписьЖурналаРегистрации("ОшибкаОбмена",УровеньЖурналаРегистрации.Ошибка,,"",ОписаниеОшибки());
			Продолжить;
		КонецПопытки;
		
		Если ДобавитьДок Тогда 
			МассивДокументов.Добавить(НовыйОбъект.Ссылка);
		КонецЕсли;
				
	КонецЦикла;	
	
	Если ЗначениеЗаполнено(ТекИД) Тогда 
		НовСтр = ТаблицаИД.Добавить();
		НовСтр.ИД = ТекИД;
	КонецЕсли;
	
	Для Каждого ДокСсылка Из МассивДокументов Цикл
		Попытка
			ДокОб = ДокСсылка.ПолучитьОбъект();
		Исключение
			Продолжить;
		КонецПопытки;
		Если ДокОб.ПометкаУдаления Тогда 
			Продолжить;
		КонецЕсли;
		
		Попытка
			ДокОб.Записать(РежимЗаписиДокумента.Проведение,РежимПроведенияДокумента.Неоперативный);
		Исключение
		КонецПопытки;
	КонецЦикла;
	
КонецПроцедуры

Процедура СоздатьРеализацииТоваровУслуг(ТаблицаВозвратов,Склад,Продавец, ТаблицаИД)
	
	МассивДокументов = Новый Массив;         
	ИмяДок = "РеализацияТоваровУслуг";
	ТекущаяСсылка = "";
	ТорговыйАгент = Продавец;
	Попытка
		ТаблицаВозвратов.Сортировать("Ссылка");
	Исключение
	КонецПопытки;
	ТекИД = Неопределено;
	
	Для Каждого СтрокаДанныеЭлемента Из ТаблицаВозвратов Цикл
		///////////////////////
		//ЗаписьЖурналаРегистрации("ЛОГ_РЕАЛИЗАЦИЯ",УровеньЖурналаРегистрации.Информация,,"",СокрЛП(Справочники.Контрагенты.ПолучитьСсылку(СтрокаДанныеЭлемента.Контрагент)) + СокрЛП(СтрокаДанныеЭлемента.Дата));
		
		НовыйОбъект = Документы[ИмяДок].ПолучитьСсылку(СтрокаДанныеЭлемента.Ссылка).ПолучитьОбъект();
		ТекущийЗаказ = Документы.ЗаказПокупателя.ПолучитьСсылку(СтрокаДанныеЭлемента.Сделка);
		ТекущийКонтрагент = Справочники.Контрагенты.ПолучитьСсылку(СтрокаДанныеЭлемента.Контрагент);
		
		
		Если НовыйОбъект = Неопределено ИЛИ НЕ ЗначениеЗаполнено(НовыйОбъект.Ссылка) Тогда		
			Если ЗначениеЗаполнено(ТекущийЗаказ) Тогда // ШукаємРеалізаціюПоЗаказу 
				ЗапросРеализации = Новый Запрос;
				ЗапросРеализации.Текст = 
				"ВЫБРАТЬ
				|	РеализацияТоваровУслуг.Ссылка
				|ИЗ
				|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
				|ГДЕ
				|	РеализацияТоваровУслуг.Сделка = &Сделка
				|	И НЕ РеализацияТоваровУслуг.ПометкаУдаления
				|	И РеализацияТоваровУслуг.Контрагент = &Контрагент
				|	И РеализацияТоваровУслуг.Дата > &ДатаДок";
				ЗапросРеализации.УстановитьПараметр("Сделка", ТекущийЗаказ);
				ЗапросРеализации.УстановитьПараметр("ДатаДок", ТекущаяДата() - (60*60*24 * 7));

				ЗапросРеализации.УстановитьПараметр("Контрагент", ТекущийКонтрагент);
				ВыборкаЗапросаРеализации = ЗапросРеализации.Выполнить().Выбрать();
				Если ВыборкаЗапросаРеализации.Следующий() И ЗначениеЗаполнено(ТекущийЗаказ) Тогда  // Чи була раніше створена реалізація
					
					
					Если ВозвратПоЗакритомуМаршрутнику(ВыборкаЗапросаРеализации.Ссылка.МаршрутныйЛист, СтрокаДанныеЭлемента.ИД, ТаблицаИД) Тогда 
						Продолжить;
					КонецЕсли;				
					
					НовыйОбъект = ВыборкаЗапросаРеализации.Ссылка.ПолучитьОбъект();
					НовыйОбъект.Записать(РежимЗаписиДокумента.ОтменаПроведения);		
				КонецЕсли; 
			КонецЕсли;
			/////////////////////////////
			
		КонецЕсли;		
		
		
		ДобавитьДок = Ложь;
		
		
		
		ТекМаршрутныйЛист 	= Документы.МаршрутныйЛист.ПолучитьСсылку(СтрокаДанныеЭлемента.МаршрутныйЛист);
		
		Если ВозвратПоЗакритомуМаршрутнику(ТекМаршрутныйЛист, СтрокаДанныеЭлемента.ИД, ТаблицаИД) Тогда 
			Продолжить;
		КонецЕсли;	
		
		Если НовыйОбъект = Неопределено ИЛИ НЕ ЗначениеЗаполнено(НовыйОбъект.Ссылка) Тогда   // Створюєм
			Если СтрокаДанныеЭлемента.ПометкаУдаления  Тогда 
				Продолжить;
			КонецЕсли;
			
			НовыйОбъект = Документы[ИмяДок].СоздатьДокумент();	
			НовыйОбъект.УстановитьСсылкуНового(Документы[ИмяДок].ПолучитьСсылку(СтрокаДанныеЭлемента.Ссылка));
			
			ДобавитьДок = Истина;
		Иначе			
			НовыйОбъект.Записать(РежимЗаписиДокумента.ОтменаПроведения);
		КонецЕсли;	
		
		
		//ЗаписьЖурналаРегистрации("ЛОГ_РЕАЛИЗАЦИЯ2",УровеньЖурналаРегистрации.Информация,,"",СокрЛП(НовыйОбъект.Ссылка));
		
		
		
		////////////////////////////////////////////////////////////////////  Новий документ
		Если ТекущаяСсылка <> СтрокаДанныеЭлемента.Ссылка Тогда 
			НовыйОбъект.Комментарий = НовыйОбъект.Комментарий + " Оновлено з додатку: " + СокрЛП(ТекущаяДата()) + " " + СтрокаДанныеЭлемента.Комментарий;
			НовыйОбъект.Наложка = СтрокаДанныеЭлемента.Наложка;
			НовыйОбъект.Товары.Очистить();
			ТекущаяСсылка = СтрокаДанныеЭлемента.Ссылка;
			Попытка
				Если ЗначениеЗаполнено(ТекИД) Тогда 
					НовСтр = ТаблицаИД.Добавить();
					НовСтр.ИД = ТекИД; 
				КонецЕсли;
				ТекИД = СтрокаДанныеЭлемента.ИД;
			Исключение
			КонецПопытки;
			ДобавитьДок = Истина;
			Если НЕ ЗначениеЗаполнено(НовыйОбъект.Ссылка) Тогда 
				НовыйОбъект.Дата = СтрокаДанныеЭлемента.Дата;
				//НовыйОбъект.УстановитьНовыйНомер();
			КонецЕсли;
			НовыйОбъект.Организация = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(ПараметрыСеанса.ТекущийПользователь,"ОсновнаяОрганизация");								
			
			Попытка 
				НовыйОбъект.Доставка = Перечисления.НаявністьДоставки[СтрокаДанныеЭлемента.Доставка];			
			Исключение
			КонецПопытки;
			
			//Попытка 
			//	пОплата =  ИмяЗначенияПеречисленияПоСинониму("СтатусОплати",СтрокаДанныеЭлемента.Оплата);
			//	пДоставка = ИмяЗначенияПеречисленияПоСинониму("НаявністьДоставки",СтрокаДанныеЭлемента.Доставка);
			//	Если не пОплата = Неопределено тогда
			//		НовыйОбъект.Оплата = Перечисления.СтатусОплати[пОплата];
			//	КонецЕсли;
			//	Если не пДоставка = Неопределено Тогда 
			//		НовыйОбъект.Доставка = Перечисления.НаявністьДоставки[пДоставка]
			//	КонецЕсли;
			//	
			//Исключение
			//КонецПопытки;
			
			//НовыйОбъект.ТорговийАгент = СтрокаДанныеЭлемента.ПризначитиПродажТорговомуКонтрагента;
			НовыйОбъект.Склад = Склад;
			//НовыйОбъект.ДатаВходящегоДокументаЭлектронногоОбмена = ТекущаяДата();
			//НовыйОбъект.ДатаОтгрузки = ТекущаяДата() + 86400;
			//НовыйОбъект.ДатаОплаты = НовыйОбъект.ДатаОтгрузки;
			//НовыйОбъект.Подразделение = Склад.Подразделение;
			НовыйОбъект.ТипЦен = Справочники.ТипыЦенНоменклатуры.ПолучитьСсылку(СтрокаДанныеЭлемента.ТипЦен);
			НовыйОбъект.Контрагент 		= ТекущийКонтрагент;
			
			//+-
			//НовыйОбъект.Сделка 			= ТекущийЗаказ;
			Если (НовыйОбъект.Доставка = Перечисления.НаявністьДоставки.Почта Или НовыйОбъект.Доставка = Перечисления.НаявністьДоставки.Самовывоз)
				  И ЗначениеЗаполнено(НовыйОбъект.Сделка) И Не ЗначениеЗаполнено(ТекущийЗаказ)  Тогда
				  //Пропускаемо бо реалызації встановили заказ раніше а в додатку його немає
			Иначе	  				  
				НовыйОбъект.Сделка 			= ТекущийЗаказ;
			КонецЕсли;	
			//+-
			
			Если СтрокаДанныеЭлемента.Неплановая ИЛИ НЕ ЗначениеЗаполнено(НовыйОбъект.Сделка) Тогда 
				НовыйОбъект.ДоговорКонтрагента = НовыйОбъект.Контрагент.ДоговорДляНеплановыхПродаж;	
			Иначе 
				НовыйОбъект.ДоговорКонтрагента = НовыйОбъект.Контрагент.ОсновнойДоговорКонтрагента;	
			КонецЕсли;	
			
			НовыйОбъект.МаршрутныйЛист 	= Документы.МаршрутныйЛист.ПолучитьСсылку(СтрокаДанныеЭлемента.МаршрутныйЛист);
			
			Если ВозвратПоЗакритомуМаршрутнику(НовыйОбъект.МаршрутныйЛист, ТекИД, ТаблицаИД) Тогда 
				Продолжить;
			КонецЕсли;
			
			НовыйОбъект.ОтражатьВУправленческомУчете = Истина;
			НовыйОбъект.ВидПередачи = Перечисления.ВидыПередачиТоваров.СоСклада;
			НовыйОбъект.ВидОперации = Перечисления.ВидыОперацийРеализацияТоваров.ПродажаКомиссия;
			Агент = НовыйОбъект.Контрагент.ТорговыйАгент; 
			НовыйОбъект.ТорговийАгент = ?(ЗначениеЗаполнено(Агент), Агент, Продавец);
			НовыйОбъект.КурсUSD = СтрокаДанныеЭлемента.КурсUSD;
			НовыйОбъект.КурсEUR = СтрокаДанныеЭлемента.КурсEUR;
			Попытка
				НовыйОбъект.СумаОплатиНаложкою = СтрокаДанныеЭлемента.СумаОплатиНаложкою;
			Исключение
			КонецПопытки;
 
			
			Если НовыйОбъект.ДоговорКонтрагента = Справочники.ДоговорыКонтрагентов.ПустаяСсылка() Тогда 
				з = Новый Запрос;
				з.Текст =  "ВЫБРАТЬ ПЕРВЫЕ 1
				|	ДоговорыКонтрагентов.Ссылка КАК Договор
				|ИЗ
				|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
				|ГДЕ
				|	ДоговорыКонтрагентов.ВедениеВзаиморасчетов = &ВедениеВзаиморасчетов
				|	И ДоговорыКонтрагентов.Владелец = &Владелец
				|	И ДоговорыКонтрагентов.Организация = &Организация
				|	И ДоговорыКонтрагентов.ВидДоговора = &ВидДоговора";
				з.УстановитьПараметр("ВидДоговора",Перечисления.ВидыДоговоровКонтрагентов.СПокупателем);
				з.УстановитьПараметр("Владелец",НовыйОбъект.Контрагент);
				з.УстановитьПараметр("Организация",НовыйОбъект.Организация); 
				з.УстановитьПараметр("ВедениеВзаиморасчетов",Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоЗаказам); 
				Выборка = з.Выполнить().Выбрать();
				Если Выборка.Следующий() Тогда
					Запрос = Новый Запрос;
					Запрос.Текст = 
					"ВЫБРАТЬ ПЕРВЫЕ 1
					|	ЗаказыПокупателейОстатки.ДоговорКонтрагента КАК Договор,
					|	ЗаказыПокупателейОстатки.ЗаказПокупателя КАК Заказ
					|ИЗ
					|	РегистрНакопления.ЗаказыПокупателей.Остатки КАК ЗаказыПокупателейОстатки
					|ГДЕ
					|	ЗаказыПокупателейОстатки.ДоговорКонтрагента = &ДоговорКонтрагента";
					Запрос.УстановитьПараметр("ДоговорКонтрагента", Выборка.Договор);
					ВыборкаДетальныеЗаписи = Запрос.Выполнить().Выбрать();
					Если ВыборкаДетальныеЗаписи.Количество() > 0 Тогда
						НовыйОбъект.ДоговорКонтрагента = ВыборкаДетальныеЗаписи.Договор;
						Если НЕ ЗначениеЗаполнено(НовыйОбъект.Сделка) Тогда  
							НовыйОбъект.Сделка = ВыборкаДетальныеЗаписи.Заказ;
						КонецЕсли;
					Иначе
						Договор = ВыборДоговора(Перечисления.ВидыДоговоровКонтрагентов.СПокупателем,НовыйОбъект.Контрагент,НовыйОбъект.Организация,Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоДоговоруВЦелом);
						Если Договор = Неопределено Тогда
							ВызватьИсключение "У контрагента "+НовыйОбъект.Контрагент+" нет  договора с покупателем по заказам или непланового";
						Иначе
							НовыйОбъект.ДоговорКонтрагента = Договор;
						КонецЕсли;
					КонецЕсли;
				Иначе 
					Договор = ВыборДоговора(Перечисления.ВидыДоговоровКонтрагентов.СПокупателем,НовыйОбъект.Контрагент,НовыйОбъект.Организация,Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоДоговоруВЦелом);
					Если Договор = Неопределено Тогда
						ВызватьИсключение "У контрагента "+НовыйОбъект.Контрагент+" нет  договора с покупателем по заказам или непланового";
					Иначе
						НовыйОбъект.ДоговорКонтрагента = Договор;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;			
			НовыйОбъект.ВалютаДокумента = Константы.ВалютаУправленческогоУчета.Получить();
			НовыйОбъект.КратностьВзаиморасчетов = 1;
			СтруктураКурсаВзаиморасчетов = МодульВалютногоУчета.ПолучитьКурсВалюты(НовыйОбъект.ВалютаДокумента, ОбщегоНазначения.ПолучитьРабочуюДату());
			НовыйОбъект.КурсВзаиморасчетов = СтруктураКурсаВзаиморасчетов.Курс;
			
			//КонецЕсли;
			
			НовыйОбъект.ПометкаУдаления = СтрокаДанныеЭлемента.ПометкаУдаления; 
			
			//ЗаписьЖурналаРегистрации("ЛОГ_РЕАЛИЗАЦИЯ3",УровеньЖурналаРегистрации.Информация,,"",СокрЛП(НовыйОбъект.Контрагент));
			
		КонецЕсли;
		Агент = НовыйОбъект.Контрагент.ТорговыйАгент; 
		НовыйОбъект.ТорговийАгент = ?(СтрокаДанныеЭлемента.ПризначитиПродажТорговомуКонтрагента, Агент, Продавец);
		//НовыйОбъект.ТорговийАгент = Продавец;

		
		///////////////////////////////////////////////////////////////////
		
		
		СтрокаТоваров = НовыйОбъект.Товары.Добавить();
		
		
		
		
		ЗаполнитьЗначенияСвойств(СтрокаТоваров,СтрокаДанныеЭлемента);
		СтрокаТоваров.Номенклатура = Справочники.Номенклатура.ПолучитьСсылку(СтрокаДанныеЭлемента.Номенклатура);
		СтрокаТоваров.ХарактеристикаНоменклатуры = Справочники.ХарактеристикиНоменклатуры.ПолучитьСсылку(СтрокаДанныеЭлемента.ХарактеристикаНоменклатуры);
		Попытка
			СтрокаТоваров.ЕдиницаИзмерения = СтрокаТоваров.Номенклатура.ЕдиницаХраненияОстатков;
		Исключение
		КонецПопытки;
		СтрокаТоваров.Сумма = СтрокаТоваров.Цена * СтрокаТоваров.Количество;
		СтрокаТоваров.Коэффициент = СтрокаТоваров.ЕдиницаИзмерения.Коэффициент;
		
		
		Попытка
			НовыйОбъект.Записать();
			//ЗаписьЖурналаРегистрации("ЛОГ_РЕАЛИЗАЦИЯ4",УровеньЖурналаРегистрации.Информация,,"",СокрЛП(НовыйОбъект.Ссылка));
		Исключение
			ЗаписьЖурналаРегистрации("ОШИБКА_ЗАПИСИ_РЕАЛИЗАЦИИ",УровеньЖурналаРегистрации.Ошибка,,"",ОписаниеОшибки());
		КонецПопытки;
		
		Если ДобавитьДок Тогда 
			МассивДокументов.Добавить(НовыйОбъект.Ссылка);
			ДобавитьДок = Ложь;
		КонецЕсли;
		
	КонецЦикла;	
	
	Если ЗначениеЗаполнено(ТекИД) Тогда 
		НовСтр = ТаблицаИД.Добавить();
		НовСтр.ИД = ТекИД;
	КонецЕсли;
	
	Для Каждого ДокСсылка Из МассивДокументов Цикл
		
		Если ДокСсылка.ПометкаУдаления Тогда 
			Продолжить;
		КонецЕсли;
		
		ДокОб = ДокСсылка.ПолучитьОбъект();
		
		Попытка
			ДокОб.Записать(РежимЗаписиДокумента.Проведение,РежимПроведенияДокумента.Неоперативный);
		Исключение
		КонецПопытки;
		//++
		Общий.СнятьАктуальностьСЗаказаСоСтатусомДоставкиПочтаСамовывоз(ДокСсылка);
		//++
	КонецЦикла;
	
КонецПроцедуры


Процедура СоздатьПрезентацию(ТаблицаПрезентаций,Склад,Продавец, ТаблицаИД)
	
	МассивДокументов = Новый Массив;         
	ИмяДок = "Презентація";
	ТекущаяСсылка = "";
	ТорговыйАгент = Продавец;
	Попытка
		ТаблицаПрезентаций.Сортировать("Ссылка");
	Исключение
	КонецПопытки;
	ТекИД = Неопределено;
	
	Для Каждого СтрокаДанныеЭлемента Из ТаблицаПрезентаций Цикл
		///////////////////////
		//ЗаписьЖурналаРегистрации("ЛОГ_ПРЕЗЕНТАЦИЯ",УровеньЖурналаРегистрации.Информация,,"",СокрЛП(Справочники.Контрагенты.ПолучитьСсылку(СтрокаДанныеЭлемента.Контрагент)) + СокрЛП(СтрокаДанныеЭлемента.Дата));
		
		НовыйОбъект = Документы[ИмяДок].ПолучитьСсылку(СтрокаДанныеЭлемента.Ссылка).ПолучитьОбъект();
		ТекущийКонтрагент = Справочники.Контрагенты.ПолучитьСсылку(СтрокаДанныеЭлемента.Контрагент);
		
			
		Если НовыйОбъект = Неопределено ИЛИ НЕ ЗначениеЗаполнено(НовыйОбъект.Ссылка) Тогда   // Створюєм
			Если СтрокаДанныеЭлемента.ПометкаУдаления  Тогда 
				Продолжить;
			КонецЕсли;
			
			НовыйОбъект = Документы[ИмяДок].СоздатьДокумент();	
			НовыйОбъект.УстановитьСсылкуНового(Документы[ИмяДок].ПолучитьСсылку(СтрокаДанныеЭлемента.Ссылка));
			
			ДобавитьДок = Истина;
		Иначе			
			НовыйОбъект.Записать(РежимЗаписиДокумента.ОтменаПроведения);
		КонецЕсли;	
		
		
		//ЗаписьЖурналаРегистрации("ЛОГ_ПРЕЗЕНТАЦИЯ",УровеньЖурналаРегистрации.Информация,,"",СокрЛП(НовыйОбъект.Ссылка));
		
		
		
		////////////////////////////////////////////////////////////////////  Новий документ
		Если ТекущаяСсылка <> СтрокаДанныеЭлемента.Ссылка Тогда 
			//НовыйОбъект.Коментар = НовыйОбъект.Коментар + " Оновлено з додатку: " + СокрЛП(ТекущаяДата()) + " " + СтрокаДанныеЭлемента.Комментарий;
			НовыйОбъект.Товари.Очистить();
			ТекущаяСсылка = СтрокаДанныеЭлемента.Ссылка;
			Попытка
				Если ЗначениеЗаполнено(ТекИД) Тогда 
					НовСтр = ТаблицаИД.Добавить();
					НовСтр.ИД = ТекИД; 
				КонецЕсли;
				ТекИД = СтрокаДанныеЭлемента.ИД;
			Исключение
			КонецПопытки;
			ДобавитьДок = Истина;
			Если НЕ ЗначениеЗаполнено(НовыйОбъект.Ссылка) Тогда 
				НовыйОбъект.Дата = СтрокаДанныеЭлемента.Дата;
				//НовыйОбъект.УстановитьНовыйНомер();
			КонецЕсли;
			//НовыйОбъект.Организация = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(ПараметрыСеанса.ТекущийПользователь,"ОсновнаяОрганизация");								
			НовыйОбъект.Доставка = Перечисления.НаявністьДоставки[СтрокаДанныеЭлемента.Доставка];			

			
			НовыйОбъект.Контрагент 		= ТекущийКонтрагент;
			//НовыйОбъект.Коментар 		= СтрокаДанныеЭлемента.КомментарийОбщий;
			НовыйОбъект.Коментар = НовыйОбъект.Коментар + " Оновлено з додатку: " + СокрЛП(ТекущаяДата()) + " " + СтрокаДанныеЭлемента.КомментарийОбщий;
			
			
			

			Агент = НовыйОбъект.Контрагент.ТорговыйАгент; 
			НовыйОбъект.ТорговийАгент = ?(ЗначениеЗаполнено(Агент), Агент, Продавец);
			
			НовыйОбъект.ПометкаУдаления = СтрокаДанныеЭлемента.ПометкаУдаления; 
			
			//ЗаписьЖурналаРегистрации("ЛОГ_ПЕЗЕНТАЦИЯ",УровеньЖурналаРегистрации.Информация,,"",СокрЛП(НовыйОбъект.Контрагент));
			
		КонецЕсли;

		
		///////////////////////////////////////////////////////////////////
		
		
		СтрокаТоваров = НовыйОбъект.Товари.Добавить();
		
		
		
		
		ЗаполнитьЗначенияСвойств(СтрокаТоваров,СтрокаДанныеЭлемента);
		СтрокаТоваров.Номенклатура = Справочники.Номенклатура.ПолучитьСсылку(СтрокаДанныеЭлемента.Номенклатура);
		Попытка
			СтрокаТоваров.ХарактеристикаНоменклатуры = Справочники.ХарактеристикиНоменклатуры.ПолучитьСсылку(СтрокаДанныеЭлемента.ХарактеристикаНоменклатуры);
		Исключение
		КонецПопытки;	
		СтрокаТоваров.Коментар = СтрокаДанныеЭлемента.Комментарий;
		

		
		Попытка
			НовыйОбъект.Записать();
			//ЗаписьЖурналаРегистрации("ЛОГ_ПРЕЗЕТАЦИЯ",УровеньЖурналаРегистрации.Информация,,"",СокрЛП(НовыйОбъект.Ссылка));
		Исключение
			ЗаписьЖурналаРегистрации("ОШИБКА_ЗАПИСИ_ПРЕЗЕТАЦИЯ",УровеньЖурналаРегистрации.Ошибка,,"",ОписаниеОшибки());
		КонецПопытки;
		
		Если ДобавитьДок Тогда 
			МассивДокументов.Добавить(НовыйОбъект.Ссылка);
			ДобавитьДок = Ложь;
		КонецЕсли;
		
	КонецЦикла;	
	
	Если ЗначениеЗаполнено(ТекИД) Тогда 
		НовСтр = ТаблицаИД.Добавить();
		НовСтр.ИД = ТекИД;
	КонецЕсли;
	
	Для Каждого ДокСсылка Из МассивДокументов Цикл
		
		Если ДокСсылка.ПометкаУдаления Тогда 
			Продолжить;
		КонецЕсли;
		
		ДокОб = ДокСсылка.ПолучитьОбъект();
		
		Попытка
			ДокОб.Записать(РежимЗаписиДокумента.Проведение,РежимПроведенияДокумента.Неоперативный);
		Исключение
		КонецПопытки;
	КонецЦикла;
	
КонецПроцедуры


Функция ВозвратПоЗакритомуМаршрутнику(МаршрутныйЛист, ТекИД, ТаблицаИД)
	Попытка
		Если ЗначениеЗаполнено(МаршрутныйЛист) И МаршрутныйЛист.СтатусДокумента = Перечисления.СтатусыМаршрутногоЛиста.Завершен Тогда 
			Если ЗначениеЗаполнено(ТекИД) Тогда 
				НовСтр = ТаблицаИД.Добавить();
				НовСтр.ИД = ТекИД;
			КонецЕсли;	
			Возврат Истина;
		КонецЕсли;
	Исключение
	КонецПопытки;
	Возврат Ложь;
КонецФункции


Функция ВыборДоговора(ВидДоговора,Контрагент,Организация,ВедениеВзаиморасчетов)
	з = Новый Запрос;
	з.Текст =  "ВЫБРАТЬ ПЕРВЫЕ 1
	|	ДоговорыКонтрагентов.Ссылка КАК Договор
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|ГДЕ
	|	ДоговорыКонтрагентов.ВедениеВзаиморасчетов = &ВедениеВзаиморасчетов
	|	И ДоговорыКонтрагентов.Владелец = &Владелец
	|	И ДоговорыКонтрагентов.Организация = &Организация
	|	И ДоговорыКонтрагентов.ВидДоговора = &ВидДоговора";
	з.УстановитьПараметр("ВидДоговора",ВидДоговора);
	з.УстановитьПараметр("Владелец",Контрагент);
	з.УстановитьПараметр("Организация",Организация); 
	з.УстановитьПараметр("ВедениеВзаиморасчетов",ВедениеВзаиморасчетов); 
	Выборка = з.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда 
		Возврат Выборка.Договор;
	Иначе
		Возврат Справочники.ДоговорыКонтрагентов.ПустаяСсылка();
	КонецЕсли;
КонецФункции

Процедура ОбновитьНормыЗапасов(ТаблицаНормЗапасов,Склад, ТаблицаИД)
	//МассивДокументов = Новый Массив;         
	//ИмяДок = "ВозвратТоваровОтПокупателя";
	//ТекущаяСсылка = "";
	
	Для Каждого СтрокаДанныеЭлемента Из ТаблицаНормЗапасов Цикл
		
			  //        |	РегистрацияОбмена.ИД,
			  //|	НормыЗапасов.Номенклатура КАК Номенклатура,
			  //|	НормыЗапасов.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
			  //|	НормыЗапасов.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
			  //|	НормыЗапасов.Количество,
			  //|	НормыЗапасов.Дата
			  
			ТекНом = Справочники.Номенклатура.ПолучитьСсылку(СтрокаДанныеЭлемента.Номенклатура);
			ТекХар = Справочники.ХарактеристикиНоменклатуры.ПолучитьСсылку(СтрокаДанныеЭлемента.ХарактеристикаНоменклатуры);
			ТекЕдИзм = Справочники.ЕдиницыИзмерения.ПолучитьСсылку(СтрокаДанныеЭлемента.ЕдиницаИзмерения);
			
			Запрос = Новый Запрос;
			Запрос.Текст="ВЫБРАТЬ
			             |	НормыЗапасов.Количество,
			             |	НормыЗапасов.Дата
			             |ИЗ
			             |	РегистрСведений.НормыЗапасов КАК НормыЗапасов
			             |ГДЕ
			             |	НормыЗапасов.Номенклатура = &Номенклатура
			             |	И НормыЗапасов.ХарактеристикаНоменклатуры = &ХарактеристикаНоменклатуры
			             |	И НормыЗапасов.ЕдиницаИзмерения = &ЕдиницаИзмерения
			             |	И НормыЗапасов.Склад = &Склад";
			Запрос.УстановитьПараметр("Номенклатура",ТекНом);
			Запрос.УстановитьПараметр("ХарактеристикаНоменклатуры",ТекХар);
			Запрос.УстановитьПараметр("ЕдиницаИзмерения",ТекЕдИзм);
			Запрос.УстановитьПараметр("Склад",Склад);
			Выборка = Запрос.Выполнить().Выбрать();
			Если Выборка.Следующий() И Выборка.Дата > СтрокаДанныеЭлемента.Дата Тогда 
				
			Иначе 
			
			
			
			
			нз = РегистрыСведений.НормыЗапасов.СоздатьНаборЗаписей();
			нз.Отбор.ЕдиницаИзмерения.Использование = Истина;
			нз.Отбор.Номенклатура.Использование = Истина;
			нз.Отбор.ХарактеристикаНоменклатуры.Использование = Истина;
			нз.Отбор.Склад.Использование = Истина;

			
			
			нз.Отбор.ЕдиницаИзмерения.Значение = ТекЕдИзм;
			нз.Отбор.Номенклатура.Значение = ТекНом;
			нз.Отбор.Склад.Значение = Склад;
			нз.Отбор.ХарактеристикаНоменклатуры.Значение = ТекХар;
			
			з = нз.Добавить();
			
			з.Номенклатура = ТекНом;
			з.ХарактеристикаНоменклатуры = ТекХар;
			з.Количество = СтрокаДанныеЭлемента.Количество;
			з.Дата = СтрокаДанныеЭлемента.Дата;
			з.ЕдиницаИзмерения = ТекЕдИзм;
			з.Склад = Склад;
			нз.Записать();	
			КонецЕсли;
					НовСтр = ТаблицаИД.Добавить();
					НовСтр.ИД = СтрокаДанныеЭлемента.ИД;

		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаписатьКілометражТорговогоАгента(ТаблицаЗаписів,Продавец)
	
	Для Каждого стр из ТаблицаЗаписів Цикл 
		
		Статус=ИмяЗначенияПеречисленияПоСинониму("СтатусДня",стр.Статус);
		Если Статус = Неопределено тогда
			Продолжить;
		КонецЕсли;
		НабірЗаписів = РегистрыСведений.КілометражТорговогоАгента.СоздатьНаборЗаписей();
		НабірЗаписів.Отбор.ТорговийАгент.Установить(Продавец);
		НабірЗаписів.Отбор.Период.Установить(стр.Период);
		
		НоваяЗапись = НабірЗаписів.Добавить(); 
		НоваяЗапись.Период = стр.Период; 
		НоваяЗапись.ТорговийАгент = Продавец; 
		НоваяЗапись.СтатусДня = Перечисления.СтатусДня[Статус];
		НоваяЗапись.Кілометраж = стр.Кілометраж; 
		Попытка
			НабірЗаписів.Записать();
	Исключение
		//Сообщить("Помилка при записі регістра відомостей ""Кілометраж торгового агента"" при обміні Андроїд");
		ЗаписьЖурналаРегистрации("ОбмінАндроїдЧитанняДаних",,,,"Помилка при записі регістра відомостей ""Кілометраж торгового агента"" при обміні Андроїд");
	КонецПопытки;

	КонецЦикла;

КонецПроцедуры

Процедура ЗаписатьКоординатыТорговогоАгента(ТаблицаЗаписів,Продавец)
	
	Для Каждого стр из ТаблицаЗаписів Цикл 
		
		НабірЗаписів = РегистрыСведений.РегистрацияКоординатТорговых.СоздатьНаборЗаписей();
		НабірЗаписів.Отбор.ТорговийАгент.Установить(Продавец);
		НабірЗаписів.Отбор.Дата.Установить(стр.Дата);
		
		НоваяЗапись = НабірЗаписів.Добавить(); 
		НоваяЗапись.Дата = стр.Дата; 
		НоваяЗапись.ТорговийАгент = Продавец; 
		НоваяЗапись.Широта = стр.Широта;
		НоваяЗапись.Долгота = стр.Долгота; 
		Попытка
			НабірЗаписів.Записать();
		Исключение
			ЗаписьЖурналаРегистрации("ОбмінАндроїдЧитанняДаних",,,,"Помилка при записі регістра відомостей ""Реєстрація координат торгового агента"" при обміні Андроїд");
		КонецПопытки;
		
	КонецЦикла;

КонецПроцедуры

Функция ОбработкаНомераТелефона(Телефон) Экспорт 
	
		
	
	Телефон = СтрЗаменить(Телефон,")","");
	Телефон = СтрЗаменить(Телефон,"(","");
	Телефон = СтрЗаменить(Телефон,"+38","");
	Телефон = СтрЗаменить(Телефон,"-","");
	Телефон = СтрЗаменить(Телефон,"_","");
	Телефон = СтрЗаменить(Телефон,".","");
	Телефон = СтрЗаменить(Телефон,",","");
	Телефон = СтрЗаменить(Телефон,"}","");
	Телефон = СтрЗаменить(Телефон,"{","");
	Телефон = СтрЗаменить(Телефон,"=","");
	Телефон = СтрЗаменить(Телефон," ","");
	Телефон = СтрЗаменить(Телефон,":","");
	Если СтрДлина(Телефон) > 13 Тогда 
		Если Сред(СокрЛП(Телефон),1,3) = "+38" Тогда
			Телефон = Сред(СокрЛП(Телефон),3);
		КонецЕсли;	
	КонецЕсли;
	
	Возврат СокрЛП(Телефон);
	
КонецФункции


Процедура ОбновитьКонтрагентов(ТаблицаКонтрагентов,Склад, ТаблицаИД, Продавец, МассивОшибок)
	Для Каждого СтрокаДанныеЭлемента Из ТаблицаКонтрагентов Цикл
					  
		ТекКонтрОб = Справочники.Контрагенты.ПолучитьСсылку(СтрокаДанныеЭлемента.Ссылка).ПолучитьОбъект();
		ТекТипЦен = Справочники.ТипыЦенНоменклатуры.ПолучитьСсылку(СтрокаДанныеЭлемента.ТипЦен);
		
		Если ТекКонтрОб = Неопределено Тогда  // Знайдемо може такий контрагент э вже в базі
			
			
			////
			Для Индекс = 1 по СтрЧислоСтрок(СтрокаДанныеЭлемента.НомерТелефона) Цикл
				ТекНомерТелефона = СокрЛП(СтрПолучитьСтроку(СтрокаДанныеЭлемента.НомерТелефона, Индекс));
				Если НЕ ЗначениеЗаполнено(ТекНомерТелефона) Тогда
					Продолжить;
				КонецЕсли;
				
				зПоНомеруТелефона = Новый Запрос;
				зПоНомеруТелефона.Текст = "ВЫБРАТЬ
				                          |	Контрагенты.Ссылка
				                          |ИЗ
				                          |	Справочник.Контрагенты КАК Контрагенты
				                          |ГДЕ
				                          |	Контрагенты.НомерТелефона = &НомерТелефона
				                          |
				                          |ОБЪЕДИНИТЬ ВСЕ
				                          |
				                          |ВЫБРАТЬ
				                          |	КонтрагентыДополнительныеНомераТелефонов.Ссылка
				                          |ИЗ
				                          |	Справочник.Контрагенты.ДополнительныеНомераТелефонов КАК КонтрагентыДополнительныеНомераТелефонов
				                          |ГДЕ
				                          |	КонтрагентыДополнительныеНомераТелефонов.Номер = &НомерТелефона";
				зПоНомеруТелефона.УстановитьПараметр("НомерТелефона", ОбработкаНомераТелефона(ТекНомерТелефона));
				Выборка = зПоНомеруТелефона.Выполнить().Выбрать();
				Если Выборка.Следующий() Тогда 
					ТекКонтрОб = Выборка.Ссылка.ПолучитьОбъект();
					ТекКонтрОб.мОбменАндроид = Истина;
					ТекКонтрОб.ТорговыйАгент = Продавец;
					ТекКонтрОб.Записать();
					МассивОшибок.Добавить("Клієнт з номером телефону " + ТекНомерТелефона + " вже є в базі! Виконайте повний обмін!");
				КонецЕсли;
				
				
			КонецЦикла;
			
			////	
			
			
		Иначе
			Попытка 
				ТекКонтрОб.Заблокировать();
			Исключение
				Продолжить;
			КонецПопытки;
			
		КонецЕсли;	
		
		
		
		
		Если ТекКонтрОб = Неопределено Тогда 
			
			
			ТекКонтрОб = Справочники.Контрагенты.СоздатьЭлемент();	
			ЗаполнитьЗначенияСвойств(ТекКонтрОб, СтрокаДанныеЭлемента,,"НомерТелефона"); 
			ТекКонтрОб.УстановитьСсылкуНового(Справочники.Контрагенты.ПолучитьСсылку(СтрокаДанныеЭлемента.Ссылка));
			ТекКонтрОб.мОбменАндроид = Истина;
			ЗаписьЖурналаРегистрации("ЗмінаКонтрагента", УровеньЖурналаРегистрации.Информация, , СокрЛП(ТекКонтрОб.Наименование) + " - " + СокрЛП(СтрокаДанныеЭлемента.Наименование), "ОбменАРМ1");
			ТекКонтрОб.Наименование = СтрокаДанныеЭлемента.Наименование;
			ТекКонтрОб.Покупатель = Истина;
			ТекКонтрОб.Родитель = Справочники.Контрагенты.НайтиПоКоду("000000004");
			ТекКонтрОб.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ФизЛицо;
			ТекКонтрОб.НомерТелефона = ОбработкаНомераТелефона(СтрокаДанныеЭлемента.НомерТелефона);
			Если СтрокаДанныеЭлемента.Телефоны.Количество() Тогда 
				ОбновитьНомерыТелефоновКонтрагента(ТекКонтрОб, СтрокаДанныеЭлемента.Телефоны);
			КонецЕсли;

			
			ОбластьСсылка = Справочники.Области.ПолучитьСсылку(СтрокаДанныеЭлемента.УИДОбласть);
			ОбъектОбласть = Неопределено;
			Попытка
				ОбъектОбласть = ОбластьСсылка.ПолучитьОбъект();
			Исключение КонецПопытки;
			Если ОбъектОбласть = Неопределено Тогда  
				ОбластьОб = Справочники.Области.СоздатьЭлемент();
				ОбластьОб.УстановитьСсылкуНового(ОбластьСсылка);
				ОбластьОб.Наименование = СтрокаДанныеЭлемента.ОбластьНаименование;
				ОбластьОб.Записать();
				ОбластьСсылка = ОбластьОб.Ссылка;
			КонецЕсли;
			
			ГородСсылка = Справочники.Города.ПолучитьСсылку(СтрокаДанныеЭлемента.УИДГород);
			ОбъектГород = Неопределено;
			Попытка
				ОбъектГород = ГородСсылка.ПолучитьОбъект();
			Исключение
			КонецПопытки;
			Если ОбъектГород = Неопределено Тогда  
				ГородОб = Справочники.Города.СоздатьЭлемент();
				ГородОб.УстановитьСсылкуНового(ГородСсылка);
				//ЗаписьЖурналаРегистрации("Обмен", УровеньЖурналаРегистрации.Информация,,,СтрокаДанныеЭлемента.ГородНаименование);
				ГородОб.Наименование = СтрокаДанныеЭлемента.ГородНаименование;
				ГородОб.Владелец = ОбластьСсылка;
				ГородОб.Записать();
				ГородСсылка = ГородОб.Ссылка;
			КонецЕсли;
			
			
			ТекКонтрОб.Область = ОбластьСсылка;
			ТекКонтрОб.Город = ГородСсылка;
			
			ТекКонтрОб.ТорговыйАгент = Продавец;
			
			ТекКонтрОб.Маршрут = Справочники.Маршруты.ПолучитьСсылку(СтрокаДанныеЭлемента.УИДМаршрут);
			ТекКонтрОб.СтатусКонтрагента = Справочники.СтатусыКонтрагентов.ПолучитьСсылку(СтрокаДанныеЭлемента.УИДСтатусКонтрагента);
			ТекКонтрОб.ОперативныйСтатусКонтрагента = Справочники.СтатусыКонтрагентов.ПолучитьСсылку(СтрокаДанныеЭлемента.УИДОперативныйСтатусКонтрагента);
			ТекКонтрОб.КатегорияТТ = Справочники.КатегорииТТ.ПолучитьСсылку(СтрокаДанныеЭлемента.УИДКатегорияТТ);
			ТекКонтрОб.СпособДоставки = Справочники.СпособыДоставки.ПолучитьСсылку(СтрокаДанныеЭлемента.УИДСпособДоставки);
			ТекКонтрОб.КаналПошуку = Справочники.КаналиПошуку.ПолучитьСсылку(СтрокаДанныеЭлемента.УИДКаналПошуку);


			Если ТипЗнч(СтрокаДанныеЭлемента.КодАсортимента) = Тип("Число") Тогда 	
				ТекКонтрОб.КодАсортимета = Перечисления.КодыАсортимета[СтрокаДанныеЭлемента.КодАсортимента]
			КонецЕсли;

			Попытка
				ТекКонтрОб.ДополнительныеСвойства.Вставить("ТорговыйАгент", Продавец); 
				//ДопСво ТекКонтрОб.ТорговыйАгент = Продавец;
				ТекКонтрОб.Записать();
			Исключение
				//Попытка	
				//	ТекКонтрОб.Комментарий = ТекКонтрОб.Комментарий + " " + ТекКонтрОб.НомерТелефона; 
				//	ТекКонтрОб.НомерТелефона = "";
				//Исключение	
				
					ТекНомТел = Строка(ТекКонтрОб.НомерТелефона);
					Для Каждого Стр Из ТекКонтрОб.ДополнительныеНомераТелефонов Цикл
						ТекНомТел = ТекНомТел + ", " + Стр.Номер;
					КонецЦикла;
					
				
					ЗаписьЖурналаРегистрации("ОБМЕН АНДРОИД", УровеньЖурналаРегистрации.Ошибка, ,,ОписаниеОшибки() + ", " + ТекНомТел);
					//Продолжить;
					
					
					
					МассивОшибок.добавить(ОписаниеОшибки() + ", " + ТекНомТел);
					Продолжить;
				//КонецПопытки;
			КонецПопытки;
			/////////////////
			
			НовДог = Справочники.ДоговорыКонтрагентов.СоздатьЭлемент();
			НовДог.Владелец = ТекКонтрОб.Ссылка;
			НовДог.Организация = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(ПараметрыСеанса.ТекущийПользователь,"ОсновнаяОрганизация");
			НовДог.Наименование = "Основний";
			НовДог.ВедениеВзаиморасчетов = Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоЗаказам;
			НовДог.ВестиПоДокументамРасчетовСКонтрагентом = Истина;
			НовДог.ВидВзаиморасчетов = Перечисления.ВидыДоговоровКонтрагентов.СПокупателем;
			НовДог.ВалютаВзаиморасчетов = Константы.ВалютаУправленческогоУчета.Получить();
			НовДог.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СПокупателем;
			НовДог.ТипЦен = ТекТипЦен;
			//НовДог.ОбособленноеПодразделение = Склад.Подразделение.РСП;
			НовДог.Записать();
			ТекКонтрОб.ОсновнойДоговорКонтрагента = НовДог.Ссылка;
			
			// Неплановий
			
			НовДогНепл = Справочники.ДоговорыКонтрагентов.СоздатьЭлемент();
			НовДогНепл.Владелец = ТекКонтрОб.Ссылка;
			НовДогНепл.Организация = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(ПараметрыСеанса.ТекущийПользователь,"ОсновнаяОрганизация");
			НовДогНепл.Наименование = "Непланові продажі";
			НовДогНепл.ВедениеВзаиморасчетов = Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоДоговоруВЦелом;
			НовДогНепл.ВестиПоДокументамРасчетовСКонтрагентом = Истина;
			НовДогНепл.ВидВзаиморасчетов = Перечисления.ВидыДоговоровКонтрагентов.СПокупателем;
			НовДогНепл.ВалютаВзаиморасчетов = Константы.ВалютаУправленческогоУчета.Получить();
			НовДогНепл.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СПокупателем;
			НовДогНепл.ТипЦен = ТекТипЦен;
			//НовДог.ОбособленноеПодразделение = Склад.Подразделение.РСП;
			НовДогНепл.Записать();
			ТекКонтрОб.ДоговорДляНеплановыхПродаж = НовДогНепл.Ссылка;
			
			ТекКонтрОб.Маршруты.Очистить();
			Для Каждого Элемент Из СтрокаДанныеЭлемента.Маршруты Цикл 
				Строка = ТекКонтрОб.Маршруты.ДОбавить();
				Строка.Маршрут = Справочники.Маршруты.ПолучитьСсылку(Элемент.УИД_Маршрут);
			КонецЦикла;
			
			ТекКонтрОб.Асортимент.Очистить();
			Для Каждого Элемент Из СтрокаДанныеЭлемента.Асортимент Цикл 
				Строка = ТекКонтрОб.Асортимент.ДОбавить();
				Строка.Артикул = Элемент.Артикул;
			КонецЦикла;


			Попытка
				ТекКонтрОб.ДополнительныеСвойства.Вставить("ТорговыйАгент", Продавец);
				//ДопСво ТекКонтрОб.ТорговыйАгент = Продавец;	
				ТекКонтрОб.Записать();
			Исключение
				////ЗаписьЖурналаРегистрации("ОБМЕН АНДРОИД", УровеньЖурналаРегистрации.Ошибка, ,,ОписаниеОшибки());
				МассивОшибок.добавить(ОписаниеОшибки());
				Продолжить;

			КонецПопытки;
			
		Иначе 
			//ЗаполнитьЗначенияСвойств(ТекКонтрОб, СтрокаДанныеЭлемента,, "ДатаСоздания");
						
			Для Каждого мет Из Метаданные.Справочники.Контрагенты.Реквизиты Цикл
						
				Если мет.Имя = "ДатаСоздания"
					ИЛИ мет.Имя = "ТорговыйАгент" Тогда 
					Продолжить;
				КонецЕсли;
				
				//Если СтрокаДанныеЭлемента.Колонки.Найти(мет.Имя) <> Неопределено Тогда  
				Попытка
					Если ЗначениеЗаполнено(СтрокаДанныеЭлемента[мет.Имя]) Тогда 
						ТекКонтрОб[мет.Имя] = СтрокаДанныеЭлемента[мет.Имя];
					КонецЕсли;
				Исключение
				КонецПопытки;
				
				//КонецЕсли;
												
			КонецЦикла;
				
			
			ОбновитьНомерыТелефоновКонтрагента(ТекКонтрОб, СтрокаДанныеЭлемента.Телефоны);
			
			ТекКонтрОб.Область = Справочники.Области.ПолучитьСсылку(СтрокаДанныеЭлемента.УИДОбласть);
						
			ГородСсылка = Справочники.Города.ПолучитьСсылку(СтрокаДанныеЭлемента.УИДГород);
			ОбъектГород = Неопределено;
			Попытка
				ОбъектГород = ГородСсылка.ПолучитьОбъект();
			Исключение
			КонецПопытки;
			Если ОбъектГород = Неопределено Тогда  
				ГородОб = Справочники.Города.СоздатьЭлемент();
				ГородОб.УстановитьСсылкуНового(ГородСсылка);
				//ЗаписьЖурналаРегистрации("Обмен", УровеньЖурналаРегистрации.Информация,,,СтрокаДанныеЭлемента.ГородНаименование);
				ГородОб.Наименование = СтрокаДанныеЭлемента.ГородНаименование;
				ГородОб.Владелец = ТекКонтрОб.Область;
				Если НЕ ЗначениеЗаполнено(ГородОб.Владелец) Тогда 
					ГородОб.Владелец = Справочники.Области.НайтиПоКоду("000000003");
					ТекКонтрОб.Область = ГородОб.Владелец;
				КонецЕсли;
				ГородОб.Записать();
				ГородСсылка = ГородОб.Ссылка;
			КонецЕсли;
			
			ТекКонтрОб.Наименование = СтрокаДанныеЭлемента.Наименование;
			ТекКонтрОб.Город = ГородСсылка;
			ТекКонтрОб.Маршрут = Справочники.Маршруты.ПолучитьСсылку(СтрокаДанныеЭлемента.УИДМаршрут);
			ТекКонтрОб.СтатусКонтрагента = Справочники.СтатусыКонтрагентов.ПолучитьСсылку(СтрокаДанныеЭлемента.УИДСтатусКонтрагента);
			ТекКонтрОб.ОперативныйСтатусКонтрагента = Справочники.СтатусыКонтрагентов.ПолучитьСсылку(СтрокаДанныеЭлемента.УИДОперативныйСтатусКонтрагента);
			ТекКонтрОб.КатегорияТТ = Справочники.КатегорииТТ.ПолучитьСсылку(СтрокаДанныеЭлемента.УИДКатегорияТТ);
			ТекКонтрОб.СпособДоставки = Справочники.СпособыДоставки.ПолучитьСсылку(СтрокаДанныеЭлемента.УИДСпособДоставки);
			ТекКонтрОб.КаналПошуку = Справочники.КаналиПошуку.ПолучитьСсылку(СтрокаДанныеЭлемента.УИДКаналПошуку);

			Если ТипЗнч(СтрокаДанныеЭлемента.КодАсортимента) = Тип("Число") Тогда 	
				ТекКонтрОб.КодАсортимета = Перечисления.КодыАсортимета[СтрокаДанныеЭлемента.КодАсортимента]
			КонецЕсли;
			
			
			ТекКонтрОб.НомерВідділенняНП = СтрокаДанныеЭлемента.НомерВідділенняНП;
						
			ТекКонтрОб.Маршруты.Очистить();
			Для Каждого Элемент Из СтрокаДанныеЭлемента.Маршруты Цикл 
				Строка = ТекКонтрОб.Маршруты.ДОбавить();
				Строка.Маршрут = Справочники.Маршруты.ПолучитьСсылку(Элемент.УИД_Маршрут);
			КонецЦикла;
			
			ТекКонтрОб.Асортимент.Очистить();
			Попытка
				Для Каждого Элемент Из СтрокаДанныеЭлемента.Асортимент Цикл 
					Строка = ТекКонтрОб.Асортимент.ДОбавить();
					Строка.Артикул = Элемент.Артикул;
				КонецЦикла;
			Исключение
			КонецПопытки;
			
			
			Попытка
				ТекКонтрОб.СоцМережі.Очистить();
				Для Каждого Элемент Из СтрокаДанныеЭлемента.СоцМережі Цикл 
					Строка = ТекКонтрОб.СоцМережі.ДОбавить();
					Строка.Коментар = Элемент.Коментар;
					Строка.Посилання = Элемент.Посилання;
					Строка.Мережа = Элемент.Мережа;
				КонецЦикла;
			Исключение
			КонецПопытки;
			
			
			Если НЕ ЗначениеЗаполнено(ТекКонтрОб.ОсновнойДоговорКонтрагента) Тогда 
				з = Новый Запрос;
				з.Текст = "ВЫБРАТЬ
				          |	ДоговорыКонтрагентов.Ссылка
				          |ИЗ
				          |	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
				          |ГДЕ
				          |	ДоговорыКонтрагентов.Владелец = &Владелец
				          |	И ДоговорыКонтрагентов.Наименование ПОДОБНО &Наименование";
				з.УстановитьПараметр("Владелец", ТекКонтрОб.Ссылка);
				з.УстановитьПараметр("Наименование", "%Основний%");
				Выборка = з.Выполнить().Выбрать();
				Если Выборка.Следующий() Тогда 
					ТекКонтрОб.ОсновнойДоговорКонтрагента = Выборка.Ссылка;
				КонецЕсли;
				

			КонецЕсли;
			Если НЕ ЗначениеЗаполнено(ТекКонтрОб.ДоговорДляНеплановыхПродаж) Тогда 
				з = Новый Запрос;
				з.Текст = "ВЫБРАТЬ
				          |	ДоговорыКонтрагентов.Ссылка
				          |ИЗ
				          |	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
				          |ГДЕ
				          |	ДоговорыКонтрагентов.Владелец = &Владелец
				          |	И ДоговорыКонтрагентов.Наименование ПОДОБНО &Наименование";
				з.УстановитьПараметр("Владелец", ТекКонтрОб.Ссылка);
				з.УстановитьПараметр("Наименование", "%Непланові продажі%");
				Выборка = з.Выполнить().Выбрать();
				Если Выборка.Следующий() Тогда 
					ТекКонтрОб.ДоговорДляНеплановыхПродаж = Выборка.Ссылка;
				КонецЕсли;
			КонецЕсли;

			

			
			Если ТекКонтрОб.Модифицированность() Тогда 
				ТекКонтрОб.ДополнительныеСвойства.Вставить("ТорговыйАгент", Продавец);
				//ДопСво ТекКонтрОб.ТорговыйАгент = Продавец;
				ТекКонтрОб.Записать()
			КонецЕсли;

		КонецЕсли;
		
		НовСтр = ТаблицаИД.Добавить();
		НовСтр.ИД = СтрокаДанныеЭлемента.ИД;		
	КонецЦикла;	
КонецПроцедуры

Процедура ОбновитьНомерыТелефоновКонтрагента(КонтрагентОбъект, НомерТелефона);
	
	КонтрагентОбъект.ДополнительныеНомераТелефонов.Очистить();	
	
	Если ТипЗнч(НомерТелефона) = Тип("Строка") Тогда 
		
		
		Для Индекс = 1 по СтрЧислоСтрок(НомерТелефона) Цикл
			ТекНомерТелефона = СокрЛП(СтрПолучитьСтроку(НомерТелефона, Индекс));
			Если Не ЗначениеЗаполнено(КонтрагентОбъект.НомерТелефона) Тогда
				КонтрагентОбъект.НомерТелефона = ОбработкаНомераТелефона(ТекНомерТелефона);
			ИначеЕсли КонтрагентОбъект.НомерТелефона = ТекНомерТелефона Тогда  
				Продолжить;
			КонецЕсли;
			Строка = КонтрагентОбъект.ДополнительныеНомераТелефонов.Найти(ОбработкаНомераТелефона(ТекНомерТелефона), "Номер");
			Если Строка = Неопределено Тогда 
				НоваяСтрока = КонтрагентОбъект.ДополнительныеНомераТелефонов.Добавить();
				НоваяСтрока.Номер = ОбработкаНомераТелефона(ТекНомерТелефона);
			КонецЕсли;
		КонецЦикла;
		
	Иначе
		
		Для Каждого Элемент Из НомерТелефона Цикл 
			
			Строка = КонтрагентОбъект.ДополнительныеНомераТелефонов.Найти(ОбработкаНомераТелефона(Элемент.НомерТелефона), "Номер");
			Если Строка = Неопределено  Тогда 
				
				Если Не ЗначениеЗаполнено(КонтрагентОбъект.НомерТелефона) Тогда
					КонтрагентОбъект.НомерТелефона = ОбработкаНомераТелефона(Элемент.НомерТелефона);
				ИначеЕсли КонтрагентОбъект.НомерТелефона = ОбработкаНомераТелефона(Элемент.НомерТелефона) Тогда  
					Продолжить;
				КонецЕсли;

				НоваяСтрока = КонтрагентОбъект.ДополнительныеНомераТелефонов.Добавить();
				НоваяСтрока.Номер = ОбработкаНомераТелефона(Элемент.НомерТелефона);
				Если ТипЗнч(Элемент.Месенджер) = тип("число") Тогда 
					НоваяСтрока.ВидМесенджера = Перечисления.ВидыМесендеров.Получить(Элемент.Месенджер);
				КонецЕсли;
			КонецЕсли;

		КонецЦикла;
		
		
		
	КонецЕсли;

КонецПроцедуры

Процедура ОбновитьСкладыКонтрагентов(ТаблицаСкладов,Склад, ТаблицаИД)
	Для Каждого СтрокаДанныеЭлемента Из ТаблицаСкладов Цикл
					  
		ТекСкладОб = Справочники.СкладыКонтрагентов.ПолучитьСсылку(СтрокаДанныеЭлемента.Ссылка).ПолучитьОбъект();
		ТекКонтр = Справочники.Контрагенты.ПолучитьСсылку(СтрокаДанныеЭлемента.Контрагент);

		
		Если ТекСкладОб = Неопределено Тогда 
			ТекСкладОб = Справочники.СкладыКонтрагентов.СоздатьЭлемент();	
			ТекСкладОб.УстановитьСсылкуНового(Справочники.СкладыКонтрагентов.ПолучитьСсылку(СтрокаДанныеЭлемента.Ссылка));
			ТекСкладОб.мОбменАндроид = Истина;
			ТекСкладОб.Наименование = СтрокаДанныеЭлемента.Наименование;
			ТекСкладОб.Владелец = ТекКонтр;
			ТекСкладОб.СкидатиВАТ = Истина;
			//ТекСкладОб.Записать();
		Иначе
			ТекСкладОб.Наименование = СтрокаДанныеЭлемента.Наименование;
			ТекСкладОб.мОбменАндроид = Истина;
		КонецЕсли;
		Попытка
			ТекСкладОб.Записать();
	
			///////////
			НовСтр = ТаблицаИД.Добавить();
			НовСтр.ИД = СтрокаДанныеЭлемента.ИД;	
		Исключение 
		КонецПопытки;
	КонецЦикла;	
КонецПроцедуры

Функция УдалитьРегистрацию(МассивИД,ПарольВхода) Экспорт
	
	ОбменАндроид.УдалитьРегистрациюПоИД(Десериализовать(МассивИД),ПарольВхода);
	
	ОбменАндроид.ВключитьЧастичныйОбмен(ПарольВхода);
	Возврат Истина;
	
КонецФункции

Функция ВключитьЧастичныйОбмен(ПарольВхода) Экспорт
	
	ОбменАндроид.ВключитьЧастичныйОбмен(ПарольВхода);
	
	Возврат Истина;
	
КонецФункции

Функция ПолучитьДолгПартенра(ПарольВхода) Экспорт	
	ВОЗВРАТ 0; 
КонецФункции

Процедура СоздатьПКО(МассивДокументов, ТаблицаИД, МассивОшибок) Экспорт;
	//НомОб = Справочники.ХранилищеДополнительнойИнформации.НайтиПоНаименованию("Тест").ПолучитьОбъект();
	//НомОб.Хранилище = Новый ХранилищеЗначения(МассивДокументов);
	//НомОб.Записать();
	Для Каждого Элемент Из МассивДокументов Цикл
		Если Элемент.ПометкаУдаления Тогда 
			Продолжить;
		КонецЕсли;
		РеализицияОбъект = Неопределено;
		ОшибкаТранзакции = Ложь;
		//НачатьТранзакцию();
		Реализация 		= Документы.РеализацияТоваровУслуг.ПолучитьСсылку(Новый УникальныйИдентификатор(Элемент.Реализация_УИД));
		Попытка
			Если Реализация.ПолучитьОбъект() = Неопределено Тогда 
				Реализация = Документы.РеализацияТоваровУслуг.ПустаяСсылка();
			КонецЕсли;
		Исключение
		КонецПопытки;
		
		МаршрутныйЛист 	= Документы.МаршрутныйЛист.ПолучитьСсылку(Новый УникальныйИдентификатор(Элемент.МаршрутныйЛист_УИД));
		
		Если ВозвратПоЗакритомуМаршрутнику(МаршрутныйЛист, Элемент.ИД, ТаблицаИД) Тогда 
			Продолжить;
		КонецЕсли;
		
		ЗаказПокупателя 				= Документы.ЗаказПокупателя.ПолучитьСсылку(Новый УникальныйИдентификатор(Элемент.ЗаказПокупателя_УИД));
		БакновскийСчет 					= Справочники.БанковскиеСчета.ПолучитьСсылку(Новый УникальныйИдентификатор(Элемент.БанковскийСчет_УИД));
		СтатьяДвиженияДенежныхСредств   = Справочники.СтатьиДвиженияДенежныхСредств.ПолучитьСсылку(Новый УникальныйИдентификатор(Элемент.СтатьяДвиженияДенежныхСредств_УИД));
		Если Не Реализация.Пустая() Тогда  //перевіряю чи ПКО на основі реалізації зроблений
			РеализицияОбъект = Реализация.ПолучитьОбъект();
			Если РеализицияОбъект = Неопределено Тогда        // Значить була створена по іншому - шукаєм реалізацію
				
		
			Если ЗначениеЗаполнено(ЗаказПокупателя) Тогда // ШукаємРеалізаціюПоЗаказу 
				ЗапросРеализации = Новый Запрос;
				ЗапросРеализации.Текст = 
				"ВЫБРАТЬ
				|	РеализацияТоваровУслуг.Ссылка
				|ИЗ
				|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
				|ГДЕ
				|	РеализацияТоваровУслуг.Сделка = &Сделка
				|	И НЕ РеализацияТоваровУслуг.ПометкаУдаления
				|	И РеализацияТоваровУслуг.Контрагент = &Контрагент";
				ЗапросРеализации.УстановитьПараметр("Сделка", ЗаказПокупателя);
				ЗапросРеализации.УстановитьПараметр("Контрагент", ЗаказПокупателя.Контрагент);
				ВыборкаЗапросаРеализации = ЗапросРеализации.Выполнить().Выбрать();
				Если ВыборкаЗапросаРеализации.Следующий() И ЗначениеЗаполнено(ЗаказПокупателя) Тогда  // Чи була раніше створена реалізація
					Реализация = ВыборкаЗапросаРеализации.Ссылка;
					РеализицияОбъект = Реализация.ПолучитьОбъект();
					Если РеализицияОбъект = Неопределено Тогда 
						МассивОшибок.Добавить("Не знайдена реалізація в 1С для оплати " + ЗаказПокупателя.Контрагент);
						Продолжить;
					КонецЕсли;	
				Иначе 
					МассивОшибок.Добавить("Не знайдена реалізація в 1С для оплати " + ЗаказПокупателя.Контрагент);
					Продолжить;
				КонецЕсли; 
			КонецЕсли;
			
			
		
				

			КонецЕсли;
			Контрагент = РеализицияОбъект.Контрагент;
			Если НЕ ЗначениеЗаполнено(ЗаказПокупателя) Тогда 
				ЗаказПокупателя = РеализицияОбъект.Сделка;
			КонецЕсли;
			
		Иначе 
			
			Контрагент = Справочники.Контрагенты.ПолучитьСсылку(Новый УникальныйИдентификатор(Элемент.Контрагент_УИД));
		КонецЕсли;
		
		//intrata_wald_22112021 ↓
		СумаUAH_Безнал = 0;
		Попытка
			СумаUAH_Безнал = Элемент.СумаUAH_Безнал;
		Исключение
		КонецПопытки;
		
		СтруктураВалют = Новый Структура("СумаUAH,СумаEUR,СумаUSD", 
		Справочники.Валюты.НайтиПоКоду("980"),
		Справочники.Валюты.НайтиПоКоду("978"),
		Справочники.Валюты.НайтиПоКоду("840"));

		Суми = Новый Соответствие;
		Суми.Вставить("СумаUAH", Элемент.СумаUAH);
		Суми.Вставить("СумаEUR", Элемент.СумаEUR); 
		Суми.Вставить("СумаUSD", Элемент.СумаUSD);
		Ссилки = Новый Соответствие;
		Ссилки.Вставить("СумаUAH", "УИДГРН");
		Ссилки.Вставить("СумаEUR", "ПКО_УИД"); 
		Ссилки.Вставить("СумаUSD", "УИДUSD");

		Курси = Новый Соответствие;
		Курси.Вставить(СтруктураВалют.СумаUAH, 1);
		Курси.Вставить(СтруктураВалют.СумаEUR, Элемент.КурсEUR); 
		Курси.Вставить(СтруктураВалют.СумаUSD, Элемент.КурсUSD);

		
		Если СумаUAH_Безнал > 0 Тогда
			//--
			//ТипКассовогоОрдера = "ПлатежноеПоручениеВходящее";
			//--
			
			//Если Элемент.ВидДвижения = "Приход" Тогда
			//	ТипКассовогоОрдера = "ПриходныйКассовыйОрдер";
			//ИначеЕсли Элемент.ВидДвижения = "Расход" Тогда
			//	ТипКассовогоОрдера = "РасходныйКассовыйОрдер";
			//КонецЕсли; 			
			
			
			//Попытка
			//	НайденныйОрдер = Документы[ТипКассовогоОрдера].ПолучитьСсылку(Элемент["УИДГРН"]).ПолучитьОбъект();
			//Исключение
			//	НайденныйОрдер = Документы[ТипКассовогоОрдера].ПолучитьСсылку(Элемент["ПКО_УИД"]).ПолучитьОбъект();
			//КонецПопытки;
			
			//++
			Если Элемент.ВидДвижения = "Приход" Тогда
				ТипКассовогоОрдера = "ПлатежноеПоручениеВходящее"; 				
				Попытка
					НайденныйОрдер = Документы[ТипКассовогоОрдера].ПолучитьСсылку(Элемент["УИДГРН"]).ПолучитьОбъект();
				Исключение
					НайденныйОрдер = Документы[ТипКассовогоОрдера].ПолучитьСсылку(Элемент["ПКО_УИД"]).ПолучитьОбъект();
				КонецПопытки;     			
				
			ИначеЕсли Элемент.ВидДвижения = "Расход" Тогда
				ТипКассовогоОрдера = "ПлатежноеПоручениеИсходящее";  				
				Попытка
					НайденныйОрдер = Документы[ТипКассовогоОрдера].ПолучитьСсылку(Элемент["ПКО_УИД"]).ПолучитьОбъект();
				Исключение
					НайденныйОрдер = Документы[ТипКассовогоОрдера].ПолучитьСсылку(Элемент["УИДГРН"]).ПолучитьОбъект();	
				КонецПопытки;
			
			КонецЕсли;		
			//++
			
			
			
			Если НайденныйОрдер = Неопределено Тогда
				НовоеППВ = Документы[ТипКассовогоОрдера].СоздатьДокумент();
				НовоеППВ.УстановитьСсылкуНового(Документы[ТипКассовогоОрдера].ПолучитьСсылку(Элемент["ПКО_УИД"]));
				НовоеППВ.Заполнить(Реализация);
				НовоеППВ.ОтраженоВОперУчете = Истина;
				НовоеППВ.Дата = ТекущаяДата();
				НовоеППВ.ДатаОплаты = Элемент.Дата;
				НовоеППВ.Организация = Справочники.Организации.НайтиПоКоду("000000001");	
				НовоеППВ.Контрагент = Контрагент;
				НовоеППВ.ОтраженоВОперУчете = Истина;
				НовоеППВ.ДоговорКонтрагента = ПолучитьДоговорКонтрагента(Контрагент, ЗаказПокупателя);
				Если ЗначениеЗаполнено(БакновскийСчет) Тогда
					НовоеППВ.СчетОрганизации = БакновскийСчет
				Иначе	
					НовоеППВ.СчетОрганизации = НовоеППВ.Организация.ОсновнойБанковскийСчет;
				КонецЕсли;
				
				Если Элемент.ВидДвижения = "Приход" Тогда
					НовоеППВ.ВидОперации = Перечисления.ВидыОперацийПоступлениеБезналичныхДенежныхСредств.ОплатаПокупателя;
				Иначе
					НовоеППВ.ВидОперации = Перечисления.ВидыОперацийППИсходящее.ПрочееСписаниеБезналичныхДенежныхСредств;
				КонецЕсли;	
				
				НовоеППВ.ВалютаДокумента = Справочники.Валюты.НайтиПоКоду("980");
				НовоеППВ.СуммаДокумента = СумаUAH_Безнал;
				НовоеППВ.Оплачено = Истина;
				НовоеППВ.МаршрутныйЛист = МаршрутныйЛист;

				НовоеППВ.Комментарий = "Створено при загрузці з додатку для Касового ордеру №" + Элемент.Номер;
				НовоеППВ.КурсEUR =  Курси[Константы.ВалютаУправленческогоУчета.Получить()];
				НовоеППВ.КурсUSD =  Курси[СтруктураВалют.СумаUSD];

				
				Если НЕ НовоеППВ.РасшифровкаПлатежа.Количество() Тогда
					РасшифровкаППВ = НовоеППВ.РасшифровкаПлатежа.Добавить();
				Иначе 
					РасшифровкаППВ = НовоеППВ.РасшифровкаПлатежа[0];
				КонецЕсли;
				РасшифровкаППВ.ДоговорКонтрагента = НовоеППВ.ДоговорКонтрагента;
				РасшифровкаППВ.Сделка = ЗаказПокупателя;
				РасшифровкаППВ.ДокументРасчетовСКонтрагентом = Реализация;
				РасшифровкаППВ.СуммаПлатежа = НовоеППВ.СуммаДокумента;
				РасшифровкаППВ.КурсВзаиморасчетов = Курси[РасшифровкаППВ.ДоговорКонтрагента.ВалютаВзаиморасчетов];
				
				
				Если Элемент.ВидДвижения = "Приход" Тогда

					Попытка
						КурсПКО  = Число(Курси[НовоеППВ.ВалютаДокумента]);
						КурсДоговора = Число(Курси[РасшифровкаППВ.ДоговорКонтрагента.ВалютаВзаиморасчетов]);
					Исключение
						ЗаписьЖурналаРегистрации("создание ППВ из мобильного приложения",,, "" + Контрагент + Символы.ПС + ОписаниеОшибки());
					КонецПопытки;
					
					РасшифровкаППВ.СуммаВзаиморасчетов = НовоеППВ.СуммаДокумента * КурсПКО / КурсДоговора;
					
					
					РасшифровкаППВ.СтатьяДвиженияДенежныхСредств = Справочники.СтатьиДвиженияДенежныхСредств.ОплатаПокупателя;
					НовоеППВ.СтатьяДвиженияДенежныхСредств = Справочники.СтатьиДвиженияДенежныхСредств.ОплатаПокупателя;					
					
					
				Иначе	
					РасшифровкаППВ.СуммаВзаиморасчетов = НовоеППВ.СуммаДокумента;
					РасшифровкаППВ.СтатьяДвиженияДенежныхСредств = СтатьяДвиженияДенежныхСредств;
					НовоеППВ.СтатьяДвиженияДенежныхСредств = СтатьяДвиженияДенежныхСредств;
				КонецЕсли;	
		
				Попытка
					НовоеППВ.Записать(РежимЗаписиДокумента.Запись);
					НовоеППВ.Записать(РежимЗаписиДокумента.Проведение);
				Исключение
					ЗаписьЖурналаРегистрации("создание ППВ из мобильного приложения",,, ОписаниеОшибки());
				КонецПопытки;
			КонецЕсли;
		КонецЕсли;

		
		
		Для Каждого ЭлементСтуркутуры Из СтруктураВалют Цикл 
			СуммаПКО = Суми[ЭлементСтуркутуры.Ключ];  
			КурсПКО  = Курси[ЭлементСтуркутуры.Значение];
			
//ЗаписьЖурналаРегистрации("ПКО_ОБМЕН_ТЕСТ", УровеньЖурналаРегистрации.Информация,,,"" + СуммаПКО + " - " + ЭлементСтуркутуры.Ключ);
//ЗаписьЖурналаРегистрации("ПКО_ОБМЕН_ТЕСТ", УровеньЖурналаРегистрации.Информация,,,"!!!" + Элемент.СумаUAH + " - " + Элемент.СумаEUR + " - " + Элемент.СумаUSD + " - " + Элемент.СумаUAH_Безнал);

			Если Не ЗначениеЗаполнено(СуммаПКО) Тогда 
				Продолжить;
			КонецЕсли;
			ТекПКОУИД = Ссилки[ЭлементСтуркутуры.Ключ];
			Если Элемент.ВидДвижения = "Приход" Тогда 
				Попытка			
					//ЗаписьЖурналаРегистрации("ОБМЕН_ПКО", УровеньЖурналаРегистрации.Примечание, ,,"" + Элемент[ТекПКОУИД] + " " + СокрЛП(Документы.ПриходныйКассовыйОрдер.ПолучитьСсылку(Элемент[ТекПКОУИД])));
					ПКО = Документы.ПриходныйКассовыйОрдер.ПолучитьСсылку(Элемент[ТекПКОУИД]).ПолучитьОбъект();
					
					

				Исключение
					ТекПКОУИД = "ПКО_УИД";
					ПКО = Документы.ПриходныйКассовыйОрдер.ПолучитьСсылку(Элемент[ТекПКОУИД]).ПолучитьОбъект();
				КонецПопытки;
				
				Если ПКО = Неопределено Тогда 
					ПКО = Документы.ПриходныйКассовыйОрдер.СоздатьДокумент();
					ПКО.ОтражатьВУправленческомУчете = Истина;
					ПКО.ВидОперации = Перечисления.ВидыОперацийПКО.ОплатаПокупателя;
					ПКО.Заполнить(Реализация);
					ПКО.УстановитьСсылкуНового(Документы.ПриходныйКассовыйОрдер.ПолучитьСсылку(Элемент[ТекПКОУИД]));
					Если РеализицияОбъект = Неопределено Тогда 
						ПКО.Контрагент = Контрагент;
						ПКО.ДоговорКонтрагента = ПолучитьДоговорКонтрагента(Контрагент, ЗаказПокупателя);
						ПКО.Организация = Справочники.Организации.НайтиПоКоду("000000001");								
					КонецЕсли;
				КонецЕсли;
			Иначе 
				
				Попытка
					//ЗаписьЖурналаРегистрации("ОБМЕН_ПКО", УровеньЖурналаРегистрации.Примечание, ,,"" + Элемент[ТекПКОУИД] + " " + СокрЛП(Документы.РасходныйКассовыйОрдер.ПолучитьСсылку(Элемент[ТекПКОУИД])));
					ПКО = Документы.РасходныйКассовыйОрдер.ПолучитьСсылку(Элемент[ТекПКОУИД]).ПолучитьОбъект();
					

				Исключение  
					ТекПКОУИД = "ПКО_УИД";
					ПКО = Документы.РасходныйКассовыйОрдер.ПолучитьСсылку(Элемент[ТекПКОУИД]).ПолучитьОбъект();
				КонецПопытки;


				Если ПКО = Неопределено Тогда 				
					ПКО = Документы.РасходныйКассовыйОрдер.СоздатьДокумент(); 					
					ПКО.ОтражатьВУправленческомУчете = Истина;
					
					Если Элемент.Сдача Тогда
						ПКО.ВидОперации 		= Перечисления.ВидыОперацийРКО.ВозвратДенежныхСредствПокупателю;
						ПКО.Заполнить(Реализация);
					Иначе 
						ПКО.ВидОперации = Перечисления.ВидыОперацийРКО.РасходДенежныхСредствПрочее;
						ПКО.Заполнить(Документы.РеализацияТоваровУслуг.ПустаяСсылка());
					КонецЕсли;
					
					ПКО.УстановитьСсылкуНового(Документы.РасходныйКассовыйОрдер.ПолучитьСсылку(Элемент[ТекПКОУИД]));
					
					Если Элемент.Сдача Тогда
						Если РеализицияОбъект = Неопределено Тогда 
							ПКО.Контрагент = Контрагент;
							ПКО.ДоговорКонтрагента = ПолучитьДоговорКонтрагента(Контрагент, ЗаказПокупателя);
							ПКО.Организация = Справочники.Организации.НайтиПоКоду("000000001");								
						КонецЕсли;
					Иначе
						ПКО.Организация = Справочники.Организации.НайтиПоКоду("000000001");														
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			ПКО.КурсEUR =  Курси[Константы.ВалютаУправленческогоУчета.Получить()];
			ПКО.КурсUSD =  Курси[СтруктураВалют.СумаUSD];
		    ПКО.КурсДокумента =  Курси[ЭлементСтуркутуры.Значение];

			ПКО.ОтражатьВБухгалтерскомУчете = Ложь;
			ПКО.ОтражатьВУправленческомУчете = Истина;
			ПКО.Дата 			= ТекущаяДата();
			ПКО.Касса 			= Справочники.Кассы.НайтиПоРеквизиту("ВалютаДенежныхСредств", ЭлементСтуркутуры.Значение);
			ПКО.Основание 		= Реализация;
			ПКО.МаршрутныйЛист 	= МаршрутныйЛист;			
			ПКО.ВалютаДокумента = ЭлементСтуркутуры.Значение;
			ПКО.СуммаДокумента 	= СуммаПКО;
			
			
			
			Если ПКО.РасшифровкаПлатежа.Количество()  Тогда 
				РасшифровкаПлатежа 						= ПКО.РасшифровкаПлатежа[0];
				РасшифровкаПлатежа.ДоговорКонтрагента 	= ПКО.ДоговорКонтрагента;
			Иначе 	
				РасшифровкаПлатежа 						= ПКО.РасшифровкаПлатежа.Добавить();
				РасшифровкаПлатежа.ДоговорКонтрагента 	= ПКО.ДоговорКонтрагента;
			КонецЕсли;	
			Если РасшифровкаПлатежа.ДоговорКонтрагента = Справочники.ДоговорыКонтрагентов.ПустаяСсылка() Тогда 
				РасшифровкаПлатежа.ДоговорКонтрагента = Контрагент.ДоговорДляНеплановыхПродаж;
			КонецЕсли;
			
			Если Элемент.Сдача Тогда
				Если РасшифровкаПлатежа.ДоговорКонтрагента.Пустая() Тогда 
					ТексОшибки = "Помилка при обміні оплати №" + Элемент.Номер + " від контрагента " + Контрагент.Наименование + Символы.ПС +
					"Можливо, у контрагента немає договора для непланових продаж.";
					МассивОшибок.Добавить(ТексОшибки);
					//ЗаписьЖурналаРегистрации("ОБМЕН_ПКО", УровеньЖурналаРегистрации.Ошибка,,, ТексОшибки);
					ОшибкаТранзакции = Истина;
					Прервать;
				КонецЕсли;
			КонецЕсли;	
				
			КурсДоговора = Курси[РасшифровкаПлатежа.ДоговорКонтрагента.ВалютаВзаиморасчетов];
			
			//СтруктураКурсаВзаиморасчетов = МодульВалютногоУчета.ПолучитьКурсВалюты(РасшифровкаПлатежа.ДоговорКонтрагента.ВалютаВзаиморасчетов, ТекущаяДата());
			РасшифровкаПлатежа.Сделка = ЗаказПокупателя;
			
			Если Элемент.Сдача Тогда
				//РасшифровкаПлатежа.СтатьяДвиженияДенежныхСредств = ?(Элемент.ВидДвижения = "Приход", Справочники.СтатьиДвиженияДенежныхСредств.ОплатаПокупателя, Справочники.СтатьиДвиженияДенежныхСредств.ВозвратДенежныхСредствПокупателю);
				РасшифровкаПлатежа.СтатьяДвиженияДенежныхСредств = Справочники.СтатьиДвиженияДенежныхСредств.ВозвратДенежныхСредствПокупателю;
				РасшифровкаПлатежа.КурсВзаиморасчетов      = КурсДоговора;
			Иначе	
				Если Элемент.ВидДвижения = "Приход" Тогда
					РасшифровкаПлатежа.СтатьяДвиженияДенежныхСредств = Справочники.СтатьиДвиженияДенежныхСредств.ОплатаПокупателя;
				Иначе	
					РасшифровкаПлатежа.СтатьяДвиженияДенежныхСредств = СтатьяДвиженияДенежныхСредств;
				КонецЕсли;	
				РасшифровкаПлатежа.КурсВзаиморасчетов      = КурсПКО;
			КонецЕсли;	
			
			
			
			РасшифровкаПлатежа.КратностьВзаиморасчетов = 1;
			РасшифровкаПлатежа.СуммаПлатежа = СуммаПКО;
			//ЗаписьЖурналаРегистрации("ОБМЕН_ОПЛАТАМИ", УровеньЖурналаРегистрации.Информация, ,,"" + СуммаПКО + " - " + Курси.Получить(ПКО.ВалютаДокумента)  + " - " +  Курси.Получить(РасшифровкаПлатежа.ДоговорКонтрагента.ВалютаВзаиморасчетов)  + " - " + РасшифровкаПлатежа.ДоговорКонтрагента);
			Попытка
				Если Элемент.Сдача Тогда
					РасшифровкаПлатежа.СуммаВзаиморасчетов = СуммаПКО * КурсПКО / КурсДоговора;
					//                                                  валюта док    Євро
				Иначе
					РасшифровкаПлатежа.СуммаВзаиморасчетов = СуммаПКО;			
					ПКО.ОтраженоВОперУчете = Истина;
					ПКО.Оплачено = Истина;					
				КонецЕсли;	
				
			Исключение
				ВызватьИсключение "Невозможно выгрузить оплату. Возможно у контрагента нету договора с покупателем!";
			КонецПопытки;
			//РасшифровкаПлатежа.СуммаВзаиморасчетов = Ценообразование.ПересчитатьЦенуПриИзмененииВалюты(СуммаПКО, ЭлементСтуркутуры.Значение, РасшифровкаПлатежа.ДоговорКонтрагента.ВалютаВзаиморасчетов);

			
			Попытка	
				ПКО.Записать(РежимЗаписиДокумента.Запись);
				Если НЕ ПКО.ПометкаУдаления Тогда  
					ПКО.Записать(РежимЗаписиДокумента.Проведение);
				КонецЕсли;
			Исключение
				ЗаписьЖурналаРегистрации("ОБМЕН_ПКО", УровеньЖурналаРегистрации.Ошибка, ,,ОписаниеОшибки());
				ОшибкаТранзакции = Истина;
				
				Продолжить;
			КонецПопытки;

		КонецЦикла;     
		
		Если ЗначениеЗаполнено(Элемент.КоректировкаДолга) Тогда 
			Попытка
				Ссылка = Документы.КорректировкаДолга.ПолучитьСсылку(Элемент.УИДКоректировки);
				Если ПустаяСтрока(Ссылка.ВерсияДанных) Тогда 
					Документ = Документы.КорректировкаДолга.СоздатьДокумент();
					Документ.УстановитьСсылкуНового(Ссылка);
				Иначе 
					Документ = Ссылка.ПолучитьОбъект();
				КонецЕсли;				
			Исключение
				Документ = Документы.КорректировкаДолга.СоздатьДокумент();
				
			КонецПопытки;
			
			Документ.Организация 		= Справочники.Организации.НайтиПоКоду("000000001");
			Документ.КонтрагентДебитор 	= Контрагент;
			Документ.ВалютаДокумента 	= Справочники.Валюты.НайтиПоКоду("978"); 
			Документ.Дата 				= ТекущаяДата();
			СтруктураВалюта    			= МодульВалютногоУчета.ПолучитьКурсВалюты(Документ.ВалютаДокумента, Документ.Дата);
			Документ.КурсДокумента      = СтруктураВалюта.Курс;
			Документ.КратностьДокумента = СтруктураВалюта.Кратность;
			Документ.ОтражатьВУправленческомУчете = Истина;

			Документ.ВидОперации = Перечисления.ВидыОперацийКорректировкаДолга.СписаниеЗадолженности;
			Документ.СуммыДолга.Очистить();
			ДОЛГ = Документ.СуммыДолга.Добавить();
			Долг.ДоговорКонтрагента = Контрагент.ДоговорДляНеплановыхПродаж;
			Если Элемент.КоректировкаДолга > 0 Тогда  
				ДОЛГ.ВидЗадолженности 		= Перечисления.ВидыЗадолженности.Дебиторская;
				ДОЛГ.Сумма 					= Элемент.КоректировкаДолга;
			Иначе
				ДОЛГ.ВидЗадолженности 		= Перечисления.ВидыЗадолженности.Кредиторская ;
				ДОЛГ.Сумма 					= - Элемент.КоректировкаДолга;
				
			КонецЕсли;
			ДОЛГ.ТипКонтрагента 			= Перечисления.СтатусыКонтрагентов.Покупатель;
			ДОЛГ.КурсВзаиморасчетов 		= Документ.КурсДокумента;
			ДОЛГ.КратностьВзаиморасчетов 	= Документ.КратностьДокумента;
			ДОЛГ.СуммаРегл 					= ДОЛГ.Сумма * ДОЛГ.КурсВзаиморасчетов;
			
			Попытка 
				Документ.Записать(РежимЗаписиДокумента.Запись);
				Документ.Записать(РежимЗаписиДокумента.Проведение);
			Исключение ОшибкаТранзакции = Истина;
			КонецПопытки;
			
		КонецЕсли;
		
		
		Если ОшибкаТранзакции Тогда
			ЗаписьЖурналаРегистрации("ОБМЕН", УровеньЖурналаРегистрации.Ошибка, ,,ОписаниеОшибки());

			//ОтменитьТранзакцию();
		Иначе 

			НовСтр 		= ТаблицаИД.Добавить();
			НовСтр.ИД 	= Элемент.ИД;

		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

//Процедура Лог(Текст)
//	ЗаписьЖурналаРегистрации("ОБМЕН_ПКО", УровеньЖурналаРегистрации.Примечание, ,,Текст);
//КонецПроцедуры


Функция ПолучитьДоговорКонтрагента(Контрагент, Заказ)
	Если НЕ ЗначениеЗаполнено(Заказ) Тогда 
		Возврат Контрагент.ДоговорДляНеплановыхПродаж;
	Иначе 
		Возврат Контрагент.ОсновнойДоговорКонтрагента;
	КонецЕсли;
КонецФункции


Функция ЗакрытьСтарыеЗаказы(ПарольВхода, Товары, Контрагент_уид) Экспорт 
	
	Продавец = ОбменАндроид.ПолучитьПродавцаПоКодуПартнера(ПарольВхода);
	Если Не ЗначениеЗаполнено(Продавец) Тогда
		Возврат "по такому паролю входа не найден продавец";
	КонецЕсли;
	
	Контрагент = Справочники.Контрагенты.ПолучитьСсылку(Контрагент_уид.Получить());
	Если ПустаяСтрока(Контрагент.ВерсияДанных) Тогда
		Возврат "по такому уникальному идентификатору не найден контрагент";
	КонецЕсли;
	
	ТЗ_Товары = Товары.Получить();
	
	Если Не ТЗ_Товары.Количество() Тогда
		Возврат "Пустая таблица";
	КонецЕсли;
	НачатьТранзакцию();

	//ДобавитьВЗаказ = ТЗ_Товары.НайтиСтроки(Новый Структура("ДобавитьВЗаказ", Истина));
	//	//Если ДобавитьВЗаказ.Количество() Тогда 
	//	мЗаказ =  Документы.ЗаказПокупателя.ПолучитьСсылку(ДобавитьВЗаказ[0].Заказ_уид);
	//	мЗаказ.Скопировать();
	//	
	//	НовыйЗаказ = мЗаказ.Скопировать();
	//	НовыйЗаказ.Товары.Очистить();
	//	//ЗаполнитьЗначенияСвойств(НовыйЗаказ, мЗаказ);
	//	НовыйЗаказ.Контрагент = Контрагент;
	//	НовыйЗаказ.ТорговийАгент = Продавец;
	//	НовыйЗаказ.ДоговорКонтрагента = Контрагент.ОсновнойДоговорКонтрагента;
	//	НовыйЗаказ.Организация = Справочники.Организации.НайтиПоКоду("000000001");
	//	
	//	НовыйЗаказ.ВалютаДокумента = Контрагент.ОсновнойДоговорКонтрагента.ВалютаВзаиморасчетов;
	//	ДанныеКурсВалют = МодульВалютногоУчета.ПолучитьКурсВалюты(НовыйЗаказ.ВалютаДокумента, ТекущаяДата());
	//	НовыйЗаказ.КурсВзаиморасчетов = ДанныеКурсВалют.курс;
	//	НовыйЗаказ.КратностьВзаиморасчетов = ДанныеКурсВалют.Кратность;
	//	НовыйЗаказ.ТипЦен = НовыйЗаказ.ДоговорКонтрагента.ТипЦен;
	//	НовыйЗаказ.СтатусЗамовлення = Справочники.СтатусиЗамовлень.Новий;
	//	НовыйЗаказ.Дата = ТекущаяДата();
	//	НовыйЗаказ.ДатаОтгрузки = КонецДня(ТекущаяДата())+1;
	//	НовыйЗаказ.ДатаОплаты = НовыйЗаказ.ДатаОтгрузки;
	//	НовыйЗаказ.Комментарий = "создано с помощью механизма закрытия старых заказов.";
	//	
	//	
	//	Для Каждого СтрокаТЗ Из ДобавитьВЗаказ Цикл
	//		СтрокаТов = НовыйЗаказ.Товары.Добавить();
	//		ЗаполнитьЗначенияСвойств(СтрокаТов, СтрокаТЗ, "Цена, Количество, Сумма");
	//		СтрокаТов.Номенклатура = Справочники.Номенклатура.ПолучитьСсылку(СтрокаТЗ.Номенклатура_уид);
	//		СтрокаТов.ЕдиницаИзмерения = СтрокаТов.Номенклатура.ЕдиницаХраненияОстатков;
	//	КонецЦикла;
	//	
	//	Попытка
	//		НовыйЗаказ.Записать(РежимЗаписиДокумента.Проведение);
	//	Исключение
	//		ОтменитьТранзакцию();
	//		Возврат ОписаниеОшибки();
	//	КонецПопытки;
	//	
	//КонецЕсли;	
	
	
	ТЗ_Товары.Свернуть("Заказ_уид");
	
	Закрытие = Документы.ЗакрытиеЗаказовПокупателей.СоздатьДокумент();
	Закрытие.ВидОперации = Перечисления.ВидыОперацийЗакрытиеЗаказовПокупателей.ЗакрытиеЗаказов;
	Закрытие.Дата = ТекущаяДата();
	Закрытие.Комментарий = "создано с помощью механизма закрытия старых заказов.";
	
	Для Каждого Строка Из ТЗ_Товары Цикл
		мЗаказ =  Документы.ЗаказПокупателя.ПолучитьСсылку(Строка.Заказ_уид);
		Если ПустаяСтрока(мЗаказ.ВерсияДанных) Тогда 
			Продолжить;
		КонецЕсли;
		Закрытие.Заказы.Добавить().ЗаказПокупателя = мЗаказ;
	КонецЦикла;
	
	Если Закрытие.Заказы.Количество() Тогда 
		Закрытие.Записать(РежимЗаписиДокумента.Проведение);
	КонецЕсли;
	ЗафиксироватьТранзакцию();
	
	Возврат "";
	
КонецФункции

Функция ЗакрытьСтарыеЗаказы_v1(ПарольВхода, Товары, Контрагент_уид) Экспорт //taras
	
	Продавец = ОбменАндроид.ПолучитьПродавцаПоКодуПартнера(ПарольВхода);
	Если Не ЗначениеЗаполнено(Продавец) Тогда
		Возврат "по такому паролю входа не найден продавец";
	КонецЕсли;
	
	Контрагент = Справочники.Контрагенты.ПолучитьСсылку(Контрагент_уид.Получить());
	Если ПустаяСтрока(Контрагент.ВерсияДанных) ИЛИ НЕ ЗначениеЗаполнено(Контрагент) Тогда
		Возврат "по такому уникальному идентификатору не найден контрагент";
	КонецЕсли;
	
	ТЗ_Товары = Товары.Получить();
	ТЗ_Товары.Колонки.Добавить("Заказ",Новый ОписаниеТипов("ДокументСсылка.ЗаказПокупателя"));
	ТЗ_Товары.Колонки.Добавить("Номенклатура",Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ТЗ_Товары.Колонки.Добавить("ХарактеристикаНоменклатуры",Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры"));
	
	//імпортовано і перероблено з обробки ЗакрытиеСтарыхЗаказов
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ЗаказыПокупателейОстатки.Цена,
		|	ЗаказыПокупателейОстатки.ЗаказПокупателя.Организация КАК Организация,
		|	ЗаказыПокупателейОстатки.ЗаказПокупателя.ВалютаДокумента КАК ВалютаДокумента,
		|	ЗаказыПокупателейОстатки.ЗаказПокупателя.ДоговорКонтрагента КАК ДоговорКонтрагента,
		|	ЗаказыПокупателейОстатки.ЗаказПокупателя.КратностьВзаиморасчетов КАК КратностьВзаиморасчетов,
		|	ЗаказыПокупателейОстатки.ЗаказПокупателя.СкладГруппа КАК СкладГруппа
		|ИЗ
		|	РегистрНакопления.ЗаказыПокупателей.Остатки(
		|			,
		|			ЗаказПокупателя.Контрагент = &Контрагент
		|				И ЗаказПокупателя.Торговийагент = &Продавец) КАК ЗаказыПокупателейОстатки
		|ГДЕ
		|	ЗаказыПокупателейОстатки.КоличествоОстаток > 0";
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.УстановитьПараметр("Продавец", Продавец);
	Выборка = Запрос.Выполнить().Выбрать();
	
	НачатьТранзакцию();
	Если ТЗ_Товары.Количество() > 0 Тогда
		НовыйЗаказ = Документы.ЗаказПокупателя.СоздатьДокумент();
		НовыйЗаказ.Контрагент = Контрагент;
		НовыйЗаказ.ТорговийАгент = Продавец;
		НовыйЗаказ.Дата = ТекущаяДата();
		НовыйЗаказ.Комментарий = "создано с помощью механизма закрытия старых заказов.";
		Если Выборка.Следующий() Тогда
			ЗаполнитьЗначенияСвойств(НовыйЗаказ, Выборка);
		Иначе
			ОтменитьТранзакцию();
			Возврат "Не найдено данных.";
		КонецЕсли;
				
		Для Каждого СтрокаТЗ Из ТЗ_Товары Цикл
			СтрокаТЗ.Заказ = Документы.ЗаказПокупателя.ПолучитьСсылку(СтрокаТЗ.Заказ_уид);
			СтрокаТЗ.Номенклатура = Справочники.Номенклатура.ПолучитьСсылку(СтрокаТЗ.Номенклатура_уид);
			СтрокаТЗ.ХарактеристикаНоменклатуры = Справочники.ХарактеристикиНоменклатуры.ПолучитьСсылку(СтрокаТЗ.Характеристика_уид);
		КонецЦикла;
		ТЗ = ТЗ_Товары.Скопировать();
		ТЗ.Свернуть("Номенклатура, ХарактеристикаНоменклатуры, ДобавитьВЗаказ", "Количество, Цена, Сумма");
		
		Для Каждого СтрокаТЗ Из ТЗ Цикл
			Если СтрокаТЗ.ДобавитьВЗаказ Тогда
				СтрокаТов = НовыйЗаказ.Товары.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаТов, СтрокаТЗ, "Номенклатура, ХарактеристикаНоменклатуры, Цена, Количество, Сумма");
				СтрокаТов.ЕдиницаИзмерения = СтрокаТов.Номенклатура.ЕдиницаХраненияОстатков;
			КонецЕсли;
		КонецЦикла;
		
		Если НЕ НовыйЗаказ.Товары.Количество() Тогда
			Возврат "В заказе нет товаров";
		КонецЕсли;
		
		Попытка
			НовыйЗаказ.Записать();
			НовыйЗаказ.Записать(РежимЗаписиДокумента.Проведение);
		Исключение
			ОтменитьТранзакцию();
			Возврат ОписаниеОшибки();
		КонецПопытки;
		
		ТЗ = ТЗ_Товары.Скопировать();
		ТЗ.Свернуть("Заказ");
		Для Каждого Строка Из ТЗ Цикл
			Если НЕ Строка.Заказ.Пустая() Тогда
				Закрытие = Документы.ЗакрытиеЗаказовПокупателей.СоздатьДокумент();
				Закрытие.Заполнить(Строка.Заказ);
				Закрытие.Дата = ТекущаяДата();
				Закрытие.Комментарий = "создано с помощью механизма закрытия старых заказов.";
				Попытка
					Закрытие.Записать();
					Закрытие.Записать(РежимЗаписиДокумента.Проведение);
				Исключение
					ОтменитьТранзакцию();
					Возврат ОписаниеОшибки();
				КонецПопытки;
			КонецЕсли;
		КонецЦикла;
	Иначе
		ОтменитьТранзакцию();
		Возврат "Пустая таблица";
	КонецЕсли;
	ЗафиксироватьТранзакцию();
	
	Возврат "";
	
КонецФункции



Процедура СоздатьМаршрутныеЛистыТовары(ТаблицаВозвратов, Продавец, ТаблицаИД, НеХватает = Неопределено)
	
	МассивДокументов 	= Новый Массив;         
	ИмяДок 				= "МаршрутныйЛист";
	ТекущаяСсылка 		= "";
	ТорговыйАгент 		= Продавец;
	ТекИД 				= Неопределено;
	НеХватает			= Новый Массив;
	Попытка
		ТаблицаВозвратов.Сортировать("Ссылка");
	Исключение
	КонецПопытки;
	
	ЭтоНовыйМаршрутный = Ложь;
	Для Каждого СтрокаДанныеЭлемента Из ТаблицаВозвратов Цикл
		НовыйОбъект = Документы[ИмяДок].ПолучитьСсылку(СтрокаДанныеЭлемента.Ссылка).ПолучитьОбъект();
		ДобавитьДок = Ложь;
		

		
		Если НовыйОбъект = Неопределено Тогда 
			Если СтрокаДанныеЭлемента.ПометкаУдаления  Тогда 
				Продолжить;
			КонецЕсли;
			НовыйОбъект 				= Документы[ИмяДок].СоздатьДокумент();
			НовыйОбъект.Дата 			= ТекущаяДата();
			НовыйОбъект.Организация 	= Справочники.Организации.НайтиПоКоду("000000001");
			НовыйОбъект.Склад 			= Справочники.Склады.НайтиПоКоду("000000001");
			НовыйОбъект.ДатаПриезда		= СтрокаДанныеЭлемента.ДатаПриезда;
			НовыйОбъект.СтатусДокумента = ?(СтрокаДанныеЭлемента.СтатусДокумента = "Составляется", Перечисления.СтатусыМаршрутногоЛиста.Составляется,
			                       ?(СтрокаДанныеЭлемента.СтатусДокумента = "Отправлен", Перечисления.СтатусыМаршрутногоЛиста.Отправлен,
								   ?(СтрокаДанныеЭлемента.СтатусДокумента = "Завершен", Перечисления.СтатусыМаршрутногоЛиста.Завершен, 
								                                                  Перечисления.СтатусыМаршрутногоЛиста.ПустаяСсылка())));		
			НовыйОбъект.Комментарий = СтрокаДанныеЭлемента.Комментарий;
			НовыйОбъект.УстановитьСсылкуНового(Документы[ИмяДок].ПолучитьСсылку(СтрокаДанныеЭлемента.Ссылка));
			//НовыйОбъект.УстановитьНовыйНомер();
			НовыйОбъект.ТорговийАгент 					= Продавец;
			ТабТоргові = НовыйОбъект.ТорговыеАгенты.Добавить();
			ТабТоргові.ТорговыйАгент                    = Продавец;
			НовыйОбъект.ОтражатьВУправленческомУчете 	= Истина;

			ДобавитьДок 		= Истина;
		Иначе	
			Если ВозвратПоЗакритомуМаршрутнику(НовыйОбъект, СтрокаДанныеЭлемента.ИД, ТаблицаИД) Тогда 
				Продолжить;
			КонецЕсли;

			НовыйОбъект.Записать(РежимЗаписиДокумента.ОтменаПроведения);
		КонецЕсли;
		//////////////////////////////////////////////////////////////////     
		Если ТекущаяСсылка <> СтрокаДанныеЭлемента.Ссылка Тогда 
			Если НовыйОбъект.Заказы.Количество() Тогда 
				ЭтоНовыйМаршрутный = Ложь;
			Иначе 
				ЭтоНовыйМаршрутный = Истина;
			КонецЕсли;
			
		//	НовыйОбъект.Заказы.Очистить();
		//	НовыйОбъект.ТоварыЗаказов.Очистить();
			ТекущаяСсылка = СтрокаДанныеЭлемента.Ссылка;
			Попытка
				Если ЗначениеЗаполнено(ТекИД) Тогда 
					НовСтр = ТаблицаИД.Добавить();
					НовСтр.ИД = ТекИД; 
				КонецЕсли;
				ТекИД = СтрокаДанныеЭлемента.ИД;
			Исключение
			КонецПопытки;
		//	ДобавитьДок = Истина;
		КонецЕсли;
		/////////////////////////////////////////////////////////////////
		НовыйОбъект.ПометкаУдаления = СтрокаДанныеЭлемента.ПометкаУдаления; 
		
		//Шукаэм чи заказ вже э
		ТекЗаказПокупателя = Документы.ЗаказПокупателя.ПолучитьСсылку(СтрокаДанныеЭлемента.ЗаказПокупателя);
		ЗаказВжеЄ =  НовыйОбъект.Заказы.Найти(ТекЗаказПокупателя);
		Если ЗаказВжеЄ = Неопределено Тогда 
			ЗаказВжеЄ = Ложь;
		Иначе 
			ЗаказВжеЄ = Истина;
		КонецЕсли;
				
		// Заказы   // Відключили загрузку
		Если СтрокаДанныеЭлемента.ТабЧасть = "Заказы" И НЕ ЗаказВжеЄ Тогда 
			СтрокаЗаказов = НовыйОбъект.Заказы.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаЗаказов, СтрокаДанныеЭлемента);
			СтрокаЗаказов.ЗаказПокупателя = ТекЗаказПокупателя;
			СтрокаЗаказов.Контрагент 	  = Справочники.Контрагенты.ПолучитьСсылку(СтрокаДанныеЭлемента.Контрагент);
		КонецЕсли;
		
		// Товары заказов
		Если СтрокаДанныеЭлемента.ТабЧасть = "ТоварыЗаказов" И НЕ ЗаказВжеЄ Тогда 
			СтрокаТоваров = НовыйОбъект.ТоварыЗаказов.Добавить();		
			ЗаполнитьЗначенияСвойств(СтрокаТоваров, СтрокаДанныеЭлемента);
			СтрокаТоваров.ЗаказПокупателя 				= ТекЗаказПокупателя;
			СтрокаТоваров.Номенклатура 					= Справочники.Номенклатура.ПолучитьСсылку(СтрокаДанныеЭлемента.Номенклатура);
			СтрокаТоваров.ХарактеристикаНоменклатуры 	= Справочники.ХарактеристикиНоменклатуры.ПолучитьСсылку(СтрокаДанныеЭлемента.ХарактеристикаНоменклатуры);
			Попытка
				СтрокаТоваров.ЕдиницаИзмерения 			= СтрокаТоваров.Номенклатура.ЕдиницаХраненияОстатков;
			Исключение
			КонецПопытки;
			СтрокаТоваров.Сумма 						= СтрокаТоваров.Цена * СтрокаТоваров.Количество;
			СтрокаТоваров.Качество 						= Справочники.Качество.Новый;
		КонецЕсли;
		
		// Завдання
		Если СтрокаДанныеЭлемента.ТабЧасть = "Завдання"  Тогда 
			
			ТекКонтрагент 	  = Справочники.Контрагенты.ПолучитьСсылку(СтрокаДанныеЭлемента.Контрагент);
			
			СтрокаТоваров = НовыйОбъект.Завдання.Найти(ТекКонтрагент);
			Если СтрокаТоваров = Неопределено Тогда 
				  СтрокаТоваров =    НовыйОбъект.Завдання.Добавить();
				  СтрокаТоваров.Контрагент = ТекКонтрагент;
			КонецЕсли;
			СтрокаТоваров.Коментар = СтрокаДанныеЭлемента.Коментар;	
	
		КонецЕсли;

		
		// Загрузка
		Если СтрокаДанныеЭлемента.ТабЧасть = "ЗагрузкаМашины" Тогда 
			ЗаказПокупателя 				= Документы.ЗаказПокупателя.ПолучитьСсылку(СтрокаДанныеЭлемента.ЗаказПокупателя);
			Номенклатура 					= Справочники.Номенклатура.ПолучитьСсылку(СтрокаДанныеЭлемента.Номенклатура);
			ХарактеристикаНоменклатуры 		= Справочники.ХарактеристикиНоменклатуры.ПолучитьСсылку(СтрокаДанныеЭлемента.ХарактеристикаНоменклатуры);			
			СтрокиЗагрузки 					= НовыйОбъект.ЗагрузкаМашины.НайтиСтроки(Новый Структура("ЗаказПокупателя, Номенклатура, ХарактеристикаНоменклатуры", ЗаказПокупателя, Номенклатура, ХарактеристикаНоменклатуры));
			Если СтрокиЗагрузки.Количество() Тогда 
				СтрокаТоваров = СтрокиЗагрузки[0];
			Иначе 
				СтрокаТоваров = НовыйОбъект.ЗагрузкаМашины.Добавить();
			КонецЕсли;				
			ЗаполнитьЗначенияСвойств(СтрокаТоваров, СтрокаДанныеЭлемента);
			СтрокаТоваров.ЗаказПокупателя 				= ЗаказПокупателя;
			СтрокаТоваров.Номенклатура 					= Номенклатура;
			СтрокаТоваров.ХарактеристикаНоменклатуры 	= ХарактеристикаНоменклатуры;
			Попытка
				СтрокаТоваров.ЕдиницаИзмерения 			= СтрокаТоваров.Номенклатура.ЕдиницаХраненияОстатков;
			Исключение
			КонецПопытки;
			СтрокаТоваров.Качество 						= Справочники.Качество.Новый;
		КонецЕсли;		
		
		Попытка
			НовыйОбъект.Записать();
		Исключение
			ЗаписьЖурналаРегистрации("ОшибкаОбмена", УровеньЖурналаРегистрации.Ошибка , , "" ,ОписаниеОшибки());
		КонецПопытки;
		
		Если ДобавитьДок Тогда 
			МассивДокументов.Добавить(НовыйОбъект.Ссылка);
		КонецЕсли;
	КонецЦикла;	
	
	Если ЗначениеЗаполнено(ТекИД) Тогда 
		НовСтр 		= ТаблицаИД.Добавить();
		НовСтр.ИД 	= ТекИД;
	КонецЕсли;
	
	Для Каждого ДокСсылка Из МассивДокументов Цикл
		Если ДокСсылка.ПометкаУдаления Тогда 
			Продолжить;
		КонецЕсли;
		ДокОб = ДокСсылка.ПолучитьОбъект();
		Попытка
			ДокОб.Записать(РежимЗаписиДокумента.Проведение,РежимПроведенияДокумента.Неоперативный);
		Исключение
		КонецПопытки;
	КонецЦикла;
	
	мМаршрут = ТаблицаВозвратов.Скопировать(, "Ссылка");
	мМаршрут.Свернуть( "Ссылка");
	Для Каждого Элемент Из мМаршрут Цикл 
		
		 мСтруктура = Новый Структура;
		 мСтруктура.Вставить("Маршрут", Элемент.Ссылка);
		 мСтруктура.Вставить("НеХватает", ПолучитьТаблицуНеХватаетМаршрутныйЛист(Элемент.Ссылка));
		 НеХватает.Добавить(мСтруктура);

	 КонецЦикла;
	 
	
КонецПроцедуры

Процедура СоздатьМаршрутныеЛистыДокументы(ТаблицаВозвратов, Продавец, ТаблицаИД)
	
	МассивДокументов 	= Новый Массив;         
	ИмяДок 				= "МаршрутныйЛист";
	ТекущаяСсылка 		= "";
	ТорговыйАгент 		= Продавец;
	ТекИД 				= Неопределено;
	Попытка
		ТаблицаВозвратов.Сортировать("Ссылка");
	Исключение
	КонецПопытки;
	
	Для Каждого СтрокаДанныеЭлемента Из ТаблицаВозвратов Цикл
		НовыйОбъект = Документы[ИмяДок].ПолучитьСсылку(СтрокаДанныеЭлемента.Ссылка).ПолучитьОбъект();
		ДобавитьДок = Ложь;
		Если НовыйОбъект = Неопределено Тогда 
			Если СтрокаДанныеЭлемента.ПометкаУдаления  Тогда 
				Продолжить;
			КонецЕсли;
			//ЗаписьЖурналаРегистрации("СтворенняМарщрутного", УровеньЖурналаРегистрации.Информация,,,"Створення");
			НовыйОбъект 		= Документы[ИмяДок].СоздатьДокумент();	
			НовыйОбъект.Дата 	= ТекущаяДата();
			НовыйОбъект.ДатаПриезда		= СтрокаДанныеЭлемента.ДатаПриезда;
			НовыйОбъект.СтатусДокумента = ?(СтрокаДанныеЭлемента.СтатусДокумента = "Составляется", Перечисления.СтатусыМаршрутногоЛиста.Составляется,
			                       ?(СтрокаДанныеЭлемента.СтатусДокумента = "Отправлен", Перечисления.СтатусыМаршрутногоЛиста.Отправлен,
								   ?(СтрокаДанныеЭлемента.СтатусДокумента = "Завершен", Перечисления.СтатусыМаршрутногоЛиста.Завершен, 
								                                                  Перечисления.СтатусыМаршрутногоЛиста.ПустаяСсылка())));		
			НовыйОбъект.Комментарий = СтрокаДанныеЭлемента.Комментарий;
			НовыйОбъект.УстановитьСсылкуНового(Документы[ИмяДок].ПолучитьСсылку(СтрокаДанныеЭлемента.Ссылка));
			НовСтр = НовыйОбъект.ТорговыеАгенты.Добавить();
			НовСтр.ТорговыйАгент = ТорговыйАгент;
			ДобавитьДок 		= Истина;
		Иначе
			Если ВозвратПоЗакритомуМаршрутнику(НовыйОбъект, СтрокаДанныеЭлемента.ИД, ТаблицаИД) Тогда 
				Продолжить;
			КонецЕсли;

			НовыйОбъект.Записать(РежимЗаписиДокумента.ОтменаПроведения);
		КонецЕсли;
		//////////////////////////////////////////////////////////////////
		Если ТекущаяСсылка <> СтрокаДанныеЭлемента.Ссылка Тогда 
			//НовыйОбъект.Продажи.Очистить();
			//НовыйОбъект.Оплата.Очистить();
			ТекущаяСсылка = СтрокаДанныеЭлемента.Ссылка;
			Попытка
				Если ЗначениеЗаполнено(ТекИД) Тогда 
					НовСтр = ТаблицаИД.Добавить();
					НовСтр.ИД = ТекИД; 
				КонецЕсли;
				ТекИД = СтрокаДанныеЭлемента.ИД;
			Исключение
			КонецПопытки;
			ДобавитьДок = Истина;
		КонецЕсли;
		/////////////////////////////////////////////////////////////////
		Если НЕ ЗначениеЗаполнено(НовыйОбъект.Ссылка) Тогда 
			НовыйОбъект.Дата 							= ТекущаяДата();
			//НовыйОбъект.УстановитьНовыйНомер();
			НовыйОбъект.ТорговийАгент 					= Продавец;
			НовыйОбъект.ОтражатьВУправленческомУчете 	= Истина;
		КонецЕсли;
		НовыйОбъект.ПометкаУдаления = СтрокаДанныеЭлемента.ПометкаУдаления; 
		//ЗаписьЖурналаРегистрации("МАРШРУТНИЙ_ДОКУМЕНТИ", УровеньЖурналаРегистрации.Информация,,,"1");

		
		// Продажи
		Если СтрокаДанныеЭлемента.ТабЧасть = "Продажи" Тогда 
			//ЗаписьЖурналаРегистрации("МАРШРУТНИЙ_ДОКУМЕНТИ", УровеньЖурналаРегистрации.Информация,,,"12");

			Контрагент 	  				= Справочники.Контрагенты.ПолучитьСсылку(СтрокаДанныеЭлемента.Контрагент);
			ЗаказПокупателя 			= Документы.ЗаказПокупателя.ПолучитьСсылку(СтрокаДанныеЭлемента.ЗаказПокупателя);
			Номенклатура 				= Справочники.Номенклатура.ПолучитьСсылку(СтрокаДанныеЭлемента.Номенклатура);
			ХарактеристикаНоменклатуры 	= Справочники.ХарактеристикиНоменклатуры.ПолучитьСсылку(СтрокаДанныеЭлемента.ХарактеристикаНоменклатуры);
			
			ОтборСтрок = Новый Структура;
			ОтборСтрок.Вставить("Контрагент", Контрагент);
			ОтборСтрок.Вставить("ЗаказПокупателя", ЗаказПокупателя);
			ОтборСтрок.Вставить("Номенклатура", Номенклатура);
			ОтборСтрок.Вставить("ХарактеристикаНоменклатуры", ХарактеристикаНоменклатуры);
			СтрокиПродаж = НовыйОбъект.Продажи.НайтиСтроки(ОтборСтрок);
			Если СтрокиПродаж.Количество() > 0 Тогда 
				СтрокаПродаж = СтрокиПродаж[0];			
			Иначе 	
				СтрокаПродаж = НовыйОбъект.Продажи.Добавить();
			КонецЕсли;
			//ЗаписьЖурналаРегистрации("МАРШРУТНИЙ_ДОКУМЕНТИ", УровеньЖурналаРегистрации.Информация,,,"13");

			ЗаполнитьЗначенияСвойств(СтрокаПродаж, СтрокаДанныеЭлемента);
			СтрокаПродаж.Контрагент 	  				= Контрагент;
			СтрокаПродаж.ЗаказПокупателя 				= ЗаказПокупателя;
			СтрокаПродаж.Номенклатура 					= Номенклатура;
			СтрокаПродаж.ХарактеристикаНоменклатуры 	= ХарактеристикаНоменклатуры;
			СтрокаПродаж.Качество 						= Справочники.Качество.Новый;
			СтрокаПродаж.Штрихкод 						= ВесовойУчет.ПолучитьШтрихкодПоХарактеристике(ХарактеристикаНоменклатуры);
			СтрокаПродаж.ЦенаПродажиВес 				= ВесовойУчет.ПолучитьЦенуЗаВес(НовыйОбъект.Дата, Номенклатура, Истина);
			Попытка
				СтрокаПродаж.ЕдиницаИзмерения 			= СтрокаПродаж.Номенклатура.ЕдиницаХраненияОстатков;
			Исключение
			КонецПопытки;
			//СтрокаПродаж.Сумма 							= СтрокаПродаж.Цена * СтрокаПродаж.Количество;   // 
			//ЗаписьЖурналаРегистрации("МАРШРУТНИЙ_ДОКУМЕНТИ", УровеньЖурналаРегистрации.Информация,,,"14");

		КонецЕсли;		
		//ЗаписьЖурналаРегистрации("МАРШРУТНИЙ_ДОКУМЕНТИ", УровеньЖурналаРегистрации.Информация,,,"2");
		МассивСтрок = Новый Массив;
		Для Каждого СтрПродажи Из  НовыйОбъект.Продажи Цикл 
			СтрокаЗагрузки 	= НовыйОбъект.ЗагрузкаМашины.Найти(СтрПродажи.Штрихкод, "Штрихкод");	
			Если СтрокаЗагрузки <> Неопределено Тогда  
				МассивСтрок.Добавить(СтрокаЗагрузки);
			КонецЕсли;	
		КонецЦикла;	
		Для Каждого ЭлементМассива Из МассивСтрок Цикл 
			НовыйОбъект.ЗагрузкаМашины.Удалить(ЭлементМассива);
		КонецЦикла;	
		
		// Оплата
		ВалютаУправленческогоУчета = Константы.ВалютаУправленческогоУчета.Получить();
		Таблица = ПолныеПрава.ПолучитьСписокДокументовПоКритериюОтбора("СвязанныеДокументы", НовыйОбъект.Ссылка);
		//ЗаписьЖурналаРегистрации("МАРШРУТНИЙ_ДОКУМЕНТИ", УровеньЖурналаРегистрации.Информация,,,"3");
		Для Каждого СтрДокумент Из Таблица Цикл 
			Если НЕ СтрДокумент.Ссылка.Проведен Тогда
				Продолжить;
			КонецЕсли;

			Если ТипЗнч(СтрДокумент.Ссылка) = Тип("ДокументСсылка.ПриходныйКассовыйОрдер")
				ИЛИ ТипЗнч(СтрДокумент.Ссылка) = Тип("ДокументСсылка.РасходныйКассовыйОрдер")
				ИЛИ ТипЗнч(СтрДокумент.Ссылка) = Тип("ДокументСсылка.ПлатежноеПоручениеВходящее") Тогда 
					СтрокаОплаты = 	НовыйОбъект.Оплата.Найти(СтрДокумент.Ссылка, "КассовыйОрдер");
					Если СтрокаОплаты = Неопределено Тогда 
						СтрокаОплаты = НовыйОбъект.Оплата.Добавить();
					КонецЕсли;	
					//ЗаписьЖурналаРегистрации("МАРШРУТНИЙ_ДОКУМЕНТИ", УровеньЖурналаРегистрации.Информация,,,"21");
					Кассовыйордер 					= СтрДокумент.Ссылка.ПолучитьОбъект();
					СтрокаОплаты.Контрагент 		= Кассовыйордер.Контрагент;
					СтрокаОплаты.ДоговорКонтрагента = Кассовыйордер.ДоговорКонтрагента;
					СтрокаОплаты.ЗаказПокупателя 	= Кассовыйордер.РасшифровкаПлатежа[0].Сделка;
					СтрокаОплаты.Валюта 			= Кассовыйордер.ВалютаДокумента;
					СтрокаОплаты.КурсВал			= Общий.ПолучитьКурсОплаты(Кассовыйордер, Кассовыйордер.ВалютаДокумента);
					Попытка
						СтрокаОплаты.КурсУпр		= Кассовыйордер.РасшифровкаПлатежа[0].КурсВзаиморасчетов;
					Исключение
						СтрокаОплаты.КурсУпр		= 1;      // Платіжка завжди в гривнях

					КонецПопытки;
					СтрокаОплаты.Сумма      		= Кассовыйордер.СуммаДокумента;
					СтрокаОплаты.Возврат 			= ТипЗнч(СтрДокумент.Ссылка) = Тип("ДокументСсылка.РасходныйКассовыйОрдер");
					СтрокаОплаты.КассовыйОрдер 		= СтрДокумент.Ссылка;
					Если ТипЗнч(СтрДокумент.Ссылка) = Тип("ДокументСсылка.ПлатежноеПоручениеВходящее") Тогда 
						СтрокаОплаты.Безналичные = Истина;
					КонецЕсли;
					//ЗаписьЖурналаРегистрации("МАРШРУТНИЙ_ДОКУМЕНТИ", УровеньЖурналаРегистрации.Информация,,,"22");
					//Тільки непланові заповнюєм
					Если НЕ НовыйОбъект.Расчеты.НайтиСтроки(Новый Структура("Контрагент, ДоговорКонтрагента", СтрокаОплаты.Контрагент, СтрокаОплаты.ДоговорКонтрагента)).Количество() И СтрокаОплаты.ДоговорКонтрагента = СтрокаОплаты.Контрагент.ДоговорДляНеплановыхПродаж Тогда
									
						
						НовРасчетыСтрока =  НовыйОбъект.Расчеты.Добавить();
						ЗаполнитьЗначенияСвойств(НовРасчетыСтрока, СтрокаОплаты);
						НовРасчетыСтрока.СуммаБезСкидки = СтрокаОплаты.Сумма;
						НовРасчетыСтрока.СуммаОплаты = СтрокаОплаты.Сумма;
					КонецЕсли;
					
						
			КонецЕсли;	
		КонецЦикла;				
		 
		Попытка
			НовыйОбъект.Записать();
		Исключение
			ЗаписьЖурналаРегистрации("ОшибкаОбмена", УровеньЖурналаРегистрации.Ошибка , , "" ,ОписаниеОшибки());
		КонецПопытки;
	
		
		Если ДобавитьДок Тогда 
			МассивДокументов.Добавить(НовыйОбъект.Ссылка);
		КонецЕсли;
	КонецЦикла;	
	
	Если ЗначениеЗаполнено(ТекИД) Тогда 
		НовСтр 		= ТаблицаИД.Добавить();
		НовСтр.ИД 	= ТекИД;
	КонецЕсли;
	
	Для Каждого ДокСсылка Из МассивДокументов Цикл
		Если ДокСсылка.ПометкаУдаления Тогда 
			Продолжить;
		КонецЕсли;
		ДокОб = ДокСсылка.ПолучитьОбъект();
		Попытка
			ДокОб.Записать(РежимЗаписиДокумента.Проведение,РежимПроведенияДокумента.Неоперативный);
		Исключение
		КонецПопытки;
	КонецЦикла;
	
КонецПроцедуры

Процедура СоздатьНапоминания(Данные, Продавец, ТаблицаИД);
	
	Для Каждого Напоминания Из Данные Цикл;
		
		Ссылка  = Справочники.Напоминания.ПолучитьСсылку(Напоминания.УИДСсылка);
		Если ЗначениеЗаполнено(Ссылка.ВерсияДанных) Тогда 
			Объект = Ссылка.ПолучитьОбъект();
		Иначе
			Объект = Справочники.Напоминания.СоздатьЭлемент();
			Объект.УстановитьСсылкуНового(Ссылка);
			Объект.УстановитьНовыйКод();
		КонецЕсли;
		Объект.ОбменДанными.Загрузка = Истина;
		
		Объект.ТорговийАгент = Продавец;
		Объект.Наименование = Напоминания.Наименование;
		Объект.ОписаниеНапоминания = Напоминания.ОписаниеНапоминания;
		Объект.Активно = Напоминания.Активно;
		Объект.НапоминаниеОТоваре = Напоминания.НапоминаниеОТоваре;
		
		Объект.ДатаСоздания = Напоминания.ДатаСоздания;
		Объект.ИзЗаказа = Напоминания.ИзЗаказа;
	
		Если Напоминания.НапоминаниеОТоваре Тогда 
			
			Объект.Контрагент = Справочники.Контрагенты.ПолучитьСсылку(Напоминания.Контрагент);
			Объект.Товары.Очистить();
			
			Для Каждого Артикул Из Напоминания.Товары Цикл 
				Строка = Объект.Товары.Добавить();
				Строка.Номенклатура = Справочники.Номенклатура.ПолучитьСсылку(Артикул.Номенклатура);
				Строка.Выполнено = Артикул.Выполнено; 
				Строка.Количество = Артикул.Количество;
			КонецЦикла;
			
		Иначе
			Объект.Периодичность = Перечисления.ПериодичностьНапоминаний.Получить(Напоминания.Периодичность);
			Объект.ДеньНедели = Напоминания.ДеньНедели;
			Объект.ДатаНапоминания = Напоминания.ДатаНапоминания;
			
		КонецЕсли;
	      Объект.Записать();
		  
		  Если ТипЗнч(ТаблицаИД) = Тип("Массив") Тогда 
			  ТаблицаИД.Добавить(Напоминания.ИД);
		  Иначе 
			  ТаблицаИД.Добавить().ИД = Напоминания.ИД;
		  КонецЕсли;
		  
	КонецЦикла;
	
	
КонецПроцедуры


#КонецОбласти


#Область ДОПОЛНИТЕЛЬНЫЕ_ФУНКЦИИ

//Функция ПолучитьНастройкуОбмена(ИдентификаторКлиента)
//	
//	МЗ = РегистрыСведений.ЗарегистрированыеПриложения.СоздатьМенеджерЗаписи();
//	МЗ.ИдентификаторКлиента = ИдентификаторКлиента;
//	МЗ.Прочитать();
//	
//	Если МЗ.Выбран() Тогда 
//		Возврат МЗ.НастройкаОбмена;
//	Иначе
//		Возврат Справочники.НастройкиОбменаССмартфоном.ПустаяСсылка();
//	КонецЕсли;
//	
//КонецФункции

Функция ИмяЗначенияПеречисленияПоСинониму( пИмяПеречисления, пСинонимЗначения ) Экспорт
    КолекцияЗначенийПеречисления = Метаданные.Перечисления[пИмяПеречисления].ЗначенияПеречисления;
    Для каждого пНайденноеЗначение из КолекцияЗначенийПеречисления Цикл
        Если пНайденноеЗначение.Синоним = пСинонимЗначения Тогда
            Возврат пНайденноеЗначение.Имя;
        КонецЕсли
    КонецЦикла;
    Возврат Неопределено;
КонецФункции

Функция Сериализовать(ОбъектСериализации)
	
	УстановитьПривилегированныйРежим(Истина);
	
	//ДеревоВОбъектеXDTO = СериализаторXDTO.ЗаписатьXDTO(ОбъектСериализации);
	//МойXML = Новый ЗаписьXML;
	//МойXML.УстановитьСтроку();
	//ФабрикаXDTO.ЗаписатьXML(МойXML, ДеревоВОбъектеXDTO);
	//
	//Возврат МойXML.Закрыть();
	//Возврат МодульJSON.ЗаписатьJSON2(ОбъектСериализации);
	Возврат Новый ХранилищеЗначения(ОбъектСериализации, Новый СжатиеДанных(9));
КонецФункции

Функция ЗаписатьДжейсонЛокально(ОбъектСериализации)
	
	
    ЗаписьJSON = Новый ЗаписьJSON; 
    ПараметрыЗаписи = Новый ПараметрыЗаписиJSON();
    ЗаписьJSON.ОткрытьФайл("D:\Valery\test.txt", , , ПараметрыЗаписи);
    ЗаписатьJSON(ЗаписьJSON, ОбъектСериализации); 
    ЗаписьJSON.Закрыть();
	
	
КонецФункции

// Функция преобразует ТаблицуЗначений в Массив из структур.
//
Функция ПреобразоватьТаблицуЗначенийВМассив(тзДанные) Экспорт
    
    мсДанные = Новый Массив;
        
    // Запишем в массив
    Для Каждого СтрокаТЗ Из тзДанные Цикл
        
        стСтрокаТаблицы = Новый Структура;
        Для Каждого ИмяКолонки Из тзДанные.Колонки Цикл
            стСтрокаТаблицы.Вставить(ИмяКолонки.Имя, СтрокаТЗ[ИмяКолонки.Имя]);
        КонецЦикла;
        
        мсДанные.Добавить(стСтрокаТаблицы);
        
    КонецЦикла;
    
    Возврат мсДанные;
    
КонецФункции // ПреобразоватьТаблицуЗначенийВМассив()

// Функция преобразует Массив из структур в ТаблицуЗначений.
//
Функция ПреобразоватьМассивВТаблицуЗначений(мсДанные) Экспорт
    
    тзДанные = Новый ТаблицаЗначений;
    
    Для Каждого ЭлементМассива Из мсДанные Цикл
        // Рисуем колонки для таблицы
        Если тзДанные.Колонки.Количество() = 0 Тогда
            Для Каждого ЗначениеСтруктуры Из ЭлементМассива Цикл
                тзДанные.Колонки.Добавить(ЗначениеСтруктуры.Ключ);
            КонецЦикла;
        КонецЕсли;
        
        // Добавляем данные в таблицу
        НоваяСтрока = тзДанные.Добавить();
        Для Каждого ЗначениеСтруктуры Из ЭлементМассива Цикл
            НоваяСтрока[ЗначениеСтруктуры.Ключ] = ЗначениеСтруктуры.Значение;
        КонецЦикла;
    КонецЦикла;
    
    Возврат тзДанные;
    
КонецФункции // ПреобразоватьМассивВТаблицуЗначений()


Функция Десериализовать(XMLСтруктураСериализованногоОбъекта)
	
	УстановитьПривилегированныйРежим(Истина);
	
	//ЧтениеXMLДанных = Новый ЧтениеXML;
	//ЧтениеXMLДанных.УстановитьСтроку(XMLСтруктураСериализованногоОбъекта);
	//ТЗ = СериализаторXDTO.ПрочитатьXML(ЧтениеXMLДанных);
	//ЧтениеXMLДанных.Закрыть();  
	//
	//Возврат ТЗ;
	
	Возврат XMLСтруктураСериализованногоОбъекта.Получить();
	
КонецФункции

#КонецОбласти


#Область Чат1с

Функция СформируватьДанныеДляЧата(Пользователь, ДатаНаСервере, ОбработныеУведомления, УИД_Клиента, Продавец) Экспорт 
	
	
	 Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ГруппыЧатаУчасники.Ссылка КАК Группа,
		|	ГруппыЧатаУчасники.Ссылка.Наименование,
		|	ГруппыЧатаУчасники.Пользователь КАК Користувач,
		|	ГруппыЧатаУчасники.Ссылка.КартинкаГруппы,
		|	ГруппыЧатаУчасники.ЛишеСвої
		|ПОМЕСТИТЬ ГруппыЧата
		|ИЗ
		|	Справочник.ГруппыЧата.Учасники КАК ГруппыЧатаУчасники
		|ГДЕ
		|	ГруппыЧатаУчасники.Пользователь = &Пользователь
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВложенныйЗапрос.Учасник КАК Учасник,
		|	ВложенныйЗапрос.Учасник.Наименование КАК Наименование
		|ИЗ
		|	(ВЫБРАТЬ
		|		ГруппыЧатаУчасники.Пользователь КАК Учасник
		|	ИЗ
		|		ГруппыЧата КАК ГруппыЧата
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ГруппыЧата.Учасники КАК ГруппыЧатаУчасники
		|			ПО ГруппыЧата.Группа = ГруппыЧатаУчасники.Ссылка
		|	
		|	СГРУППИРОВАТЬ ПО
		|		ГруппыЧатаУчасники.Пользователь) КАК ВложенныйЗапрос
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Чат1С.Відправник,
		|	Чат1С.Одержувач,
		|	Чат1С.Повідомлення,
		|	Чат1С.Период,
		|	Чат1С.Уид_Сообщения,
		|	Чат1С.Одержувач ССЫЛКА Справочник.ГруппыЧата КАК ПолучательГруппа
		|ИЗ
		|	РегистрСведений.Чат1С КАК Чат1С
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ГруппыЧата КАК ГруппыЧата
		|		ПО (Чат1С.Одержувач = ГруппыЧата.Группа
		|				ИЛИ Чат1С.Одержувач = ГруппыЧата.Користувач)
		|			И (Чат1С.ДатаНаСервере > &ДатаНаСервере)
		|			И Чат1С.Відправник <> ГруппыЧата.Користувач
		|			И (НЕ ГруппыЧата.ЛишеСвої)
		|ГДЕ
		|	Чат1С.ДатаНаСервере >= &ДатаНаСервере
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Чат1С.Период КАК Период,
		|	Чат1С.Уид_Сообщения КАК Уид_Сообщения,
		|	Чат1С.Одержувач,
		|	Чат1С.Повідомлення,
		|	Чат1С.Одержувач ССЫЛКА Справочник.ГруппыЧата КАК ПолучательГруппа
		|ИЗ
		|	ГруппыЧата КАК ГруппыЧата
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.Чат1С КАК Чат1С
		|		ПО ГруппыЧата.Користувач = Чат1С.Відправник
		|			И (Чат1С.ДатаНаСервере > &ДатаНаСервере)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ГруппыЧата.Группа КАК Відправник,
		|	СУММА(ЕСТЬNULL(НепрочитаніПовідомлення.Кол, 0)) КАК Кол,
		|	ГруппыЧата.Группа ССЫЛКА Справочник.ГруппыЧата КАК ОтГруппы
		|ИЗ
		|	ГруппыЧата КАК ГруппыЧата
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НепрочитаніПовідомлення КАК НепрочитаніПовідомлення
		|		ПО ГруппыЧата.Группа = НепрочитаніПовідомлення.Відправник
		|			И ГруппыЧата.Користувач = НепрочитаніПовідомлення.Одержувач
		|
		|СГРУППИРОВАТЬ ПО
		|	НепрочитаніПовідомлення.Одержувач,
		|	ГруппыЧата.Группа
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	УдаленныеСообщения.УИД_Сообщения,
		|	УдаленныеСообщения.Дата
		|ИЗ
		|	РегистрСведений.УдаленныеСообщения КАК УдаленныеСообщения
		|ГДЕ
		|	УдаленныеСообщения.Дата >= &ДатаНаСервере
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РекацииНаСобщения.УИД_Сообщения,
		|	РекацииНаСобщения.УчастникЧата,
		|	РекацииНаСобщения.Реакция,
		|	РекацииНаСобщения.Дата
		|ИЗ
		|	РегистрСведений.РекацииНаСобщения КАК РекацииНаСобщения
		|ГДЕ
		|	РекацииНаСобщения.Дата >= &ДатаНаСервере
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЗапланированыеУведомления.УИД_Уведомления,
		|	ЗапланированыеУведомления.ДанныеУведомления,
		|	ЗапланированыеУведомления.Объект
		|ИЗ
		|	РегистрСведений.ЗапланированыеУведомления КАК ЗапланированыеУведомления
		|ГДЕ
		|	НЕ ЗапланированыеУведомления.Синхронизировано
		|	И ЗапланированыеУведомления.ТорговийАгент.Користувач = &Пользователь
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ИсторияРаботыСКлиентом.Период,
		|	ИсторияРаботыСКлиентом.Клиент,
		|	ИсторияРаботыСКлиентом.Запись,
		|	ИсторияРаботыСКлиентом.УИД_Записи,
		|	ИсторияРаботыСКлиентом.АвтоматичнийЗаписБезВзаємодіїЗКлієнтом
		|ИЗ
		|	РегистрСведений.ИсторияРаботыСКлиентом КАК ИсторияРаботыСКлиентом
		|ГДЕ
		|	ИсторияРаботыСКлиентом.Период >= &ДатаНаСервере
		//|	И ИсторияРаботыСКлиентом.Клиент.ТорговыйАгент.Користувач = &Пользователь
		|	И ИсторияРаботыСКлиентом.Клиент В (&СписокКонтрагентовТоргового)		
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЗаказПокупателяТовары.Номенклатура,
		|	СУММА(ЗаказПокупателяТовары.Количество) КАК Количество,
		|	ЗаказПокупателя.ТорговийАгент,
		|	ПРЕДСТАВЛЕНИЕ(ЗаказПокупателя.ТорговийАгент) КАК ТорговийАгентПредставление
		|ИЗ
		|	Документ.ЗаказПокупателя.Товары КАК ЗаказПокупателяТовары
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказПокупателя КАК ЗаказПокупателя
		|		ПО ЗаказПокупателяТовары.Ссылка = ЗаказПокупателя.Ссылка
		|			И (ЗаказПокупателя.Проведен)
		|			И (ЗаказПокупателя.СтатусЗамовлення = &СтатусЗамовлення)
		|
		|СГРУППИРОВАТЬ ПО
		|	ЗаказПокупателяТовары.Номенклатура,
		|	ЗаказПокупателя.ТорговийАгент
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЗаказПокупателя.Контрагент,
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА ЗаказПокупателя.Доставка = ЗНАЧЕНИЕ(Перечисление.НаявністьДоставки.Доставка)
		|				ТОГДА ВЫБОР
		|						КОГДА ЗаказПокупателя.Дата > &ДатаСемДнейНазад
		|							ТОГДА ЛОЖЬ
		|						ИНАЧЕ ИСТИНА
		|					КОНЕЦ
		|			ИНАЧЕ ВЫБОР
		|					КОГДА ЗаказПокупателя.Дата > &ДатаТриДнейНазад
		|						ТОГДА ЛОЖЬ
		|					ИНАЧЕ ИСТИНА
		|				КОНЕЦ
		|		КОНЕЦ) КАК ЕстьПростроченыеАктуальныеЗаказы,
		|	МАКСИМУМ(ЕСТЬNULL(МаршрутныйЛистЗаказы.ЗаказЕстьВМаршрутномЛисте, ЛОЖЬ)) КАК ЗаказВключенВМаршрутныйЛист
		|ИЗ
		|	Документ.ЗаказПокупателя КАК ЗаказПокупателя
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			МаршрутныйЛистЗаказы.ЗаказПокупателя КАК ЗаказПокупателяДок,
		|			ИСТИНА КАК ЗаказЕстьВМаршрутномЛисте
		|		ИЗ
		|			Документ.МаршрутныйЛист.Заказы КАК МаршрутныйЛистЗаказы
		|				ЛЕВОЕ СОЕДИНЕНИЕ Документ.МаршрутныйЛист КАК МаршрутныйЛист
		|				ПО МаршрутныйЛистЗаказы.Ссылка = МаршрутныйЛист.Ссылка
		|		ГДЕ
		|			НЕ МаршрутныйЛист.ПометкаУдаления) КАК МаршрутныйЛистЗаказы
		|		ПО ЗаказПокупателя.Ссылка = МаршрутныйЛистЗаказы.ЗаказПокупателяДок
		|ГДЕ
		|	ЗаказПокупателя.СтатусЗамовлення = &СтатусЗамовлення
		|	И ЗаказПокупателя.ПометкаУдаления = ЛОЖЬ
		|	И ЗаказПокупателя.Контрагент.ТорговыйАгент = &Продавец
		|
		|СГРУППИРОВАТЬ ПО
		|	ЗаказПокупателя.Контрагент";
	
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	Запрос.УстановитьПараметр("ДатаНаСервере", ДатаНаСервере);
	Запрос.УстановитьПараметр("СтатусЗамовлення", Справочники.СтатусиЗамовлень.Новий);
	Запрос.УстановитьПараметр("ДатаСемДнейНазад", НачалоДня(ТекущаяДата() - 7 * 60 * 60 * 24));
	Запрос.УстановитьПараметр("ДатаТриДнейНазад", НачалоДня(ТекущаяДата() - 3 * 60 * 60 * 24));
	Запрос.УстановитьПараметр("Продавец", Продавец);
	
	
	СписокКонтрагентовТоргового = Новый СписокЗначений;
	ЗапросКонтрагентыТоргового = Новый Запрос;
	ЗапросКонтрагентыТоргового.Текст = 
		"ВЫБРАТЬ
		|	Контрагенты.Ссылка
		|ИЗ
		|	Справочник.Контрагенты КАК Контрагенты
		|ГДЕ
		|	Контрагенты.ТорговыйАгент = &ТорговыйАгент";
	
	ЗапросКонтрагентыТоргового.УстановитьПараметр("ТорговыйАгент", Продавец);
	
	РезультатЗапросаКонтрагентыТоргового = ЗапросКонтрагентыТоргового.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапросаКонтрагентыТоргового.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СписокКонтрагентовТоргового.Добавить(ВыборкаДетальныеЗаписи.Ссылка);
	КонецЦикла;
	
	Запрос.УстановитьПараметр("СписокКонтрагентовТоргового", СписокКонтрагентовТоргового);
	
	
	Результат = Запрос.ВыполнитьПакетСПромежуточнымиДанными();

	тзЧаты 					= Результат.Получить(0).Выгрузить();
	тзУчасники 				= Результат.Получить(1).Выгрузить();
	тзВходящиеСообщения 	= Результат.Получить(2).Выгрузить();
	тзИсходящиеСообщения 	= Результат.Получить(3).Выгрузить();
	тзНепрочитано           = Результат.Получить(4).Выгрузить();
	тзУдаленно           	= Результат.Получить(5).Выгрузить();
	тзРеакции				= Результат.Получить(6).Выгрузить();
	тзУведомления			= Результат.Получить(7).Выгрузить();

	тзИсторияКлиента		= Результат.Получить(8).Выгрузить();
	ТзРезервы				= Результат.Получить(9).Выгрузить();
	ТзАктуальныеЗаказы		= Результат.Получить(10).Выгрузить();

	 

	тзЧаты.Колонки.Добавить("УИДСсылка");
	//тзУчасники.Колонки.Добавить("УИДГруппа");
	тзУчасники.Колонки.Добавить("УИДСсылка");
	тзВходящиеСообщения.Колонки.Добавить("УИДВідправник");
	тзВходящиеСообщения.Колонки.Добавить("УИДОдержувач");
	тзИсходящиеСообщения.Колонки.Добавить("УИДОдержувач");
	тзНепрочитано.Колонки.Добавить("УИДВідправник");
	тзРеакции.Колонки.Добавить("УИДУчастникЧата");

	тзИсторияКлиента.Колонки.Добавить("УИДКлиент", Новый ОписаниеТипов("УникальныйИдентификатор"));
	ТзРезервы.Колонки.Добавить("УИДНоменклатура");
	ТзРезервы.Колонки.Добавить("УИДТорговий");

	ТзАктуальныеЗаказы.Колонки.Добавить("УИДКонтрагент");
	//ТзАктуальныеЗаказы.Колонки.Добавить("УИДЗаказ");	
	
	Для Каждого Элемент Из тзЧаты Цикл 
		Элемент.УИДСсылка = Элемент.Группа.УникальныйИдентификатор();
	КонецЦикла;
	
	Для Каждого Элемент Из тзУчасники Цикл 
		//Элемент.УИДГруппа = Элемент.Группа.УникальныйИдентификатор();
		Элемент.УИДСсылка = Элемент.Учасник.УникальныйИдентификатор();
	КонецЦикла;
	
	Для Каждого Элемент Из тзВходящиеСообщения Цикл 
		Элемент.УИДОдержувач = Элемент.Одержувач.УникальныйИдентификатор();
		Элемент.УИДВідправник = Элемент.Відправник.УникальныйИдентификатор();
	КонецЦикла;
	
	Для Каждого Элемент Из тзИсходящиеСообщения Цикл 
		Элемент.УИДОдержувач = Элемент.Одержувач.УникальныйИдентификатор();
		//Элемент.УИДВідправник = Элемент.Відправник.УникальныйИдентификатор();
	КонецЦикла;

	Для Каждого Элемент Из тзНепрочитано Цикл 
		Элемент.УИДВідправник = Элемент.Відправник.УникальныйИдентификатор();
	КонецЦикла;

	Для Каждого Элемент Из тзРеакции Цикл 
		Элемент.УИДУчастникЧата = Элемент.УчастникЧата.УникальныйИдентификатор();
	КонецЦикла;

	Для Каждого Элемент Из тзИсторияКлиента Цикл 
		Элемент.УИДКлиент = Элемент.Клиент.УникальныйИдентификатор();
	КонецЦикла;

	Для Каждого Элемент из ТзРезервы Цикл 
		Элемент.УИДНоменклатура = Элемент.Номенклатура.УникальныйИдентификатор();
		Элемент.УИДТорговий = Элемент.ТорговийАгент.УникальныйИдентификатор();
	КонецЦикла;
		
	Для Каждого Элемент из ТзАктуальныеЗаказы Цикл 
		Элемент.УИДКонтрагент = Элемент.Контрагент.УникальныйИдентификатор();
		//Элемент.УИДЗаказ = Элемент.Заказ.УникальныйИдентификатор();
	КонецЦикла;

	
	тзЧаты.Колонки.Удалить("Группа");
	//тзУчасники.Колонки.Удалить("Группа");
	тзУчасники.Колонки.Удалить("Учасник");
	тзВходящиеСообщения.Колонки.Удалить("Відправник");
	тзВходящиеСообщения.Колонки.Удалить("Одержувач");
	тзИсходящиеСообщения.Колонки.Удалить("Одержувач");
	тзНепрочитано.Колонки.Удалить("Відправник");
	тзРеакции.Колонки.Удалить("УчастникЧата");
	тзИсторияКлиента.Колонки.Удалить("Клиент");
	ТзРезервы.Колонки.Удалить("Номенклатура");
	ТзРезервы.Колонки.Удалить("ТорговийАгент");

	ТзАктуальныеЗаказы.Колонки.Удалить("Контрагент");
	//ТзАктуальныеЗаказы.Колонки.Удалить("Заказ");
		
	Ответ = Новый Структура();
	Ответ.Вставить("Групы", тзЧаты);
	Ответ.Вставить("Учасники", тзУчасники);
	Ответ.Вставить("ВходящиеСообщения", тзВходящиеСообщения);
	Ответ.Вставить("ИсходящиеСообщения", тзИсходящиеСообщения);	
	Ответ.Вставить("НепрочитаныеСообщения", тзНепрочитано);	
	Ответ.Вставить("УдаленныеСообщения", тзУдаленно);	
	Ответ.Вставить("Реакции", тзРеакции);
	Ответ.Вставить("Уведомления", Новый Структура("Новые, Синхронизированые", тзУведомления, ОбработныеУведомления));
	Ответ.Вставить("ИсторияКлиента", тзИсторияКлиента);
	Ответ.Вставить("Резервы", ТзРезервы);
	Ответ.Вставить("АктуальныеЗаказы", ТзАктуальныеЗаказы);

		//ТзАктуальныеЗаказы_Хеш = ПолучитьХешДанных(ТзАктуальныеЗаказы);
	//мХешДанных = РегистрыСведений.ХешиДанныхОбмена;
	//Если мХешДанных.ПолучитьПоследнийХеш("АктуальныеЗаказы", Пользователь, УИД_Клиента) <> ТзАктуальныеЗаказы_Хеш Тогда 
	//	
	//	мХешДанных.ОновитьХешДанных("АктуальныеЗаказы", Пользователь, УИД_Клиента, ТзАктуальныеЗаказы_Хеш)
	//КонецЕсли;
	
	
	Возврат Сериализовать(Ответ);
	
КонецФункции

Процедура ЗаписьНовыхСообщений(Продавец, Данные, Дата, МассивИД) Экспорт 
	
	Организация = Справочники.Организации.НайтиПоКоду("000000001");
	мДанные = Десериализовать(Данные);
	Дата = мДанные.Дата;
	
	Для Каждого НовоеСообщение Из мДанные.Сообщения Цикл 
		
		Набор = РегистрыСведений.Чат1С.СоздатьНаборЗаписей();
		Набор.Отбор.Уид_Сообщения.Установить(НовоеСообщение.Уид_Сообщения);
		Набор.Прочитать();
		Если  Набор.Количество() Тогда 
			Продолжить;
		КонецЕсли;
		
		МенеджерЗаписи 					= Набор.Добавить();	
		МенеджерЗаписи.Уид_Сообщения 	= НовоеСообщение.Уид_Сообщения;
		МенеджерЗаписи.Організація 		= Организация;
		МенеджерЗаписи.Відправник  		= Продавец.Користувач;
		
		Если НовоеСообщение.ПолучательГруппа Тогда 
			МенеджерЗаписи.Одержувач  = Справочники.ГруппыЧата.ПолучитьСсылку(НовоеСообщение.УИД_Получатель);
		Иначе
			МенеджерЗаписи.Одержувач   = Справочники.Пользователи.ПолучитьСсылку(НовоеСообщение.УИД_Получатель);
		КонецЕсли;
		
		МенеджерЗаписи.Повідомлення 	= НовоеСообщение.Повідомлення;
		МенеджерЗаписи.Период       	= НовоеСообщение.Дата; 	
		МенеджерЗаписи.ДатаНаСервере 	= ТекущаяДата();
		Набор.Записать();
		
		Если НовоеСообщение.ПолучательГруппа Тогда 
			мПолучатели = МенеджерЗаписи.Одержувач.Учасники.ВыгрузитьКолонку("Пользователь");
			Відправник = МенеджерЗаписи.Одержувач;
		Иначе
			мПолучатели = Новый Массив;
			мПолучатели.Добавить( МенеджерЗаписи.Одержувач);
			Відправник =  МенеджерЗаписи.Відправник;
		КонецЕсли;
		
		Для Каждого ТекПользовательДляОтправки Из мПолучатели Цикл
			
			Если ТекПользовательДляОтправки = МенеджерЗаписи.Відправник Тогда
				Продолжить;
			КонецЕсли;	
			
			если ТекПользовательДляОтправки <> Справочники.Пользователи.ПустаяСсылка() тогда
				РегНепрочитані = РегистрыСведений.НепрочитаніПовідомлення.СоздатьМенеджерЗаписи();			
				РегНепрочитані.Одержувач = ТекПользовательДляОтправки;
				РегНепрочитані.Відправник =  Відправник;
				РегНепрочитані.ГруппаЧата  = Відправник;
				РегНепрочитані.Кол = 1;
				РегНепрочитані.Период = ТекущаяДата();
				РегНепрочитані.Записать(); 		
			КонецЕсли;
			
		КонецЦикла;	
	КонецЦикла;

	ЗаписатьНепрочитаныеСообщения(мДанные.Прочытаные, Продавец.Користувач);
	ЗаписатьУдаленныеСообщения(мДанные.Удаленные);
	ЗаписатьРеакциюСообщения(мДанные.Реакции);
	
	ЗаписатьИсториюРаботыСКлиентом(мДанные.РаботаСКлиентом, Продавец);
	
	ОновитьСинхронизациюУведомлений(мДанные.Уведомления, МассивИД);
	
	СоздатьНапоминания(мДанные.СправочникУведомления, Продавец, МассивИД);
	
КонецПроцедуры



Процедура ЗаписатьНепрочитаныеСообщения(Прочитано, Користувач)
	
	Если Не Прочитано.Количество() Тогда 
		Возврат
	КонецЕсли;
	
	ТипКолонки = Новый Массив;
	ТипКолонки.Добавить(Тип("СправочникСсылка.ГруппыЧата"));
	ТипКолонки.Добавить(Тип("СправочникСсылка.Пользователи"));
	
	Прочитано.Колонки.Добавить("Відправник", Новый ОписаниеТипов(ТипКолонки));

	Для Каждого Элемент Из Прочитано Цикл 
		УИД = Новый УникальныйИдентификатор(Элемент.УИД_Отправитель);
		Элемент.Відправник = ?(Элемент.ГруппаЧата
									, Справочники.ГруппыЧата.ПолучитьСсылку(УИД)
									, Справочники.Пользователи.ПолучитьСсылку(УИД));
			
	КонецЦикла;
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВТ.Відправник,
	|	ВТ.Период
	|ПОМЕСТИТЬ Прочитано
	|ИЗ
	|	&ВТ КАК ВТ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НепрочитаніПовідомлення.Период,
	|	НепрочитаніПовідомлення.Одержувач,
	|	НепрочитаніПовідомлення.Відправник
	|ИЗ
	|	Прочитано КАК Прочитано
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.НепрочитаніПовідомлення КАК НепрочитаніПовідомлення
	|		ПО Прочитано.Відправник = НепрочитаніПовідомлення.Відправник
	|			И (НепрочитаніПовідомлення.Одержувач = &Одержувач)
	|			И Прочитано.Период >= НепрочитаніПовідомлення.Период";
	
	Запрос.УстановитьПараметр("ВТ", Прочитано);
	Запрос.УстановитьПараметр("Одержувач", Користувач);
	Выборка = Запрос.Выполнить().Выбрать();
	набор = РегистрыСведений.НепрочитаніПовідомлення.СоздатьНаборЗаписей();
	
	Пока Выборка.Следующий() Цикл
		Набор.Отбор.Период.Установить(Выборка.Период);
		Набор.Отбор.Одержувач.Установить(Выборка.Одержувач);
		Набор.Отбор.Відправник.Установить(Выборка.Відправник);
		Набор.Записать();
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаписатьУдаленныеСообщения(Сообщения)
	
	Для Каждого Элемент Из Сообщения Цикл
		Менеджер = РегистрыСведений.УдаленныеСообщения.СоздатьМенеджерЗаписи();
		Менеджер.УИД_Сообщения = Элемент.УИД_Сообщения;		
		Менеджер.Прочитать();
		Если ЗначениеЗаполнено(Менеджер.Дата) Тогда 
			Продолжить;
		КонецЕсли;
		Менеджер.УИД_Сообщения = Элемент.УИД_Сообщения;		
		Менеджер.Дата = ТекущаяДата();
		Менеджер.Записать();
	КонецЦикла;
	
КонецПроцедуры


Процедура ЗаписатьРеакциюСообщения(Сообщения)
	
	Для Каждого Элемент Из Сообщения Цикл
		Менеджер = РегистрыСведений.РекацииНаСобщения.СоздатьМенеджерЗаписи();
		Менеджер.УИД_Сообщения = Элемент.УИД_Сообщения;
		Менеджер.УчастникЧата = Справочники.Пользователи.ПолучитьСсылку(Элемент.УИД_УчастникЧата);
		Менеджер.Прочитать();
		Если ЗначениеЗаполнено(Менеджер.Дата) И Менеджер.Реакция = Элемент.Реакция Тогда 
			Продолжить;
		КонецЕсли;
		Менеджер.УИД_Сообщения = Элемент.УИД_Сообщения;
		Менеджер.УчастникЧата = Справочники.Пользователи.ПолучитьСсылку(Элемент.УИД_УчастникЧата);

		Менеджер.Реакция = Элемент.Реакция;
		Менеджер.Дата = ТекущаяДата();
		
		Менеджер.Записать(Истина);
	КонецЦикла;
	
КонецПроцедуры


Процедура ЗаписатьИсториюРаботыСКлиентом(Данные, Торговый)
	
	Для Каждого  Элемент Из Данные Цикл 
		
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИСТИНА КАК Поле1
		|ИЗ
		|	РегистрСведений.ИсторияРаботыСКлиентом КАК ИсторияРаботыСКлиентом
		|ГДЕ
		|	ИсторияРаботыСКлиентом.УИД_Записи = &УИД_Записи";
		
		Запрос.УстановитьПараметр("УИД_Записи", Элемент.УИД_Записи);
		
		Результат = Запрос.Выполнить();
		Если Результат.Пустой() Тогда 
			МенеджерЗаписи = РегистрыСведений.ИсторияРаботыСКлиентом.СоздатьМенеджерЗаписи();
			МенеджерЗаписи.Торговый  = Торговый;
			МенеджерЗаписи.Клиент = Справочники.Контрагенты.ПолучитьСсылку(Элемент.КлиентУИД);
			МенеджерЗаписи.Запись = Элемент.Запись;
			МенеджерЗаписи.Период = Элемент.Период;
			МенеджерЗаписи.УИД_Записи  = Элемент.УИД_Записи;
			МенеджерЗаписи.АвтоматичнийЗаписБезВзаємодіїЗКлієнтом = Элемент.АвтоматичнийЗаписБезВзаємодіїЗКлієнтом;
			Попытка 
				МенеджерЗаписи.Записать();
			Исключение 
				Текст = ИнформацияОбОшибке();
			КонецПопытки;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ОновитьСинхронизациюУведомлений(Данные, МассивИД)
	
	Для Каждого Элемент Из Данные Цикл 
		Набор = РегистрыСведений.ЗапланированыеУведомления.СоздатьНаборЗаписей();
		Набор.Отбор.УИД_Уведомления.Установить(Элемент.ИД);
		Набор.Прочитать();
		Если Набор.Количество() Тогда 
			Набор[0].Синхронизировано = Истина;
			Набор.Записать();
			МассивИД.Добавить(Элемент.ИД);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

Функция  УстановитьБроньМешка(Знач Данные, Торговый) Экспорт 
	Ответ = Новый Структура;
	Ответ.Вставить("Успешно", Истина);
	
	Данные = Десериализовать(Данные);
	
	
	Если Данные.Команда = "ЗапросНаОбновлениеИнформацииОБрони" Тогда 
		
		Ответ.Вставить("ИнфоОБрони", ПолучитьИзмененныеБрониМешков(Торговый));
		Возврат Ответ;
 
	ИначеЕсли Данные.Команда = "ОтветНаОбновлениеИнформацииОБрони" Тогда 
		
		РегистрыСведений.ИзмененияБрониХарактеристики.УдалитьИзменение(Данные.МассивИД);
		Возврат Ответ;

	Иначе
		
		Характеристика = Справочники.ХарактеристикиНоменклатуры.ПолучитьСсылку(Данные.Характеристика);
		Если Характеристика.ВерсияДанных = "" Тогда 
			Ответ.Вставить("Успешно", Ложь);
			Ответ.Вставить("Ошибка", "Не вдалося знайти характеристику номенклатури в 1с!");
			Возврат Ответ;
		КонецЕсли;
		
		
		Если Данные.Команда = "УстановитьБронь" Тогда 
			
			Если Характеристика.ПериодБрони > ТекущаяДата() Тогда 
				Ответ.Вставить("Успешно", Ложь);
				Ответ.Вставить("Ошибка", "На мішок є активна бронь");
				Возврат Ответ;
			КонецЕсли;
			
			
			Контрагент = Справочники.Контрагенты.ПолучитьСсылку(Данные.Контрагент);
			Если Контрагент.ВерсияДанных = "" Тогда 
				Ответ.Вставить("Успешно", Ложь);
				Ответ.Вставить("Ошибка", "Не вдалося знайти контрагента в 1с!");
				Возврат Ответ;
			КонецЕсли;
			
			Если НетНаСкладе(Характеристика) Тогда 
				
				Ответ.Вставить("Успешно", Ложь);
				Ответ.Вставить("Ошибка", "Мішка не має у наявності");
				Возврат Ответ;

			КонецЕсли;
			
			
			обХарактеристики = Характеристика.ПолучитьОбъект();
			обХарактеристики.Бронь = Торговый;
			обХарактеристики.Контрагент = Контрагент;
			обХарактеристики.ПериодБрони = Данные.ПериодБрони;
			обХарактеристики.ОбменДанными.Загрузка = Истина;
			обХарактеристики.Записать();
			
			Ответ.Вставить("Бронь", Строка(Торговый));
			
		ИначеЕсли Данные.Команда = "ВилучитиБронь" Тогда
			
			обХарактеристики = Характеристика.ПолучитьОбъект();
			обХарактеристики.Бронь = Неопределено;
			обХарактеристики.Контрагент = Неопределено;
			обХарактеристики.ПериодБрони = Неопределено;
			обХарактеристики.ОбменДанными.Загрузка = Истина;
			обХарактеристики.Записать();
			
		КонецЕсли;
	КонецЕсли;   
	Возврат Ответ;
	
КонецФункции

Процедура ОбновитьИдентификаторКлиента(знач Данные, Торговый) Экспорт 
	
	Данные = Десериализовать(Данные);
	
	Запись = РегистрыСведений.ИдентификаториКлиентов.СоздатьМенеджерЗаписи();
	Запись.ИдентификаторПриложения = Новый УникальныйИдентификатор(Данные.ИдентификаторПриложения);
	запись.Торговый = Торговый;
	Запись.ИдентификаторПолучателя = Данные.ИдентификаторПолучателя;    	
	Запись.Записать(Истина);
		
КонецПроцедуры


Функция ПолучитьИзмененныеБрониМешков(ТорговийАгент)
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИзмененияБрониХарактеристики.Характеристика,
		|	ИзмененияБрониХарактеристики.УИД,
		|	ХарактеристикиНоменклатуры.Бронь = &Торговий КАК МояБронь,
		|	ХарактеристикиНоменклатуры.ПериодБрони,
		|	ПРЕДСТАВЛЕНИЕ(ИзмененияБрониХарактеристики.Характеристика.Бронь) КАК Бронь,
		|	ХарактеристикиНоменклатуры.Контрагент,
		|	ХарактеристикиНоменклатуры.СекторНаСкладі,
		|	ХарактеристикиНоменклатуры.Коментар,
		|	ХарактеристикиНоменклатуры.Открыт
		|ИЗ
		|	РегистрСведений.ИзмененияБрониХарактеристики КАК ИзмененияБрониХарактеристики
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
		|		ПО ИзмененияБрониХарактеристики.Характеристика = ХарактеристикиНоменклатуры.Ссылка
		|ГДЕ
		|	ИзмененияБрониХарактеристики.Торговий = &Торговий";
	
	Запрос.УстановитьПараметр("Торговий", ТорговийАгент);
	ИнфоОБрони = Запрос.Выполнить().Выгрузить();
	ИнфоОБрони.Колонки.Добавить("УИДХарактеристики");
	ИнфоОБрони.Колонки.Добавить("УИДКонтрагент");
	
	Для Каждого Элемент Из ИнфоОБрони Цикл 
		Элемент.УидХарактеристики 	= Элемент.Характеристика.УникальныйИдентификатор();
		Элемент.УидКонтрагент		= Элемент.Контрагент.УникальныйИдентификатор();		
	КонецЦикла;
	
	ИнфоОБрони.Колонки.Удалить("Характеристика");
	ИнфоОБрони.Колонки.Удалить("Контрагент");
	
	Возврат ИнфоОБрони 
КонецФункции

Функция НетНаСкладе(Характеристика) 
	
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СУММА(ТоварыНаСкладахОстатки.КоличествоОстаток - ЕСТЬNULL(ТоварыВРезервеНаСкладахОстатки.КоличествоОстаток, 0)) КАК СвободныйОстаток
		|ИЗ
		|	РегистрНакопления.ТоварыНаСкладах.Остатки(&ТекущаяДата, ХарактеристикаНоменклатуры = &Характеристика) КАК ТоварыНаСкладахОстатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВРезервеНаСкладах.Остатки(, ХарактеристикаНоменклатуры = &Характеристика) КАК ТоварыВРезервеНаСкладахОстатки
		|		ПО ТоварыНаСкладахОстатки.Склад = ТоварыВРезервеНаСкладахОстатки.Склад
		|			И ТоварыНаСкладахОстатки.Номенклатура = ТоварыВРезервеНаСкладахОстатки.Номенклатура
		|			И ТоварыНаСкладахОстатки.ХарактеристикаНоменклатуры = ТоварыВРезервеНаСкладахОстатки.ХарактеристикаНоменклатуры
		|
		|ИМЕЮЩИЕ
		|	СУММА(ТоварыНаСкладахОстатки.КоличествоОстаток - ЕСТЬNULL(ТоварыВРезервеНаСкладахОстатки.КоличествоОстаток, 0)) > 0";
	
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДата());
	Запрос.УстановитьПараметр("Характеристика", Характеристика);
	
	
	Возврат Запрос.Выполнить().Пустой()	
КонецФункции

Функция СформироватьДанныеОРезервах()
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТоварыНаСкладахОстатки.Номенклатура КАК Номенклатура,
		|	СУММА(ТоварыНаСкладахОстатки.КоличествоОстаток) КАК КоличествоОстаток
		|ИЗ
		|	РегистрНакопления.ТоварыНаСкладах.Остатки(, ) КАК ТоварыНаСкладахОстатки
		|ГДЕ
		|	ТоварыНаСкладахОстатки.КоличествоОстаток > 0
		|
		|СГРУППИРОВАТЬ ПО
		|	ТоварыНаСкладахОстатки.Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТоварыВРезервеНаСкладахОстатки.Номенклатура КАК Номенклатура,
		|	СУММА(ТоварыВРезервеНаСкладахОстатки.КоличествоОстаток) КАК КоличествоОстаток,
		|	ТоварыВРезервеНаСкладахОстатки.ДокументРезерва.ТорговийАгент КАК ТорговийАгент
		|ИЗ
		|	РегистрНакопления.ТоварыВРезервеНаСкладах.Остатки КАК ТоварыВРезервеНаСкладахОстатки
		|ГДЕ
		|	НЕ ТоварыВРезервеНаСкладахОстатки.ДокументРезерва.ПометкаУдаления
		|
		|СГРУППИРОВАТЬ ПО
		|	ТоварыВРезервеНаСкладахОстатки.Номенклатура,
		|	ТоварыВРезервеНаСкладахОстатки.ДокументРезерва.ТорговийАгент";
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		// Вставити обробку вибірки ВыборкаДетальныеЗаписи
	КонецЦикла;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА

	
КонецФункции

Функция ПолучитьДанныеДляАктуализацииЗаказовПокупателя(Контрагент)
	
	  	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Даний фрагмент побудований конструктором.
	// При повторному використанні конструктора, внесені вручну зміни будуть втрачені!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаказПокупателяТовары.Ссылка КАК Заказ,
		|	ЗаказПокупателяТовары.Номенклатура,
		|	СУММА(ЗаказПокупателяТовары.Количество) КАК Количество,
		|	СУММА(ЗаказПокупателяТовары.Сумма) КАК Сумма
		|ПОМЕСТИТЬ Заказы
		|ИЗ
		|	Документ.ЗаказПокупателя.Товары КАК ЗаказПокупателяТовары
		|ГДЕ
		|	ЗаказПокупателяТовары.Ссылка.СтатусЗамовлення = &СтатусЗамовлення
		|	И ЗаказПокупателяТовары.Ссылка.Проведен
		|
		|СГРУППИРОВАТЬ ПО
		|	ЗаказПокупателяТовары.Ссылка,
		|	ЗаказПокупателяТовары.Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РеализацияТоваровУслугТовары.Ссылка.Сделка КАК Заказ,
		|	РеализацияТоваровУслугТовары.Номенклатура,
		|	СУММА(РеализацияТоваровУслугТовары.Количество) КАК Количество
		|ПОМЕСТИТЬ Реализации
		|ИЗ
		|	Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
		|ГДЕ
		|	РеализацияТоваровУслугТовары.Ссылка.Сделка.СтатусЗамовлення = &СтатусЗамовлення
		|	И РеализацияТоваровУслугТовары.Ссылка.Проведен
		|
		|СГРУППИРОВАТЬ ПО
		|	РеализацияТоваровУслугТовары.Ссылка.Сделка,
		|	РеализацияТоваровУслугТовары.Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Заказы.Заказ,
		|	Заказы.Номенклатура
		|ПОМЕСТИТЬ ЗакрытиеПозиции
		|ИЗ
		|	Заказы КАК Заказы
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Реализации КАК Реализации
		|		ПО Заказы.Заказ = Реализации.Заказ
		|			И Заказы.Номенклатура = Реализации.Номенклатура
		|ГДЕ
		|	Заказы.Количество = Реализации.Количество
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВложенныйЗапрос.Заказ КАК Заказ
		|ИЗ
		|	(ВЫБРАТЬ
		|		Заказы.Заказ КАК Заказ,
		|		Заказы.Номенклатура КАК Номенклатура
		|	ИЗ
		|		Заказы КАК Заказы
		|			ЛЕВОЕ СОЕДИНЕНИЕ ЗакрытиеПозиции КАК ЗакрытиеПозиции
		|			ПО Заказы.Заказ = ЗакрытиеПозиции.Заказ
		|	
		|	СГРУППИРОВАТЬ ПО
		|		Заказы.Заказ,
		|		Заказы.Номенклатура) КАК ВложенныйЗапрос
		|		ЛЕВОЕ СОЕДИНЕНИЕ ЗакрытиеПозиции КАК ЗакрытиеПозиции
		|		ПО (ЗакрытиеПозиции.Заказ = ВложенныйЗапрос.Заказ)
		|			И (ЗакрытиеПозиции.Номенклатура = ВложенныйЗапрос.Номенклатура)
		|
		|СГРУППИРОВАТЬ ПО
		|	ВложенныйЗапрос.Заказ
		|
		|ИМЕЮЩИЕ
		|	НЕ МАКСИМУМ(ЗакрытиеПозиции.Заказ ЕСТЬ NULL)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Заказы.Заказ,
		|	Заказы.Номенклатура,
		|	Заказы.Количество - ЕСТЬNULL(Реализации.Количество, 0) КАК Количество,
		|	Заказы.Заказ.Номер КАК Номер,
		|	Заказы.Сумма,
		|	ПРЕДСТАВЛЕНИЕ(Заказы.Номенклатура) КАК НоменклатураПредставление
		|ИЗ
		|	Заказы КАК Заказы
		|		ЛЕВОЕ СОЕДИНЕНИЕ Реализации КАК Реализации
		|		ПО Заказы.Заказ = Реализации.Заказ
		|			И Заказы.Номенклатура = Реализации.Номенклатура
		|ГДЕ
		|	Заказы.Количество - ЕСТЬNULL(Реализации.Количество, 0) > 0
		|	И Заказы.Заказ.Контрагент = &Контрагент";
	
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаказПокупателя.Ссылка,
		|	ЗаказПокупателяТовары.Номенклатура,
		|	СУММА(ЗаказПокупателяТовары.Количество) КАК Количество,
		|	ЗаказПокупателя.Контрагент,
		|	ЗаказПокупателя.Дата,
		|	ЗаказПокупателяТовары.Сумма
		|ПОМЕСТИТЬ Заказы
		|ИЗ
		|	Документ.ЗаказПокупателя.Товары КАК ЗаказПокупателяТовары
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказПокупателя КАК ЗаказПокупателя
		|		ПО ЗаказПокупателяТовары.Ссылка = ЗаказПокупателя.Ссылка
		|			И (ЗаказПокупателя.Проведен)
		|ГДЕ
		|	НЕ ЗаказПокупателя.Ссылка В
		|				(ВЫБРАТЬ
		|					МаршрутныйЛистЗаказы.ЗаказПокупателя
		|				ИЗ
		|					Документ.МаршрутныйЛист.Заказы КАК МаршрутныйЛистЗаказы
		|						ЛЕВОЕ СОЕДИНЕНИЕ Документ.МаршрутныйЛист КАК МаршрутныйЛист
		|						ПО
		|							МаршрутныйЛистЗаказы.Ссылка = МаршрутныйЛист.Ссылка
		|				ГДЕ
		|					МаршрутныйЛист.Проведен
		|					И МаршрутныйЛист.СтатусДокумента <> &СтатусДокумента
		|		
		|				ОБЪЕДИНИТЬ ВСЕ
		|		
		|				ВЫБРАТЬ
		|					ЗакрытиеЗаказовПокупателейЗаказы.ЗаказПокупателя
		|				ИЗ
		|					Документ.ЗакрытиеЗаказовПокупателей.Заказы КАК ЗакрытиеЗаказовПокупателейЗаказы)
		|	И НЕ ЗаказПокупателя.ПометкаУдаления
		|	И ЗаказПокупателя.Контрагент = &Контрагент
		|
		|СГРУППИРОВАТЬ ПО
		|	ЗаказПокупателя.Ссылка,
		|	ЗаказПокупателяТовары.Номенклатура,
		|	ЗаказПокупателя.Контрагент,
		|	ЗаказПокупателя.Дата,
		|	ЗаказПокупателяТовары.Сумма
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РеализацияТоваровУслуг.Ссылка,
		|	РеализацияТоваровУслуг.Контрагент,
		|	СУММА(РеализацияТоваровУслугТовары.Количество) КАК Количество,
		|	РеализацияТоваровУслугТовары.Номенклатура,
		|	РеализацияТоваровУслуг.Дата
		|ПОМЕСТИТЬ Реализации
		|ИЗ
		|	Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
		|		ПО РеализацияТоваровУслугТовары.Ссылка = РеализацияТоваровУслуг.Ссылка
		|			И (РеализацияТоваровУслуг.Проведен)
		|ГДЕ
		|	РеализацияТоваровУслуг.Контрагент = &Контрагент
		|
		|СГРУППИРОВАТЬ ПО
		|	РеализацияТоваровУслугТовары.Номенклатура,
		|	РеализацияТоваровУслуг.Ссылка,
		|	РеализацияТоваровУслуг.Контрагент,
		|	РеализацияТоваровУслуг.Дата
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Заказы.Ссылка КАК Заказ,
		|	ПРЕДСТАВЛЕНИЕ(Заказы.Ссылка.СтатусЗамовлення) КАК СтатусЗамовлення,
		|	Заказы.Номенклатура,
		|	Заказы.Количество,
		|	Заказы.Ссылка.Номер КАК Номер,
		|	Заказы.Дата КАК Дата,
		|	Заказы.Сумма,
		|	СУММА(ЕСТЬNULL(Реализации.Количество, 0)) КАК Продано,
		|	ПРЕДСТАВЛЕНИЕ(Заказы.Номенклатура.Артикул) КАК НоменклатураПредставление
		|ИЗ
		|	Заказы КАК Заказы
		|		ЛЕВОЕ СОЕДИНЕНИЕ Реализации КАК Реализации
		|		ПО Заказы.Номенклатура = Реализации.Номенклатура
		|			И Заказы.Контрагент = Реализации.Контрагент
		|			И Заказы.Дата < Реализации.Дата
		|
		|СГРУППИРОВАТЬ ПО
		|	Заказы.Ссылка,
		|	Заказы.Номенклатура,
		|	Заказы.Количество,
		|	Заказы.Дата,
		|	Заказы.Сумма,
		|	Заказы.Ссылка.Номер,
		|	ПРЕДСТАВЛЕНИЕ(Заказы.Ссылка.СтатусЗамовлення),
		|	ПРЕДСТАВЛЕНИЕ(Заказы.Номенклатура.Артикул)";
	
		
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.УстановитьПараметр("СтатусДокумента", Перечисления.СтатусыМаршрутногоЛиста.Завершен);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	
	//ЗаказыДляЗакрытия = РезультатЗапроса[3].Выбрать();
	//
	//Если ЗаказыДляЗакрытия.Количество() Тогда
	//	
	//	НачатьТранзакцию();
	//	ЗакрытиеЗаказа = Документы.ЗакрытиеЗаказовПокупателей.СоздатьДокумент();
	//	ЗакрытиеЗаказа.Дата = ТекущаяДата();
	//	
	//	Пока  ЗаказыДляЗакрытия.Следующий() Цикл 
	//		ЗакрытиеЗаказа.Заказы.Добавить().ЗаказПокупателя = ЗаказыДляЗакрытия.Заказ;	
	//		//Объект = ЗаказыДляЗакрытия.Заказ.ПолучитьОбъект();
	//		//Объект.СтатусЗамовлення = Справочники.СтатусиЗамовлень.Неактуальний;
	//		//Объект.ОбменДанными.Загрузка = Истина;
	//		//Объект.Записать();
	//	КонецЦикла;
	//	
	//	ЗакрытиеЗаказа.ВидОперации = Перечисления.ВидыОперацийЗакрытиеЗаказовПокупателей.ЗакрытиеЗаказов;
	//	ЗакрытиеЗаказа.Записать(РежимЗаписиДокумента.Проведение);
	//	ЗафиксироватьТранзакцию();
	//	
	//КонецЕсли;	
	
	ТЗ_НеЗакритыеЗаказы = РезультатЗапроса.Выгрузить();
	ТЗ_НеЗакритыеЗаказы.Колонки.Добавить("Заказ_уид");
	ТЗ_НеЗакритыеЗаказы.Колонки.Добавить("Номенклатура_уид");
	
	Для Каждого Элемент Из ТЗ_НеЗакритыеЗаказы Цикл 
		
		Элемент.Заказ_уид = Элемент.Заказ.УникальныйИдентификатор();
		Элемент.Номенклатура_уид = Элемент.Номенклатура.УникальныйИдентификатор();
		
	КонецЦикла;
	
	ТЗ_НеЗакритыеЗаказы.Колонки.Удалить("Номенклатура");	
	ТЗ_НеЗакритыеЗаказы.Колонки.Удалить("Заказ");
	
	Возврат ТЗ_НеЗакритыеЗаказы;
КонецФункции

Функция ВыполнитьКоманду(Продавец, Данные, отказ)  Экспорт
	перем Команда, Параметры;
	
	Отказ = Ложь;
	Данные = Десериализовать(Данные);
	
	Если Не ТипЗнч(Данные) = Тип("Структура") Тогда 
		Отказ = истина;
	КонецЕсли;
	
	Если Не (Данные.Свойство("Команда", Команда)
		И Данные.Свойство("Параметры", Параметры)) Тогда 
		Отказ = Истина;
	КонецЕсли;
	Если отказ Тогда 
		Возврат Неопределено
	КонецЕсли;
	
	Если Команда = "ПолучитьАктуальныеЗаказы" Тогда 
		Ответ = ПолучитьАктуальныеЗаказы(Параметры);
	КонецЕсли;
	
	Если Команда = "ПолучитьОтчетПродажиПоКонтрагенту" Тогда 
		Ответ = ПолучитьОтчетПродажиПоКонтрагенту(Параметры);
	КонецЕсли;
	
	Если Команда = "ПолучитьОчередьНапоминанийСДействием" Тогда 
		Ответ = ПолучитьОчередьНапоминанийСДействием(Параметры, Продавец);
	КонецЕсли;
	
	Если Команда = "ПолучитьСтатусыЗаказовПоКонтрагенту" Тогда 
		Ответ = ПолучитьСтатусыЗаказовПоКонтрагенту(Параметры);
	КонецЕсли;
	
	Если Команда = "ПолучитьАнализКлиентскойБазы" Тогда 
		Ответ = ПолучитьАнализКлиентскойБазы(Параметры, Продавец);
	КонецЕсли;
	
	Если Команда = "ПолучитьОтчетПрезентацииПоКонтрагенту" Тогда 
		Ответ = ПолучитьОтчетПрезентацииПоКонтрагенту(Параметры);
	КонецЕсли;
	
	Если Команда = "ЗаписатьСообщение" Тогда 
		Ответ = ЗаписатьСообщениеЧат1С(Параметры, Продавец);
	КонецЕсли;
	
	Если Команда = "ИзмененияХарактеристик" Тогда 
		Ответ = ЗаписатьИзмененияХарактеристик(Параметры, Продавец);
	КонецЕсли;
	
	Если Команда = "ДублиКонтрагента" Тогда 
		Ответ = ДублиКонтрагента(Параметры);
	КонецЕсли;
	
	Возврат Ответ;
КонецФункции

Функция ПолучитьАктуальныеЗаказы(Параметры)
			
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаказПокупателя.Ссылка,
		|	ЗаказПокупателя.Дата,
		|	ЗаказПокупателя.Номер
		|ИЗ
		|	Документ.ЗаказПокупателя КАК ЗаказПокупателя
		|ГДЕ
		|	ЗаказПокупателя.Контрагент = &Контрагент
		|	И ЗаказПокупателя.СтатусЗамовлення = &СтатусЗамовлення
		|	И ЗаказПокупателя.Проведен";
	
	Запрос.УстановитьПараметр("Контрагент", Справочники.Контрагенты.ПолучитьСсылку(Параметры.Контрагент));
	Запрос.УстановитьПараметр("СтатусЗамовлення", Справочники.СтатусиЗамовлень.Новий);
	
	Результат = Запрос.Выполнить().Выгрузить();
	Результат.Колонки.Добавить("УИДЗаказ");
	Для Каждого Элемент из Результат Цикл 
		
		Элемент.УИДЗаказ = Элемент.Ссылка.УникальныйИдентификатор();		
		
	КонецЦикла;
	
	Результат.Колонки.Удалить("Ссылка");
	
Возврат Результат;
	
КонецФункции

Функция ПолучитьОтчетПродажиПоКонтрагенту(Параметры)
			
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПродажиОбороты.Период КАК Период,
		|	ПродажиОбороты.Контрагент,
		|	ПродажиОбороты.Номенклатура,
		|	ПродажиОбороты.ВесОборот КАК Количество
		|ИЗ
		|	РегистрНакопления.Продажи.Обороты(&НачПериода, &КонПериода, Месяц, Контрагент = &Контрагент) КАК ПродажиОбороты
		|
		|УПОРЯДОЧИТЬ ПО
		|	Период";
	
	Запрос.УстановитьПараметр("Контрагент", Справочники.Контрагенты.ПолучитьСсылку(Параметры.Контрагент));
	Запрос.УстановитьПараметр("НачПериода", Параметры.НачалоПериодаПродаж);
	Запрос.УстановитьПараметр("КонПериода", Параметры.КонецПериодаПродаж);
	
	Результат = Запрос.Выполнить().Выгрузить();
	Результат.Колонки.Добавить("УИДКонтрагент");
	Результат.Колонки.Добавить("УИДНоменклатура");

	Для Каждого Элемент из Результат Цикл 
		
		Элемент.УИДКонтрагент = Элемент.Контрагент.УникальныйИдентификатор();		
		Элемент.УИДНоменклатура = Элемент.Номенклатура.УникальныйИдентификатор();		
		
	КонецЦикла;
	
	Результат.Колонки.Удалить("Контрагент");
	Результат.Колонки.Удалить("Номенклатура");
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьОтчетПрезентацииПоКонтрагенту(Параметры)
			
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Презентації.Период КАК Период,
	|	НАЧАЛОПЕРИОДА(Презентації.Период, МЕСЯЦ) КАК ПериодНачалоМесяца,
	|	Презентації.Контрагент,
	|	Презентації.Номенклатура,
	|	Презентації.Коментар,
	|	Презентації.КоментарМенеджера,
	|	СУММА(Презентації.Количество) КАК Количество
	|ИЗ
	|	РегистрНакопления.Презентації КАК Презентації
	|ГДЕ
	|	Презентації.Период МЕЖДУ &НачПериода И &КонПериода
	|	И Презентації.Контрагент = &Контрагент
	|
	|СГРУППИРОВАТЬ ПО
	|	Презентації.Период,
	|	НАЧАЛОПЕРИОДА(Презентації.Период, МЕСЯЦ),
	|	Презентації.Контрагент,
	|	Презентації.Номенклатура,
	|	Презентації.Коментар,
	|	Презентації.КоментарМенеджера
	|
	|УПОРЯДОЧИТЬ ПО
	|	Период";
	
	Запрос.УстановитьПараметр("Контрагент", Справочники.Контрагенты.ПолучитьСсылку(Параметры.Контрагент));
	Запрос.УстановитьПараметр("НачПериода", Параметры.НачалоПериодаПродаж);
	Запрос.УстановитьПараметр("КонПериода", Параметры.КонецПериодаПродаж);
	

	
	Результат = Запрос.Выполнить().Выгрузить();
	Результат.Колонки.Добавить("УИДКонтрагент");
	Результат.Колонки.Добавить("УИДНоменклатура");

	Для Каждого Элемент из Результат Цикл 
		
		Элемент.УИДКонтрагент = Элемент.Контрагент.УникальныйИдентификатор();		
		Элемент.УИДНоменклатура = Элемент.Номенклатура.УникальныйИдентификатор();		
		
	КонецЦикла;
	
	Результат.Колонки.Удалить("Контрагент");
	Результат.Колонки.Удалить("Номенклатура");
	
	Возврат Результат;
	
КонецФункции

Функция ЗаписатьСообщениеЧат1С(НовоеСообщение, Продавец)
	
	МенеджерЗаписи = РегистрыСведений.Чат1С.СоздатьМенеджерЗаписи();
	
		
	МенеджерЗаписи.Уид_Сообщения 	= НовоеСообщение.Уид_Сообщения;
	МенеджерЗаписи.Організація 		= Справочники.Организации.НайтиПоКоду("000000001");
	МенеджерЗаписи.Відправник  		= Продавец.Користувач;
	
	Если НовоеСообщение.ПолучательГруппа Тогда 
		МенеджерЗаписи.Одержувач  = Справочники.ГруппыЧата.ПолучитьСсылку(НовоеСообщение.УИД_Получатель);
	Иначе
		МенеджерЗаписи.Одержувач   = Справочники.Пользователи.ПолучитьСсылку(НовоеСообщение.УИД_Получатель);
	КонецЕсли;
	
	МенеджерЗаписи.Повідомлення 	= НовоеСообщение.Повідомлення;
	МенеджерЗаписи.Период       	= НовоеСообщение.Дата; 	
	МенеджерЗаписи.ДатаНаСервере 	= ТекущаяДата();
	МенеджерЗаписи.Записать();//Набор.Записать();
	
	Если НовоеСообщение.ПолучательГруппа Тогда 
		мПолучатели = МенеджерЗаписи.Одержувач.Учасники.ВыгрузитьКолонку("Пользователь");
		Відправник = МенеджерЗаписи.Одержувач;
	Иначе
		мПолучатели = Новый Массив;
		мПолучатели.Добавить( МенеджерЗаписи.Одержувач);
		Відправник =  МенеджерЗаписи.Відправник;
	КонецЕсли;
	
	Для Каждого ТекПользовательДляОтправки Из мПолучатели Цикл
		
		Если ТекПользовательДляОтправки = МенеджерЗаписи.Відправник Тогда
			Продолжить;
		КонецЕсли;	
		
		если ТекПользовательДляОтправки <> Справочники.Пользователи.ПустаяСсылка() тогда
			РегНепрочитані = РегистрыСведений.НепрочитаніПовідомлення.СоздатьМенеджерЗаписи();			
			РегНепрочитані.Одержувач = ТекПользовательДляОтправки;
			РегНепрочитані.Відправник =  Відправник;
			РегНепрочитані.ГруппаЧата  = Відправник;
			РегНепрочитані.Кол = 1;
			РегНепрочитані.Период = ТекущаяДата();
			РегНепрочитані.Записать(); 		
		КонецЕсли;
		
	КонецЦикла;	
	
	Возврат Истина;
	
КонецФункции


Функция ПолучитьОчередьНапоминанийСДействием(Параметры, Продавец)
			
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОчередьНапоминанийСДействием.ТорговыйАгент,
		|	ОчередьНапоминанийСДействием.КонтрагентДляДействий,
		|	ОчередьНапоминанийСДействием.ХарактеристикаДляДействий,
		|	ОчередьНапоминанийСДействием.ТипДействяПриНапоминании		
		|ИЗ
		|	РегистрСведений.ОчередьНапоминанийСДействием КАК ОчередьНапоминанийСДействием
		|ГДЕ
		|	ОчередьНапоминанийСДействием.ТорговыйАгент = &ТорговыйАгент";
	
	Запрос.УстановитьПараметр("ТорговыйАгент", Продавец);
	
	ТЗРезультат = Запрос.Выполнить().Выгрузить();
	ТЗРезультат.Колонки.Добавить("УИДКонтрагентДляДействий");
	ТЗРезультат.Колонки.Добавить("УИДХарактеристикаДляДействий");
	ТЗРезультат.Колонки.Добавить("ИмяТипДействяПриНапоминании");
	
	Для Каждого Элемент из ТЗРезультат Цикл 
		
		Элемент.УИДКонтрагентДляДействий = Элемент.КонтрагентДляДействий.УникальныйИдентификатор();		
		Элемент.УИДХарактеристикаДляДействий = Элемент.ХарактеристикаДляДействий.УникальныйИдентификатор();		
		
		ЗначениеПеречисления = Элемент.ТипДействяПриНапоминании;;
		ИмяПеречисления = ЗначениеПеречисления.Метаданные().Имя; 
		ИндексЗначенияПеречисления = Перечисления[ИмяПеречисления].Индекс(ЗначениеПеречисления); 
		ИмяЗначенияПеречисления = Метаданные.Перечисления[ИмяПеречисления].ЗначенияПеречисления[ИндексЗначенияПеречисления].Имя;		
		
		Элемент.ИмяТипДействяПриНапоминании = ИмяЗначенияПеречисления;
		
		ЗаписьОчередиДляУдаления = РегистрыСведений.ОчередьНапоминанийСДействием.СоздатьМенеджерЗаписи();
		
		ЗаписьОчередиДляУдаления.ТорговыйАгент = Элемент.ТорговыйАгент;
		ЗаписьОчередиДляУдаления.КонтрагентДляДействий = Элемент.КонтрагентДляДействий;		
		ЗаписьОчередиДляУдаления.ХарактеристикаДляДействий = Элемент.ХарактеристикаДляДействий;
		ЗаписьОчередиДляУдаления.ТипДействяПриНапоминании = Элемент.ТипДействяПриНапоминании;
		ЗаписьОчередиДляУдаления.Удалить();
		
	КонецЦикла;
	
	
	СтрукрутаСправочников = Новый Структура;
	ТЗНоменклатуры = Новый ТаблицаЗначений;
	ТЗНоменклатуры.Колонки.Добавить("Ссылка");
	Для Каждого стрРезультат Из ТЗРезультат Цикл
		    НоваяСтрока = ТЗНоменклатуры.Добавить();
			НоваяСтрока.Ссылка = стрРезультат.ХарактеристикаДляДействий.Владелец;
	КонецЦикла;	
	СтрукрутаСправочников.Вставить("Номенклатура", ТЗНоменклатуры);
	
	ДобавитьСправочникХарактеристики(СтрукрутаСправочников, Продавец.Склад, Продавец);
	
	
	
	
	
	
	
	ТЗРезультат.Колонки.Удалить("КонтрагентДляДействий");
	ТЗРезультат.Колонки.Удалить("ХарактеристикаДляДействий");
	ТЗРезультат.Колонки.Удалить("ТипДействяПриНапоминании");
	
	
	
	//Очистимо чергу більше 10 днів	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОчередьНапоминанийСДействием.ТорговыйАгент,
		|	ОчередьНапоминанийСДействием.КонтрагентДляДействий,
		|	ОчередьНапоминанийСДействием.ХарактеристикаДляДействий,
		|	ОчередьНапоминанийСДействием.ТипДействяПриНапоминании		
		|ИЗ
		|	РегистрСведений.ОчередьНапоминанийСДействием КАК ОчередьНапоминанийСДействием
		|ГДЕ
		|	ОчередьНапоминанийСДействием.ПериодДобавления < &ПериодДобавления";
	
	Запрос.УстановитьПараметр("ПериодДобавления", ТекущаяДата() - 10 * 60 * 60 * 24);
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	Для Каждого Элемент из Результат Цикл 
		
		ЗаписьОчередиДляУдаления = РегистрыСведений.ОчередьНапоминанийСДействием.СоздатьМенеджерЗаписи();
		ЗаписьОчередиДляУдаления.ТорговыйАгент = Элемент.ТорговыйАгент;
		ЗаписьОчередиДляУдаления.КонтрагентДляДействий = Элемент.КонтрагентДляДействий;		
		ЗаписьОчередиДляУдаления.ХарактеристикаДляДействий = Элемент.ХарактеристикаДляДействий;
		ЗаписьОчередиДляУдаления.ТипДействяПриНапоминании = Элемент.ТипДействяПриНапоминании;
		ЗаписьОчередиДляУдаления.Удалить();
		
	КонецЦикла;

	СтруктураОтвета = Новый Структура;
	СтруктураОтвета.Вставить("ТЗОчереди", ТЗРезультат);
	СтруктураОтвета.Вставить("ТЗХарактеристик", СтрукрутаСправочников.ХарактеристикиНоменклатуры);
	
	Возврат СтруктураОтвета;
	
КонецФункции

Функция ПолучитьСтатусыЗаказовПоКонтрагенту(Параметры)
			
				
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаказПокупателя.Ссылка КАК Заказ,
		|	ВЫБОР
		|		КОГДА ЗаказПокупателя.СтатусЗамовлення = ЗНАЧЕНИЕ(Справочник.СтатусиЗамовлень.Новий) И НЕ ЗаказПокупателя.ПометкаУдаления
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК Актуальный
		|ИЗ
		|	Документ.ЗаказПокупателя КАК ЗаказПокупателя
		|ГДЕ
		|	ЗаказПокупателя.Контрагент = &Контрагент
		//|	И ЗаказПокупателя.ПометкаУдаления = ЛОЖЬ
		|";
	
	Запрос.УстановитьПараметр("Контрагент", Справочники.Контрагенты.ПолучитьСсылку(Параметры.Контрагент));

	
	ТЗРезультат = Запрос.Выполнить().Выгрузить();
	ТЗРезультат.Колонки.Добавить("УИДЗаказ");


	Для Каждого Элемент из ТЗРезультат Цикл 
		
		Элемент.УИДЗаказ = Элемент.Заказ.УникальныйИдентификатор();		

		
	КонецЦикла;
	
	ТЗРезультат.Колонки.Удалить("Заказ");
	
	Возврат ТЗРезультат;
	
КонецФункции

Функция ПолучитьАнализКлиентскойБазы(Параметры, Продавец)
			
				

	ТЗКонтрагентов = Параметры.ТЗКонтрагентов;
	ТЗКонтрагентов.Колонки.Добавить("Контрагент", Новый ОписаниеТипов("СправочникСсылка.Контрагенты")); 
	Для Каждого стрКонтрагент Из ТЗКонтрагентов Цикл
		стрКонтрагент.Контрагент = Справочники.Контрагенты.ПолучитьСсылку(стрКонтрагент.УИДКонтрагент);
	КонецЦикла;	
	ТЗКонтрагентов.Колонки.Удалить("УИДКонтрагент");
	
	СписокКонтраегнтв = Новый СписокЗначений;
	СписокКонтраегнтв.ЗагрузитьЗначения(ТЗКонтрагентов.ВыгрузитьКолонку("Контрагент"));
	
	ТабДокумент = Новый ТабличныйДокумент;

	
 //   СхемаКомпоновкиДанных = ПолучитьОбщийМакет("АнализКлиентскойБазы");
 //   
 //   //Настройки = СхемаКомпоновкиДанных.НастройкиПоУмолчанию;  
 //   // - Если сделать так, как показано выше(рекомендуют на некоторых ресурсах), то при изменении настроек в режиме клиента
 //   // этих изменений Вы не увидите, потому что настройки всегда будут по умолчанию. Как правильно - вариант ниже
 //   Настройки = КомпоновщикНастроек.ПолучитьНастройки(); 
 //
 //   ДанныеРасшифровки = Новый ДанныеРасшифровкиКомпоновкиДанных; 
 //
 //   КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;	
 //   МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, Настройки, ДанныеРасшифровки);	
 //   
	
	СхемаСКД = ПолучитьОбщийМакет("АнализКлиентскойБазы");
	КомпоновщикНастроекДанныхОтчета = Новый КомпоновщикНастроекКомпоновкиДанных;
	КомпоновщикНастроекДанныхОтчета.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(СхемаСКД));
	КомпоновщикНастроекДанныхОтчета.ЗагрузитьНастройки(СхемаСКД.НастройкиПоУмолчанию);
	
	// В том случае, если нам нужно учитывать настройки, выполненные пользователем, их необходимо загрузить
	//КомпоновщикНастроекДанныхОтчета.ЗагрузитьПользовательскиеНастройки(Отчет.КомпоновщикНастроек.ПользовательскиеНастройки);
	
	КомпоновщикНастроекДанныхОтчета.Настройки.Отбор.Элементы[0].Использование = Истина;
	КомпоновщикНастроекДанныхОтчета.Настройки.Отбор.Элементы[0].ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
	КомпоновщикНастроекДанныхОтчета.Настройки.Отбор.Элементы[0].ПравоеЗначение = СписокКонтраегнтв;
	
	КомпоновщикНастроекДанныхОтчета.Настройки.ПараметрыДанных.Элементы[4].Использование = Истина;
	КомпоновщикНастроекДанныхОтчета.Настройки.ПараметрыДанных.Элементы[4].Значение = Продавец;


	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаСКД, КомпоновщикНастроекДанныхОтчета.ПолучитьНастройки());
		
	
	
	
	ВнешнийНаборДанных = Новый Структура("ТЗКонтрагентов", ТЗКонтрагентов); 
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных; 
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки, ВнешнийНаборДанных); 
	
	
 	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент; 
	ПроцессорВывода.УстановитьДокумент(ТабДокумент); 
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);
	
	
	ТабДокумент.ОтображатьСетку = Ложь;
	ТабДокумент.ОтображатьЗаголовки = Ложь;
	ТабДокумент.ТолькоПросмотр = Истина;
	
	ТабДокумент.ПоказатьУровеньГруппировокСтрок(1);
	ТабДокумент.ПоказатьУровеньГруппировокСтрок(0);
	

	
	Возврат ТабДокумент;
	
КонецФункции

Функция ЗаписатьИзмененияХарактеристик(Параметры, Продавец);
	
	Ответ = Новый Массив;
	
	НетКолонкиОткрыт = Параметры.Колонки.Найти("Открыт") = Неопределено;
	Для Каждого Элемент Из Параметры Цикл 
		
		Структура = Новый Структура("УИД, ИД", Элемент.УИД_Ссылка, Элемент.ИД);
		Ответ.Добавить(Структура);
		
		Ссылка = Справочники.ХарактеристикиНоменклатуры.ПолучитьСсылку(Элемент.УИД_Ссылка);
		Если ПустаяСтрока(Ссылка.ВерсияДанных) Тогда 
			Продолжить;
		КонецЕсли;
		
		Объект = Ссылка.ПолучитьОбъект();
		
		Объект.Коментар = Элемент.Коментар;
		Объект.СекторНаСкладі = Элемент.СекторНаСкладі;
	
		Если НЕ НетКолонкиОткрыт Тогда  
			Объект.Открыт = Элемент.Открыт;
		КонецЕсли;
		
		Объект.Записать();
		
	КонецЦикла;
	
	Общий.ЗаписІсторіїЗміниХарактеристики(Объект.Ссылка, Продавец);
		
	Возврат Ответ;
	
КонецФункции

Функция ЗаписатиЗміниКонтрагента(ПарольВхода, Данные) Экспорт
	 Возврат Сериализовать(Истина);
	//Ответ = "";
	//Продавец = ОбменАндроид.ПолучитьПродавцаПоКодуПартнера(ПарольВхода);
	//МассивОшибок = Новый Массив;
	//ТаблицаИД = Новый ТаблицаЗначений;
	//ТаблицаИД.Колонки.Добавить("ИД");
	//Если Продавец = Неопределено  Тогда 
	//	Ответ = "Помилка авторизації! Перевірте пароль";
	//Иначе
	//	Данные = Десериализовать(Данные);
	//	ОбновитьКонтрагентов(Данные, Неопределено, ТаблицаИД, Продавец, МассивОшибок);
	//	Если МассивОшибок.Количество() Тогда 
	//		Для Каждого Ошибка Из МассивОшибок Цикл
	//			Ответ = Ответ + " " + Ошибка;
	//		КонецЦикла;
	//	Иначе  
	//		Ответ = Истина;
	//	КонецЕсли;
	//	
	//		КонецЕсли;
	//
	//Возврат Сериализовать(Ответ);	
КонецФункции

Функция ОтриматиДаніХарактеристики(Данные, Сектор) Экспорт

	Характеристика = Справочники.ХарактеристикиНоменклатуры.ПолучитьСсылку(Новый УникальныйИдентификатор(Данные));
	Если НЕ ЗначениеЗаполнено(Характеристика) Тогда 
		Возврат "";
	КонецЕсли;
	
	Если НЕ ПустаяСтрока(Сектор) Тогда
		ХарОб = Характеристика.ПолучитьОбъект();
		ХарОб.СекторНаСкладі = Сектор;
		ХарОб.Записать();
	КонецЕсли;
	
	
	
	Возврат Характеристика.СекторНаСкладі;	
КонецФункции

Функция ДублиКонтрагента(Параметры)
	Перем НомерТелефона, Контрагент, ЭтоПоиск;
	
	Параметры.Свойство("НомерТелефона", НомерТелефона);
	Параметры.Свойство("Контрагент", Контрагент);
	Параметры.Свойство("Пошук", ЭтоПоиск);

	НовыйТелефон = ОбработкаНомераТелефона(НомерТелефона);
	ЗапросНомеров = Новый Запрос;
	
	ЗапросНомеров.Текст = 
	"ВЫБРАТЬ
	|	Контрагенты.НомерТелефона,
	|	Контрагенты.Ссылка КАК Контрагент,
	|	Контрагенты.ТорговыйАгент
	|ИЗ
	|	Справочник.Контрагенты КАК Контрагенты
	|ГДЕ
	|	Контрагенты.НомерТелефона ПОДОБНО &НомерТелефона
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	КонтрагентыДополнительныеНомераТелефонов.Номер,
	|	КонтрагентыДополнительныеНомераТелефонов.Ссылка,
	|	КонтрагентыДополнительныеНомераТелефонов.Ссылка.ТорговыйАгент
	|ИЗ
	|	Справочник.Контрагенты.ДополнительныеНомераТелефонов КАК КонтрагентыДополнительныеНомераТелефонов
	|ГДЕ
	|	КонтрагентыДополнительныеНомераТелефонов.Номер ПОДОБНО &НомерТелефона";
	ЗапросНомеров.УстановитьПараметр("НомерТелефона", Прав(НовыйТелефон, 10));
	
	Выборка = ЗапросНомеров.Выполнить().Выбрать();
	
	Отказ = Ложь;
	ТекстОшибки = "";
	Пока Выборка.Следующий() Цикл 
		
		Если ЗначениеЗаполнено(Контрагент) 
			И Контрагент = Выборка.Контрагент.УникальныйИдентификатор() Тогда 
			Продолжить;	
		КонецЕсли;
		Если ЭтоПоиск Тогда 
			ТекстОшибки = "" + Выборка.Контрагент + ", Відповідальний: " + Выборка.ТорговыйАгент;		
		иначе	
			ТекстОшибки = "Номер телефону контрагента не унікальний! " + Выборка.Контрагент + ", Номер: " + Выборка.НомерТелефона + ", Відповідальний: " + Выборка.ТорговыйАгент + Символы.ПС;
		КонецЕсли;
		Отказ = Истина;

		
	КонецЦикла;
	

	Ответ = Новый Структура;
	Ответ.Вставить("ЕстьДубли", Отказ);
	Ответ.Вставить("ТекстОшибки", ТекстОшибки);
	Возврат Ответ;
КонецФункции




////////////////////////////////////////////////////////////////////////////////////////////

Функция НачатьОбмен(Версия, ИдентификаторКлиента, ПарольВхода,ЭтоНеПервыйОбмен) Экспорт
	
	
	
	
	УстановитьПривилегированныйРежим(Истина);
	
	Ошибка = "";    
	
	
	
	АктуальнаяВерсия = "1";
	
	Если Константы.БлокуватиРегламентСервіс.Получить() Тогда 
		Ошибка = "База заблокована. Зробіть обмін пізніше!";
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ПарольВхода) Тогда 
		ПарольВхода = Неопределено;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	ТорговіАгенти.ТорговыйАгент КАК ТорговийАгент,
	               |	ТорговіАгенти.ТорговыйАгент.Склад,
	               |	ТорговіАгенти.ТорговыйАгент.Склад КАК ОсновнийСклад,
	               |	ТорговіАгенти.ТорговыйАгент.ІдентифікаторПристрою КАК ІдентифікаторПристрою
	               |ИЗ
	               |	Справочник.Контрагенты КАК ТорговіАгенти
	               |ГДЕ
	               |	ТорговіАгенти.ТорговыйАгент.ПарольДоступаАндроід = &ПарольДоступаАндроід";
	Запрос.УстановитьПараметр("ПарольДоступаАндроід", ПарольВхода);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Не (Выборка.Следующий() И ПарольВхода <> Неопределено) Тогда 
		
		ЗаписьЖурналаРегистрации("НевернаяАвторизацияАндроид",УровеньЖурналаРегистрации.Предупреждение,Неопределено,ПарольВхода);
		Ошибка = Ошибка + "Не коректно вказано пароль, або не назначені клієнти!";
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(Выборка.ІдентифікаторПристрою) Тогда 
		ТоргОб = Выборка.ТорговийАгент.ПолучитьОбъект(); 
		ТоргОб.ІдентифікаторПристрою = СокрЛП(ИдентификаторКлиента);
		ТоргОб.Записать();	
	ИначеЕсли СокрЛП(Выборка.ТорговийАгент.ІдентифікаторПристрою) <> СокрЛП(ИдентификаторКлиента) Тогда 
		//ЗаписьЖурналаРегистрации("НевернаяАвторизацияАндроид",УровеньЖурналаРегистрации.Предупреждение,Неопределено,ПарольВхода);
		//Ошибка = Ошибка + "Вже інший торговий працює під цим паролем! Очистіть в 1С ідентифікатор якщо це Ви.";		
	КонецЕсли;
	
	
	
	
	Если Не ЗначениеЗаполнено(Ошибка) Тогда 
		
		
		
		ПолнаяВыгрузка = ОбменАндроид.ПолнаяВыгрузка(ПарольВхода) ИЛИ НЕ ЭтоНеПервыйОбмен;
		Если НЕ ЭтоНеПервыйОбмен Тогда 
			ОбменАндроид.ВыключитьЧастичныйОбмен(ПарольВхода);
		КонецЕсли;
		
		
		Продавец = ОбменАндроид.ПолучитьПродавцаПоКодуПартнера(ПарольВхода);
		СкладПартнера = ОбменАндроид.ПолучитьСкладПартнера(ПарольВхода);  
		Если ПолнаяВыгрузка Тогда    ////////////////////////////////////////////////// Ставим все на регистрацию и включаемо частичний обмен
			
			НЗ = РегистрыСведений.РегистрацияОбмена.СоздатьНаборЗаписей();
			НЗ.Отбор.Продавец.Установить(Продавец);
			НЗ.Записать();
			
			Если Не Продавец.НеВыгружатьРеализации Тогда 
				Запрос = Новый Запрос;
				Запрос.Текст = "ВЫБРАТЬ
				|	РеализацияТоваровУслуг.Ссылка
				|ИЗ
				|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
				|ГДЕ
				|	РеализацияТоваровУслуг.ТорговийАгент = &ТорговийАгент
				|	И РеализацияТоваровУслуг.Дата > &Дата3ДН";
				
				Запрос.УстановитьПараметр("ТорговийАгент",Продавец);
				Запрос.УстановитьПараметр("Дата3ДН",ТекущаяДата() - (1 * 24 * 60 * 60));
				
				Выборка = Запрос.Выполнить().Выбрать();
				Пока Выборка.Следующий() Цикл
					Запись = НЗ.Добавить();
					Запись.Продавец = Продавец;
					Запись.Объект = Выборка.Ссылка;
					Запись.ИД = Новый УникальныйИдентификатор;
				КонецЦикла;
			КонецЕсли;
			Запрос = Новый Запрос;
			
			
			
			Запрос.Текст = "ВЫБРАТЬ
			               |	НоменклатураТовар.Ссылка КАК Ссылка
			               |ИЗ
			               |	Справочник.Номенклатура КАК НоменклатураТовар
			               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ВыгружатьВАндроидПоСкладам КАК ВыгружатьВАндроидПоСкладам
			               |		ПО (НоменклатураТовар.Ссылка = ВыгружатьВАндроидПоСкладам.Номенклатура
			               |				ИЛИ НоменклатураТовар.Родитель = ВыгружатьВАндроидПоСкладам.Номенклатура
			               |				ИЛИ НоменклатураТовар.Родитель.Родитель = ВыгружатьВАндроидПоСкладам.Номенклатура
			               |				ИЛИ НоменклатураТовар.Родитель.Родитель.Родитель = ВыгружатьВАндроидПоСкладам.Номенклатура
			               |				ИЛИ НоменклатураТовар.Родитель.Родитель.Родитель.Родитель = ВыгружатьВАндроидПоСкладам.Номенклатура
			               |				ИЛИ НоменклатураТовар.Родитель.Родитель.Родитель.Родитель.Родитель = ВыгружатьВАндроидПоСкладам.Номенклатура)
			               |			И (ВыгружатьВАндроидПоСкладам.Выгружать)
			               |ГДЕ
			               |	НЕ НоменклатураТовар.ПометкаУдаления
			               |	И НЕ НоменклатураТовар.ЭтоГруппа
			               |	И (ВыгружатьВАндроидПоСкладам.ТорговийАгент = &Продавец
						   //|			ИЛИ &ПолныеПрава
						   |				И ВыгружатьВАндроидПоСкладам.ТорговийАгент <> ЗНАЧЕНИЕ(Справочник.ТорговыеАгенты.ПустаяСсылка)
			               |)
			               |СГРУППИРОВАТЬ ПО
			               |	НоменклатураТовар.Ссылка";
			
			
			
			
			Запрос.УстановитьПараметр("ПолныеПрава", Продавец.ПолныеПрава);
			Запрос.УстановитьПараметр("Продавец",Продавец);
			Запрос.УстановитьПараметр("Склад",СкладПартнера);
			Запрос.УстановитьПараметр("Дата",ТекущаяДата());
			Запрос.УстановитьПараметр("ДатаНач",ТекущаяДата() - (30 * 24 * 60 * 60));
			
			
			
			
			
			
			Выборка = Запрос.Выполнить().Выбрать();
			Пока Выборка.Следующий() Цикл
				Запись = НЗ.Добавить();
				Запись.Продавец = Продавец;
				Запись.Объект = Выборка.Ссылка;
				Запись.ИД = Новый УникальныйИдентификатор;
				Запись.ВыгружатьФайлы = Ложь;
			КонецЦикла;
			НЗ.Записать();
			
			//////////////////////////////////////////////// Контрагеты
			
			ЗапросКонтр = Новый Запрос;
			ЗапросКонтр.Текст = "ВЫБРАТЬ
			                    |	СкладыКонтрагентов.Ссылка КАК Контрагент
			                    |ИЗ
			                    |	Справочник.Контрагенты КАК СкладыКонтрагентов
			                    |ГДЕ
			                    |	СкладыКонтрагентов.Ссылка В ИЕРАРХИИ
			                    |			(ВЫБРАТЬ
			                    |				ВыгружатьВАндроидКонтрагентов.Контрагент
			                    |			ИЗ
			                    |				РегистрСведений.ВыгружатьВАндроидКонтрагентов КАК ВыгружатьВАндроидКонтрагентов
			                    |			ГДЕ
			                    |				ВыгружатьВАндроидКонтрагентов.ТорговийАгент = &ТорговийАгент
			                    |				И ВыгружатьВАндроидКонтрагентов.Выгружать)
			                    |	И НЕ СкладыКонтрагентов.ПометкаУдаления
			                    |
			                    |СГРУППИРОВАТЬ ПО
			                    |	СкладыКонтрагентов.Ссылка";
			ЗапросКонтр.УстановитьПараметр("ТорговийАгент", Продавец);
			ЗапросКонтр.УстановитьПараметр("ПолныеПрава", Продавец.ПолныеПрава);
			ВыборкаКонтр = ЗапросКонтр.Выполнить().Выбрать();
			Пока ВыборкаКонтр.Следующий() Цикл
				Запись = НЗ.Добавить();
				Запись.Продавец = Продавец;
				Запись.Объект = ВыборкаКонтр.Контрагент;
				Запись.ИД = Новый УникальныйИдентификатор;
				Запись.ВыгружатьФайлы = Ложь;
			КонецЦикла;
			НЗ.Записать();
			
			
			//ВключитьЧастичныйОбмен(ПарольВхода);
		КонецЕсли;
		
		//////////////////////// Подсчитываем пакеты 
		Если НЕ ЗначениеЗаполнено(Ошибка) Тогда 
			Запрос = Новый Запрос;
			
			Запрос.Текст = "ВЫБРАТЬ
			|	РегистрацияОбмена.ИД
			|ИЗ
			|	РегистрСведений.РегистрацияОбмена КАК РегистрацияОбмена
			|ГДЕ
			|	РегистрацияОбмена.Продавец = &Продавец
			|
			|СГРУППИРОВАТЬ ПО
			|	РегистрацияОбмена.ИД";
			
			Запрос.УстановитьПараметр("Продавец",Продавец);
			
			ВсегоПакетов = Запрос.Выполнить().Выбрать().Количество();
			Ошибка = "*"+Формат(Цел(ВсегоПакетов)+ 1, "ЧГ=") ;
		КонецЕсли;
		
	КонецЕсли;
	
	
	
	Возврат Ошибка;
	
КонецФункции


Функция ПолучитьХешДанных(Данные)
	
	ИмяФайла = ПолучитьИмяВременногоФайла();
	
	ЗначениеВФайл(ИмяФайла, Данные);
	
	ХешированиеДанных = Новый ХешированиеДанных(ХешФункция.SHA1);
	ХешированиеДанных.ДобавитьФайл(ИмяФайла);
	Возврат Строка(ХешированиеДанных.ХешСумма);
	
КонецФункции
