&НаКлиенте
Перем ВыполнитьДействиеПриЗакрытии;

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Перем Значение;
	
	Действие = 0;
	ТекстНагадування 	= Параметры.ТекстНагадування;
	ДатаНагадування 	= Параметры.ДатаНагадування;
	УИД_Уведомления 	= Новый УникальныйИдентификатор(Параметры.УИД_Уведомления);
	
	Если Параметры.Свойство("УИД_Номенклатура", Значение) Тогда 
		УИД = Новый УникальныйИдентификатор(Значение);
		Номенклатура = Справочники.Номенклатура.ПолучитьСсылку(УИД);
		НапоминаниеОТоваре = Истина;
		Элементы.Действие.СписокВыбора.Добавить(1,"Відкласти до нового надходження");
	КонецЕсли;
	
	Если Параметры.Свойство("УИД_Напоминание", Значение)
		И Значение <> Неопределено Тогда 
		
		УИД = Новый УникальныйИдентификатор(Значение);
		Напоминание = Справочники.Нагадування.ПолучитьСсылку(УИД);	
		
		Если Не ЗначениеЗаполнено(Напоминание.ВерсияДанных) Тогда 
			Отказ = истина;
			Возврат;
		КонецЕсли;
	КонецЕсли;

	Если ЗначениеЗаполнено(Напоминание.ТипДействяПриНапоминании)  Тогда
		Элементы.ДействиеПоПредупреждению.Видимость = Истина;
	Иначе
		Элементы.ДействиеПоПредупреждению.Видимость = Ложь;
	КонецЕсли;	
	
КонецПроцедуры


&НаКлиенте
Процедура ОК(Команда)
	Перем ДанныеУведомления;
	 	
	Если Действие = 0 Или  Действие = 1 Тогда
		Если НапоминаниеОТоваре Тогда 
			ОбработкаНапоминания()
		КонецЕсли;
		
		УстановитьВыполнено(УИД_Уведомления, Напоминание);
		Закрыть();
		Возврат;
	КонецЕсли;
	
	ОтложитьУведомлениеНаСервере(ДанныеУведомления);
	
	#Если  МобильноеПриложениеКлиент Тогда
		Уведомление = Новый ДоставляемоеУведомление;
		ЗаполнитьЗначенияСвойств(Уведомление, ДанныеУведомления, ,"Данные");
		Уведомление.Данные = Общий.ПолучитьСтрокуИзДанных(ДанныеУведомления["Данные"]);
		
		Уведомление.ДатаПоявленияУниверсальноеВремя = ДатаОтправки(ДанныеУведомления["Данные"]["Дата"]);
		ДоставляемыеУведомления.ДобавитьЛокальноеУведомление(Уведомление);
	#КонецЕсли
	Закрыть();
КонецПроцедуры

&НаСервере
Процедура ОтложитьУведомлениеНаСервере(ДанныеУведомления)
	Перем Напоминание;
	Если Действие = 0 Тогда 
		Возврат;
	КонецЕсли;
	мДата =  ТекущаяДата() + 60 * Действие;
	Набор = РегистрыСведений.ЗапланированыеУведомления.СоздатьНаборЗаписей();
	Набор.Отбор.УИД_Уведомления.Установить(УИД_Уведомления);
	Набор.Прочитать();
	Если Набор.Количество() Тогда 
		
		ДанныеУведомления = Набор[0].ДанныеУведомления.Получить();
		ДанныеУведомления["Данные"]["Дата"] = мДата;
		Набор[0].ДатаУведомления = мДата;
		Набор[0].Отложено = Истина;
		Набор.Записать();
		Возврат;
	Иначе	
		ДанныеУведомления = Новый Структура;;
		ДанныеУведомления.Вставить("Заголовок", "Нагадування!");
		ДанныеУведомления.Вставить("Текст", ТекстНагадування);
		ДанныеУведомления.Вставить("Данные", Новый Соответствие); 
		
		ДанныеУведомления["Данные"]["Действие"] = "Напоминание";
		ДанныеУведомления["Данные"]["УИД_Уведомления"] = Строка(УИД_Уведомления);
	КонецЕсли;
	

	Общий.ЗапланироватьУведомление(ДанныеУведомления, Истина, УИД_Уведомления, мДата, Напоминание); 
	
КонецПроцедуры


&НаСервереБезКонтекста
Функция  ДатаОтправки(Дата)
	
	Возврат Дата  + (ТекущаяУниверсальнаяДата() - ТекущаяДата()); 
	
КонецФункции

Процедура УдалитьНапоминаните()

	Набор = РегистрыСведений.ЗапланированыеУведомления.СоздатьНаборЗаписей();	
		Набор.Отбор.УИД_Уведомления.Установить(УИД_Уведомления);
		Набор.Записать();


КонецПроцедуры

&НаСервере
Процедура ОбработкаНапоминания()
	
	Если Действие = 0 Тогда
	
		 
		
		обНапоминание = Напоминание.ПолучитьОбъект();
		строка = обНапоминание.Товары.Найти(Номенклатура, "Номенклатура");
		строка.Виконано = истина;
		Если обНапоминание.Товары.Найти(Ложь, "Виконано") = Неопределено Тогда 
			обНапоминание.Активне = Ложь;
		КонецЕсли;
		
		обНапоминание.Записать();
	
		
	КонецЕсли;

	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура УстановитьВыполнено(УИД, Напоминание)
	     
	Набор = РегистрыСведений.ЗапланированыеУведомления.СоздатьНаборЗаписей();
	Набор.Отбор.УИД_Уведомления.Установить(УИД);
	Набор.Прочитать();
	
	Если Набор.Количество() Тогда 
		Набор[0].Выполнено = Истина;
		Набор.Записать();
	КонецЕсли;
	
	Если Напоминание.Періодичність = Перечисления.Періоди.НеПовторювати Тогда 
		Об = Напоминание.ПолучитьОбъект();
		Об.Активне = Ложь;
		об.Записать();
	КонецЕсли;
	
	
КонецПроцедуры

&НаСервере
Функция ПолучитьТипДействияНапоминанияНаСервере()
	ЗначениеПеречисления = Напоминание.ТипДействяПриНапоминании;
	ИмяПеречисления = ЗначениеПеречисления.Метаданные().Имя;
	ИндексЗначенияПеречисления = Перечисления[ИмяПеречисления].Индекс(ЗначениеПеречисления);
	ИмяЗначенияПеречисления = Метаданные.Перечисления[ИмяПеречисления].ЗначенияПеречисления[ИндексЗначенияПеречисления].Имя;
	
	Возврат ИмяЗначенияПеречисления;
КонецФункции

&НаСервере
Функция ПолучитьКонтрагентаДляДействияНаСервере()
	Возврат Напоминание.КонтрагентДляДействий;
КонецФункции 

&НаСервере
Функция ПолучитьХарактеристикуДляДействияНаСервере()
	Возврат Напоминание.ХарактеристикаДляДействий;
КонецФункции  

&НаСервере
Функция ПолучитьКонтрагентаХарактеристикиНаСервере()
	Возврат Напоминание.ХарактеристикаДляДействий.Контрагент;
КонецФункции


&НаСервере
Функция ПолучитьНоменклатуруХарактеристикиДляДействияНаСервере()
	Возврат Напоминание.ХарактеристикаДляДействий.Владелец;
КонецФункции

&НаСервере
Функция ПолучитьТекстСообщенияНаВайберПоВидеоНаСервере()
	Возврат "По артикулу " + Строка(Напоминание.ХарактеристикаДляДействий.Владелец.Артикул) + " " +  Строка(Напоминание.ХарактеристикаДляДействий.Владелец) + " з'явилось відео.";
КонецФункции


&НаСервере
Процедура УстановитьБроньНаСервере(Характеристика, Отказ)

	Если  Характеристика.ПериодБрони > КонецДня(ТекущаяДата())	  Тогда 
		Сообщить("Характеристика заброньована до " + Формат(Характеристика.ПериодБрони, "ДФ=dd.MM.yyyy")); 
		Отказ = Истина;	
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура ДействиеПоПредупреждению(Команда)

	ВыполнитьДействиеПриЗакрытии = Истина;
	
	Закрыть();	
	
	//ДействиеПоПредупреждениюНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)  

	Если ВыполнитьДействиеПриЗакрытии Тогда
		
		УстановитьВыполнено(УИД_Уведомления, Напоминание);
		
		ТипДействяПриНапоминании = ПолучитьТипДействияНапоминанияНаСервере();
		
		Если ТипДействяПриНапоминании = "ЗакрытиеСтарыхЗаказов" Тогда
			форма = ПолучитьФорму("Обработка.ЗакрытиеСтарыхЗаказов.Форма.Форма");
			форма.объект.Контрагент = ПолучитьКонтрагентаДляДействияНаСервере();
			форма.ОткрытьМодально();
			
		ИначеЕсли ТипДействяПриНапоминании = "ОтправкаСообщенияВайберОВидео" Тогда
			
			//#Если МобильноеПриложениеКлиент Тогда 		
				
				//ТекстСообщения = ПолучитьТекстСообщенияНаВайберПоВидеоНаСервере();
				//Если ТекстСообщения = Ложь Тогда 
				//	Сообщить("Не вдалося сформувати текст повідомлення");
				//КонецЕсли;
				//
				//НовВз = Новый ЗапускПриложенияМобильногоУстройства();
				//
				//НовВз.Действие = "android.intent.action.SEND";
				//НовВз.Приложение = "com.viber.voip"; 
				//НовВз.ИмяКласса = "com.viber.voip.WelcomeShareActivity"; 
				//НовВз.Тип = "text/plain";
				//НовВз.ДополнительныеДанные.Добавить("android.intent.extra.TEXT", ТекстСообщения);
				//
				//НовВз.Запустить(Истина);  
		
			//#Иначе
			//	
			//	ТекстСообщения = ПолучитьТекстСообщенияНаВайберПоВидеоНаСервере();
			//	Если ТекстСообщения = Ложь Тогда 
			//		Сообщить("Не вдалося сформувати текст повідомлення");
			//	КонецЕсли;
			//	
			//	Сообщить(ТекстСообщения);
			//	
			//#КонецЕсли
			
			
							
			Характеристика = ПолучитьХарактеристикуДляДействияНаСервере();
			ПараметрыФормы = Новый Структура("Ключ", Характеристика);
			ОткрытьФорму("Справочник.ХарактеристикиНоменклатуры.ФормаОбъекта", ПараметрыФормы,,,,,,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
			
			
		ИначеЕсли ТипДействяПриНапоминании = "ПродолжениеБрониТовара" Тогда
			
			Отказ = Ложь;		
			Характеристика = ПолучитьХарактеристикуДляДействияНаСервере();
			
			//УстановитьБроньНаСервере(Характеристика, Отказ);
			//
			//Если Отказ Тогда 	
			//	Возврат;
			//КонецЕсли;
			
			Форма = ПолучитьФорму("Справочник.Номенклатура.Форма.ФормаУстановкиБрони");
			Форма.Номенклатура = ПолучитьНоменклатуруХарактеристикиДляДействияНаСервере();
			Форма.Вага = Характеристика;
			Форма.НаКого = ПолучитьКонтрагентаХарактеристикиНаСервере();
			Форма.ОткрытьМодально();
			
		КонецЕсли;	
	КонецЕсли;

	ИндексЭлемента = МассивОткрытыхОконНапоминаний.Найти(Строка(УИД_Уведомления));
	Если Не ИндексЭлемента = Неопределено Тогда
		МассивОткрытыхОконНапоминаний.Удалить(ИндексЭлемента);
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ВыполнитьДействиеПриЗакрытии = Ложь;
КонецПроцедуры




